[
  {
    "id": "4e3c3c45-ce6e-4832-a132-759acc0cd480",
    "title": "Red Dead Redemption 2",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/9/24fbb5ce1d84f499b1fb0cf2c483287c-98.jpg",
    "platform": "Xbox One",
    "date": "October 26, 2018",
    "description": "Developed by the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America’s unforgiving heartland. The game’s vast and atmospheric world also provides the foundation for a brand new online multiplayer experience. America, 1899. The end of the Wild West era has begun. After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang has to rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal fissures threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang that raised him. [Rockstar]",
    "score": "97"
  },
  {
    "id": "8059e03e-55f7-477c-ac22-d57444dbf63b",
    "title": "Grand Theft Auto V",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/1/7f10462040718b3054c52f7791cf1c77-98.jpg",
    "platform": "Xbox One",
    "date": "November 18, 2014",
    "description": "Grand Theft Auto 5 melds storytelling and gameplay in unique ways as players repeatedly jump in and out of the lives of the game's three protagonists, playing all sides of the game's interwoven story.",
    "score": "97"
  },
  {
    "id": "fa4b4d2e-10a0-49de-891e-ce8acf1cd205",
    "title": "Metal Gear Solid V: The Phantom Pain",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/6/b6604eade078dd9167f2ed683a00fb62-98.jpg",
    "platform": "Xbox One",
    "date": "September 1, 2015",
    "description": "Following the prologue METAL GEAR SOLID V: GROUND ZEROES, METAL GEAR SOLID V: THE PHANTOM PAIN concludes the METAL GEAR SOLID V experience by following the story of the protagonist of the series, Big Boss (a.k.a. Snake). The METAL GEAR SOLID V experience is Creator and Director Hideo Kojima's first time incorporating open world gameplay to the groundbreaking METAL GEAR franchise.",
    "score": "95"
  },
  {
    "id": "302843fe-fb6d-4d22-a56e-edb0ee48000b",
    "title": "Celeste",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/7/c2d4b3e49ee25930e854dcd662411520-98.jpg",
    "platform": "Xbox One",
    "date": "January 26, 2018",
    "description": "Help Madeline survive her journey to the top of Celeste Mountain in this super-tight, hand-crafted platformer from the creators of TowerFall.",
    "score": "94"
  },
  {
    "id": "031241ae-6bda-4b74-9ca3-1cf9b54a649b",
    "title": "Resident Evil 2",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/7/f40eafe48991fcaf2568b9795370089e-98.jpg",
    "platform": "Xbox One",
    "date": "January 25, 2019",
    "description": "In Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City that transformed its population into deadly zombies. Both Leon and Claire have their own separate playable campaigns, allowing players to see the story from both characters’ perspectives. The fate of these two fan favorite characters is in players hands as they work together to survive and get to the bottom of what is behind the terrifying attack on the city. Will they make it out alive?",
    "score": "93"
  },
  {
    "id": "50bc606a-2c71-4799-a967-83937ec63026",
    "title": "INSIDE",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/1/b86322ec046780c594fda1702961ed0f-98.jpg",
    "platform": "Xbox One",
    "date": "June 29, 2016",
    "description": "Hunted and alone, a boy finds himself drawn into the center of a dark project. The second game from Limbo developer Playdead.",
    "score": "93"
  },
  {
    "id": "1335d071-6d7f-4273-bb67-43e0b2424eaa",
    "title": "Forza Horizon 4",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/8/e68ca0b7fdc8a0c3dd2df6792d8fd986-98.jpg",
    "platform": "Xbox One",
    "date": "September 28, 2018",
    "description": "For the first time in the racing and driving genre, experience dynamic seasons in a shared open-world. Explore beautiful scenery, collect over 450 cars, and become a Horizon Superstar in historic Britain.",
    "score": "92"
  },
  {
    "id": "6273b923-1fe9-4f9b-b2d4-0604c7d6937a",
    "title": "Divinity: Original Sin II - Definitive Edition",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/1/bafa8d1fe71c5113d8313e407174d5e2-98.jpg",
    "platform": "Xbox One",
    "date": "August 31, 2018",
    "description": "Set a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are a Sourcerer: a dangerously powerful individual whose abilities summon creatures from the encroaching Void. The Divine is dead and the Void is everywhere. Sourcerers are blamed and the Divine Order is leading the charge against the threat: you. Captured and sent to Fort Joy, you will be \"cured\" of your powers -- no matter the cost. But the Order has secrets of its own that may cast doubt on its so-called holy mission. As you escape from Fort Joy, you realize that if the world remains godless, it will be consumed by the Void.",
    "score": "92"
  },
  {
    "id": "90cba519-bdf1-4921-93fe-55d682f92fc6",
    "title": "What Remains of Edith Finch",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/2/87de43eaf2f4e07dff482aedd847676a-98.jpg",
    "platform": "Xbox One",
    "date": "July 19, 2017",
    "description": "What Remains of Edith Finch is a collection of short stories about a cursed family in Washington State.",
    "score": "92"
  },
  {
    "id": "3e125861-50df-4d81-841b-30b45b89fb96",
    "title": "The Witcher 3: Wild Hunt",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/6/125517eba511f72aba84a3d7a47a798c-98.jpg",
    "platform": "Xbox One",
    "date": "May 19, 2015",
    "description": "With the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic open world, slay beasts and decide the fates of whole communities with your actions, all in a genuine next generation format.",
    "score": "91"
  },
  {
    "id": "58163970-b0f0-44e6-8feb-f776db831dfc",
    "title": "Overwatch",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/7/8e6e4fc6afce19f84603b1697bd7477e-98.jpg",
    "platform": "Xbox One",
    "date": "May 23, 2016",
    "description": "Overwatch is a highly stylized team-based shooter set on earth in the near future. Every match is an intense multiplayer showdown pitting a diverse cast of soldiers, mercenaries, scientists, adventurers, and oddities against each other in an epic, globe-spanning conflict.",
    "score": "91"
  },
  {
    "id": "8c07e3e3-9e82-4345-9621-1cc2d25c8a46",
    "title": "Sekiro: Shadows Die Twice",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/5/0c9d4f0c2fe7df0dcdccd6541ffe8944-98.jpg",
    "platform": "Xbox One",
    "date": "March 22, 2019",
    "description": "Your death won’t come easily. Enter the world of late 1500s Sengoku Japan; a brutal, bloody period of constant life-and-death conflict. As tensions rise, a compelling new story unfolds amongst the chaos. Introducing Sekiro: Shadows Die Twice, a dark and twisted new gameplay experience developed by the renowned team at FromSoftware and published by Activision. Directed by Hidetaka Miyazaki, Sekiro: Shadows Die Twice is a third-person, action-adventure game with RPG elements. The single-player game puts players in the protagonist role of a hard-hearted warrior whose mission is to rescue his master, a young lord, and exact revenge on his arch nemesis. As “Sekiro,” or the “one-armed wolf,” players discover the many ways to strategically approach combat and engage enemies. [Activision]",
    "score": "91"
  },
  {
    "id": "5f54679f-b588-4c2c-9e9c-c68dd50bc621",
    "title": "Forza Horizon 3",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/7/54e778c0e3754fadc76bf8ec565130d6-98.jpg",
    "platform": "Xbox One",
    "date": "September 23, 2016",
    "description": "You are now in charge of the Horizon Festival. Customize everything, hire and fire your friends, and explore Australia in over 350 of the world’s greatest cars. Make your Horizon the ultimate celebration of cars, music, and freedom of the open road. How you get there is up to you. With the new Horizon Blueprint feature, you have the power to create and instantly share your custom gameplay. You can even hire friends to star in your festival and win you more fans. If they’re not winning you fans, fire them. Danger Sign Jumps, Convoys, Drift Zones, and Showcase events that pit you and against a fleet of speedboats, a giant zeppelin, and more. Select your own driver character, customize your cars, create vanity license plates – even choose your own horn sound. Drive to the music you love choosing from eight diverse radio stations, or create a custom station using your own music collection. In addition to 12-player online free roam and multiplayer racing, all-new 4-player online co-op allows you and your friends to enjoy the variety, competition, and rewards of a Horizon campaign together for the first time. [Xbox.com]",
    "score": "91"
  },
  {
    "id": "f62808a3-06bb-41a8-9391-19230933da57",
    "title": "Dead Cells",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/2/b4007446116f1fca84ea81022006ad84-98.jpg",
    "platform": "Xbox One",
    "date": "August 7, 2018",
    "description": "Dead Cells puts you in control of a failed alchemic experiment trying to figure out what's happening on a sprawling, ever-changing and seemingly cursed Island. Tough but fair combat, responsive controls, challenging foes, permadeath and of course, the emergency panic roll to get you out of trouble, make for a demanding, visceral and cathartic action game.\n\nExperience a roguevania, mixing an interconnected world, branching paths and unlockable skills with the constant adrenaline-pumping threat of permadeath. No checkpoints. You either vanquish the final boss in one go, or you try again. However, you keep some of your progress for successive runs; new paths you've unlocked, access to new levels, mutations, abilities and weapons.\n\nSpeaking of weapons, Dead Cells features a plethora of ways to slay your enemies. A large variety of swords, bows and of course spells, but also whips, grenades and turrets, each one with its own unique twist. Plus, mutations and scrolls allow you to build and customize your character differently with each and every run.\n\nAt the end of the day though, it's your skills as a player that matter most! Roguelites are about constantly sharpening your skills, until what was an insurmountable obstacle becomes a walk in the park. Patience, you'll get better! ... eventually.\n\nFEATURES:\n\n* Roguevania: The progressive exploration of an interconnected world, with the replayability of a rogue-lite and the adrenaline pumping threat of permadeath.\n\n* 2D Souls-lite Action: Tough but fair combat, the iconic dodge roll, more than 90 weapons and spells with unique gameplay... The unforgiving action wed to the absence of any kind of safety net makes for an adrenalin pumping ride each and every run.\n\n* Nonlinear Progression: Sewers, Ossuary or Ramparts? Once unlocked, special permanent abilities allow you to access new paths to reach your objective. Opt for the path that suits your current build, your play style, or just your mood.\n\n* Exploration: Secret rooms, hidden passages, charming landscapes. Take a moment to stroll the towers and breath in that fresh sea mist infused air.",
    "score": "91"
  },
  {
    "id": "3b75d45d-8340-4760-a004-5b33dbef9a93",
    "title": "F1 2020",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/1/c623b8eafe8fe931793e7f004b663b86-98.jpg",
    "platform": "Xbox One",
    "date": "July 10, 2020",
    "description": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.",
    "score": "91"
  },
  {
    "id": "702b2042-6be5-40f9-9393-53c9e99b3640",
    "title": "Monster Hunter: World - Iceborne",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/1/a42bd2f0338dd5871fdb5c4e2c1fbc84-98.jpg",
    "platform": "Xbox One",
    "date": "September 6, 2019",
    "description": "Monster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivals the gameplay volume from the original release and features a new icy setting, storyline, monsters, gameplay options, and more.\n\nThe game's all-new story picks up after Monster Hunter: World and whisks hunters away to the newly discovered chilly locale that, once fully explored, becomes the largest region in World so far. The new locale is home to several new and returning monsters ready to challenge hunters throughout their expeditions and raises the stakes with the added higher difficulty Master Rank. Iceborne continues the skill-based progression and robust crafting system found in World and expands that with several new gameplay features that broaden the player's combat repertoire. All this leads to the ultimate hunter test against the mysterious new flagship monster, Velkhana.",
    "score": "90"
  },
  {
    "id": "c20db544-8a79-4915-8039-e6067c093f9e",
    "title": "NieR: Automata - Become as Gods Edition",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/5/3eb7cdf2f8fa540522cccd9e9e99d7c8-98.jpg",
    "platform": "Xbox One",
    "date": "June 26, 2018",
    "description": "NieR: Automata is an action RPG set in a post-apocalyptic world overrun by machine lifeforms and abandoned by mankind. As part of an android army created by humans to reclaim the planet, players will fight their way through the mechanical horde using a collective of close-combat weapons and ranged attacks.",
    "score": "90"
  },
  {
    "id": "cfad2371-90c3-48e2-a831-f3dd5186eb2d",
    "title": "Monster Hunter: World",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/9/389146338b6fb19854c933c8cf407455-98.jpg",
    "platform": "Xbox One",
    "date": "January 26, 2018",
    "description": "In Monster Hunter: World you assume the role of a hunter venturing to a new continent where you track down and slay ferocious beasts in heart-pounding battles. This new land and its diverse inhabitants play a critical role in each quest as you strategically use the surrounding environment including terrain, vegetation and wildlife to your advantage in battle or become hindered by the hazards they present. As a hunter, you must use your cunning and expertise to track and maneuver your targets throughout the intense, evolving battles. [Capcom]",
    "score": "90"
  },
  {
    "id": "c14baf54-dfde-467d-be8e-dec2fc38d9e4",
    "title": "Ori and the Will of the Wisps",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/9/219ace008faa25de2f1fa5c37a0d6486-98.jpg",
    "platform": "Xbox One",
    "date": "March 11, 2020",
    "description": "The little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and the Blind Forest comes the highly anticipated sequel. Embark on an all-new adventure in a vast world filled with new friends and foes that come to life in stunning, hand-painted artwork. Set to a fully orchestrated original score, Ori and the Will of the Wisps continues the Moon Studios tradition of tightly crafted platforming action and deeply emotional storytelling.",
    "score": "90"
  },
  {
    "id": "d6b79541-daaf-4b2a-96a8-8376c17ff1ac",
    "title": "NBA 2K17",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/6/456c7e872e9d2195a9553a7f2b69231c-98.jpg",
    "platform": "Xbox One",
    "date": "September 16, 2016",
    "description": "NBA 2K17 promises to take the game to new heights and continue to blur the lines between video game and reality.",
    "score": "90"
  },
  {
    "id": "55705578-8773-4086-979e-6b4723f198b6",
    "title": "Yakuza 0",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/6/1b26b8df9dcfdf60c6f51c4f8216404d-98.jpg",
    "platform": "Xbox One",
    "date": "February 26, 2020",
    "description": "Tokyo 1988. Getting rich is easy, the women are beautiful, and everyone wants in on the action. It's time to become Yakuza.\n\nThe glitz, glamour, and unbridled decadence of the 80s are back in Yakuza 0!\n \nFight like hell through Tokyo and Osaka with protagonist Kazuma Kiryu and series regular Goro Majima. Play as Kazuma Kiryu and discover how he finds himself in a world of trouble when a simple debt collection goes wrong and his mark winds up murdered. Then, step into the silver-toed shoes of Goro Majima and explore his \"normal\" life as the proprietor of a cabaret club.\n\nSwitch between three different fighting styles instantaneously and beat up all manner of goons, thugs, hoodlums, and lowlifes. Take combat up a notch by using environmental objects such as bicycles, sign posts, and car doors for bone-crunching combos and savage take-downs.\n\nFighting is not the only way to kill time in 1988's Japan: from discos and hostess clubs to classic SEGA arcades, there are tons of distractions to pursue in the richly detailed, neon-lit world.\n\nInteract with the colourful denizens the red light district: help a budding S&M dominatrix learn her profession, or ensure a street performer can make it to the bathroom in time there are 100 incredible stories to discover.",
    "score": "90"
  },
  {
    "id": "5e90ea2b-d2ff-4946-a75f-cb08fa70d4e6",
    "title": "F1 2019",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/2/e072330b9fde7d0568b8bb5f855a4b6b-98.jpg",
    "platform": "Xbox One",
    "date": "June 25, 2019",
    "description": "The official videogame of the 2019 FIA Formula One World Championship, F1 2019 challenges you to Defeat your Rivals in the most ambitious F1 game in Codemasters' history. The game is released a full two months earlier during the Formula 1 myWorld Grosser Preis von Osterreich 2019 weekend and, unlike previous iterations, ahead of the British, German and Hungarian races.\n\nF1 2019 features all the official teams, drivers and all 21 circuits from the 2019 season. This year sees the inclusion of F2 with players being able to complete the 2018 season with the likes of George Russell, Lando Norris and Alexander Albon. The 2019 F2 season content will be made available as a free digital update during the season.\n\nHaving established itself as one of the highest rated racing franchises of all time, F1 2019 builds on the success of previous iterations and delivers an experience that rivals the quality and production values of its real-life race counterpart. With greater emphasis on graphical fidelity, the environments have been significantly enhanced, and the tracks come to life like never before. Night races have been completely overhauled creating vastly improved levels of realism and the upgraded F1 broadcast sound and visuals add further realism to all aspects of the race weekend.",
    "score": "89"
  },
  {
    "id": "34fb9314-741a-471a-8e32-e3c2e2743a3a",
    "title": "Dark Souls II: Scholar of the First Sin",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/1/d77105c24162e419f6359fad4e8a3885-98.jpg",
    "platform": "Xbox One",
    "date": "April 7, 2015",
    "description": "Dark Souls II: Scholar of the First Sin includes the 3 previously released DLC packs  - Crown of the Sunken King, Crown of the Old Iron King, and Crown of the ivory King - along with additional features. All versions of the game include the following features (Existing Dark Souls II owners will receive a patch to implement these elements): Additional NPCs added for an enhanced story experience. Parameter adjustments for improved game balance. Augmented item descriptions. Improved online matchmaking functionality. [Bandai Namco]",
    "score": "89"
  },
  {
    "id": "8bfb43c3-36ae-4d7e-a8e1-86a75f25afe8",
    "title": "Stardew Valley",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/4/c950466e06b155009de1f0dc84bc951f-98.jpg",
    "platform": "Xbox One",
    "date": "December 14, 2016",
    "description": "You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness!\n\nFeatures:\n\n*    Turn your overgrown field into a lively farm! Raise animals, grow crops, start an orchard, craft useful machines, and more! You'll have plenty of space to create the farm of your dreams.\n\n*    Improve your skills over time. As you make your way from a struggling greenhorn to a master farmer, you'll level up in 5 different areas: farming, mining, combat, fishing, and foraging. As you progress, you'll learn new cooking and crafting recipes, unlock new areas to explore, and customize your skills by choosing from a variety of professions.\n\n*    Become part of the local community. With over 30 unique characters living in Stardew Valley, you won't have a problem finding new friends! Each person has their own daily schedule, birthday, unique mini-cutscenes, and new things to say throughout the week and year. As you make friends with them, they will open up to you, ask you for help with their personal troubles, or tell you their secrets! Take part in seasonal festivals such as the luau, haunted maze, and feast of the winter star.\n\n*    Explore a vast, mysterious cave. As you travel deeper underground, you'll encounter new and dangerous monsters, powerful weapons, new environments, valuable gemstones, raw materials for crafting and upgrading tools, and mysteries to be uncovered.\n\n*    Breathe new life into the valley. Since JojaMart opened, the old way of life in Stardew Valley has changed. Much of the town's infrastructure has fallen into disrepair. Help restore Stardew Valley to it's former glory by repairing the old community center, or take the alternate route and join forces with Joja Corporation.\n\n*    Court and marry a partner to share your life on the farm with. There are 10 available bachelors and bachelorettes to woo, each with unique character progression cutscenes. Once married, your partner will live on the farm with you. Who knows, maybe you'll have kids and start a family?\n\n*    Spend a relaxing afternoon at one of the local fishing spots. The waters are teeming with seasonal varieties of delicious fish. Craft bait, bobbers, and crab pots to help you in your journey toward catching every fish and becoming a local legend!\n\n*    Donate artifacts and minerals to the local museum.\n\n*    Cook delicious meals and craft useful items to help you out. With over 100 cooking and crafting recipes, you'll have a wide variety of items to create. Some dishes you cook will even give you temporary boosts to skills, running speed, or combat prowess. Craft useful objects like scarecrows, oil makers, furnaces, or even the rare and expensive crystalarium.\n\n*    Customize the appearance of your character and house. With hundreds of decorative items to choose from, you'll have no trouble creating the home of your dreams!\n\n*    Xbox controller support (with rumble)! (Keyboard still required for text input)\n\n*    Over two hours of original music.",
    "score": "89"
  },
  {
    "id": "5b07fc74-e1ff-428f-a5a2-0cf389c4407b",
    "title": "Destiny: The Taken King",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/2/721690b21a50edc2f69b3ab11b6c0cab-98.jpg",
    "platform": "Xbox One",
    "date": "September 15, 2015",
    "description": "To battle the Darkness and the Taken army, players get brand new subclasses with new supers. Warlocks now harness the power of an electric storm, Hunters carve a bow formed from gravitational void energy, and Titans summon a flaming hammer that can sear their adversaries from a range or deliver a devastating melee impact.",
    "score": "89"
  },
  {
    "id": "e7a0ca4d-4d0d-4ea2-bf78-42777dccfb70",
    "title": "Injustice 2",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/7/3797833ce61489388f8a8f521439b556-98.jpg",
    "platform": "Xbox One",
    "date": "May 16, 2017",
    "description": "Every battle defines you.\n\nPower up and build the ultimate version of your favorite DC legends in INJUSTICE 2. With a massive selection of DC Super Heroes and Super-Villains, INJUSTICE 2 allows you to equip every iconic character with unique and powerful gear earned throughout the game. Experience an unprecedented level of control over how your favorite characters look, how they fight, and how they develop across a huge variety of game modes. This is your super Hero. Your Journey. Your Injustice.",
    "score": "89"
  },
  {
    "id": "c0e53c3f-5ccb-453a-813f-fba1dc2b24e8",
    "title": "Fallout 4",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/8/e5ab8d808956ca18bc20ffb921979f40-98.jpg",
    "platform": "Xbox One",
    "date": "November 10, 2015",
    "description": "As the sole survivor of Vault 111, you enter a world destroyed by nuclear war. Every second is a fight for survival, and every choice is yours. Only you can rebuild and determine the fate of the Wasteland. Welcome home.",
    "score": "88"
  },
  {
    "id": "c3a65ac0-c447-4185-a902-8395af1b7b43",
    "title": "N++",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/1/78dae51f9755c5a169841acc51e8b6ec-98.jpg",
    "platform": "Xbox One",
    "date": "October 4, 2017",
    "description": "N++ is a fast-paced, action-packed puzzle platformer set in the distant future. You play as a ninja, darting through obstacles, narrowly evading a slew of inadvertently homicidal enemy robots and collecting delicious gold in a minimalist, sci-fi world.\n\nN++ is all about smooth physics, deftly controlling the speed and inertia of the ninja,and the awesome feeling of fluidly moving through each level. It's bursting with hundreds of single player and multiplayer levels, each featuring a series of difficult challenges, diabolical traps and a distinct visual style to nimbly soar through.\n\nIf that wasn't enough, the integrated level-editor allows you to make and share your levels with every other person on the planet. Get ready for the biggest test of your ninja skills yet!",
    "score": "88"
  },
  {
    "id": "b9c9539a-0076-48fa-9108-0923494c29b7",
    "title": "Wolfenstein II: The New Colossus",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/1/18964bda038a02f7b758781fcfee2326-98.jpg",
    "platform": "Xbox One",
    "date": "October 27, 2017",
    "description": "Wolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players to Nazi-controlled America on a mission to recruit the boldest resistance leaders left. Fight the Nazis in iconic American locations, equip an arsenal of badass guns, and unleash new abilities to blast your way through legions of Nazi soldiers in this definitive first-person shooter. America, 1961. The Nazis maintain their stranglehold on the world. You are BJ Blazkowicz, aka Terror-Billy, member of the Resistance, scourge of the Nazi empire, and humanitys last hope for liberty. Only you have the guts, guns, and gumption to return stateside, kill every Nazi in sight, and spark the second American Revolution.",
    "score": "88"
  },
  {
    "id": "b2a9676e-bb38-4622-b603-6312e85963d1",
    "title": "Divinity: Original Sin Enhanced Edition",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/5/d1f2fa0e5af5fabf2023f78be115b7f0-98.jpg",
    "platform": "Xbox One",
    "date": "October 27, 2015",
    "description": "Divinity Original Sin: Enhanced Edition is a much lauded Role-Playing-Game that blends deep customization and humor with dynamic turn based combat. Either in online co-op, split-screen co-op on your TV, or even alone, take advantage of a classless RPG system to create your heroes and conquer the evils of Rivellon!\n\nEmbark upon a journey with up to three companions as you bend the very fabric of time, where what seems like the case of a simple murder unravels into hours of quests facing fiendish foes, magical polymorphs, and dastardly bosses. As a Source Hunter, master the elements and use the environment to your advantage in dynamic combats mixing weather and magic to explode, poison, electrify, freeze and burn your enemies!",
    "score": "88"
  },
  {
    "id": "596a7e42-1b03-4d41-b982-72a534cf7c1d",
    "title": "FIFA 14",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/0/582932037740b6dfc9b7faadfdb21356-98.jpg",
    "platform": "Xbox One",
    "date": "November 19, 2013",
    "description": "Shooting has been transformed. Players now have the intelligence to adjust their stride and approach angle to find the best position for hitting the back of the net. Well-hit balls feel satisfying and goals are rewarding. As well as quality strikes, players can now shoot while off balance or rushed.",
    "score": "88"
  },
  {
    "id": "dfe603ff-8e29-47de-b035-99b69c9d5be3",
    "title": "Ori and the Blind Forest: Definitive Edition",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/3/f4be962d47f78b99090a0fd779f135ad-98.jpg",
    "platform": "Xbox One",
    "date": "March 11, 2016",
    "description": "Ori and the Blind Forest: Definitive Edition delivers a multitude of new areas, difficulty options, and gameplay upgrades that should appeal to both new and seasoned Ori players.",
    "score": "88"
  },
  {
    "id": "c4082cf0-ea68-4e09-81bc-ac90bc49da4d",
    "title": "Dishonored 2",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/5/dd750d44abf361b6d64136986a20bcd9-98.jpg",
    "platform": "Xbox One",
    "date": "November 10, 2016",
    "description": "Dishonored 2 takes your protagonist, Corvo Attano or Emily Kaldwin, to the coastal city of Karnaca where the choices you make will have significant impact on the world.",
    "score": "88"
  },
  {
    "id": "81a34b84-e581-4ac9-a3cc-98a06cd6ab06",
    "title": "The Banner Saga 3",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/9/b5266e0d4541afc3f2536497a2e56f6e-98.jpg",
    "platform": "Xbox One",
    "date": "July 26, 2018",
    "description": "The Banner Saga 3 is the epic conclusion to a sweeping viking saga six years in the making. This strategic RPG, acclaimed for its strong story and compelling characters has has won over 20 awards and been nominated for 4 BAFTA awards.",
    "score": "88"
  },
  {
    "id": "4971e000-1c34-4627-9019-54e9bb1bf8d0",
    "title": "DOOM Eternal",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/5/e2edd6022f418bf951ba01b19458eb65-98.jpg",
    "platform": "Xbox One",
    "date": "March 19, 2020",
    "description": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]",
    "score": "88"
  },
  {
    "id": "b8a5bef9-4635-4eb4-b367-1dab9b54164d",
    "title": "Minecraft: Xbox One Edition",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/1/54a58d8388bafd7e3248324cb64cda41-98.jpg",
    "platform": "Xbox One",
    "date": "November 18, 2014",
    "description": "Minecraft: Xbox One Edition is a game about placing blocks to build anything you can imagine and was revealed at E3 that it will be coming to the Xbox One.",
    "score": "88"
  },
  {
    "id": "23d58953-bba8-44f4-a81f-3f200ba7251f",
    "title": "Guacamelee! Super Turbo Championship Edition",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/1/a1a4e13424619792c8c1860138e98039-98.jpg",
    "platform": "Xbox One",
    "date": "July 2, 2014",
    "description": "Guacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania style of games, by adding a strong melee combat component, a new dimension switching mechanic, and cooperative same-screen multiplayer for the entire story. The game also blurs the boundaries between combat and platforming by making many of the moves useful and necessary for both of these.",
    "score": "88"
  },
  {
    "id": "df29abd9-86b0-4895-9cad-4a5936d05d0b",
    "title": "Ori and the Blind Forest",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/0/350b56823429739e914c1e0da9f8f59c-98.jpg",
    "platform": "Xbox One",
    "date": "March 11, 2015",
    "description": "Ori and the Blind Forest is a bit of a genremix – It’s a ‘Metroidvania‘, but with a stronger platforming focus and light RPG elements, all set within an atmospheric world.",
    "score": "88"
  },
  {
    "id": "900e8683-dbc3-4352-bbaf-3ba152426254",
    "title": "Apex Legends",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/2/68650e329d74f0d2074148ccc07b1163-98.jpg",
    "platform": "Xbox One",
    "date": "February 4, 2019",
    "description": "Conquer with character in Apex Legends, a free-to-play Battle Royale shooter where legendary characters with powerful abilities team up to battle for fame and fortune on the fringes of the Frontier. Master an ever-growing roster of diverse legends, deep tactical squad play, and bold new innovations that level-up the Battle Royale experience—all within a rugged world where anything goes. Welcome to the next evolution of Battle Royale.",
    "score": "88"
  },
  {
    "id": "20d1adbe-c396-467a-8e76-6b40d6c1ba7f",
    "title": "Hellblade: Senua's Sacrifice",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/1/0728fad0f426fc8eb7dc9752a105a0b8-98.jpg",
    "platform": "Xbox One",
    "date": "April 11, 2018",
    "description": "An independent game from Ninja Theory - makers of Heavenly Sword, Enslaved: Odyssey to the West & DmC: Devil May Cry. Hellblade: Senua's Sacrifice takes you on a journey into savage viking heartland with Senua, a Celtic warrior struggling with trauma & psychosis.",
    "score": "88"
  },
  {
    "id": "1f5c9c31-6704-4562-895f-da9d9424a57d",
    "title": "Devil May Cry 5",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/7/b8caf80845e2c635ce3054a241021f1a-98.jpg",
    "platform": "Xbox One",
    "date": "March 8, 2019",
    "description": "A brand-new entry in the over-the-top action series comes complete with its signature blend of high-octane stylized action and otherworldly and original characters the series is known for. Years have passed since the legions of hell have set foot in this world, but now a new demonic invasion has begun, and humanity’s last hope will rest in the hands of three lone demon hunters, each offering a radically different play style. United by fate and a thirst for vengeance, these demon hunters will have to face their demons if they hope to survive. [Xbox.com]",
    "score": "87"
  },
  {
    "id": "b2bacb6f-1e47-4d85-9066-7fe75615a3f5",
    "title": "Middle-earth: Shadow of Mordor",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/9/366dc928fc0878ce3a40a126ebb0cf13-98.jpg",
    "platform": "Xbox One",
    "date": "September 30, 2014",
    "description": "Fight your way through Mordor and reveal the truth of the spirit that compels you, discover the origins of the Rings of Power, build your legend and ultimately confront the evil of Sauron in this new story of Middle-earth.",
    "score": "87"
  },
  {
    "id": "26527049-412c-4113-aff3-bac1e4e792e0",
    "title": "DOOM",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/3/6f10b9a6a37276f25667077fefc251b0-98.jpg",
    "platform": "Xbox One",
    "date": "May 13, 2016",
    "description": "There is no taking cover or stopping to regenerate health in campaign mode as you beat back Hell’s raging demon hordes. Combine your arsenal of futuristic and iconic guns, upgrades, movement and an advanced melee system to knock-down, slash, stomp, crush, and blow apart demons in creative and violent ways. In multiplayer, dominate your opponents in DOOM’s signature, fast-paced arena-style combat. In both classic and all-new game modes, annihilate your enemies utilizing your personal blend of skill, powerful weapons, vertical movement, and unique power-ups that allow you to play as a demon. DOOM SnapMap is an easy-to-use game and level editor that allows for limitless gameplay experiences on every platform. Anyone can snap together and customize maps, add pre-defined or custom gameplay, and edit game logic to create new modes. Instantly play your creation or make it available to players around the world. [ID/Bethesda]",
    "score": "87"
  },
  {
    "id": "eb2ecdf6-f311-41a8-9118-4123293d78a8",
    "title": "Battlefield 1",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/2/a266966a3f5f45a8da3ce0bfb6b06c22-98.jpg",
    "platform": "Xbox One",
    "date": "October 18, 2016",
    "description": "Intuitive destruction and dynamic weather ensure that no battle is ever the same. For even more gameplay possibilities, carve a path through walls and buildings, take down your enemies in creative ways, and leave your mark on the terrain around you through intuitive destruction. Through your actions, the pristine world around you change into a battle-scarred landscape, changing the world forever. With dynamic weather you will need to adapt your tactics to weather changes as the elements play a part in the battle. Playing the same map on a bright day, in heavy fog, or rain will impact what you see and hear, forcing you to adapt your play style on an ever-changing battlefield. Operations introduces a new way to play multiplayer. In Battlefield 1 you play a series of interconnected battles across multiple fronts. Play a sequence of battles where your actions have consequences beyond a single match, as you try to conquer territory or push back your attackers. At those times when you feel all is lost, call in the Behemoths - the largest fully player-controlled vehicles ever seen in Battlefield. Roam the battlefield and rain fire on your enemy to break their defenses. All-out war never felt so epic. Take control of the Armored Train, Air Ship, or the Battleship to dominate the battlefield across land, air, and sea. [Electronic Arts]",
    "score": "87"
  },
  {
    "id": "f8b7fc04-5fbb-4f8e-b199-95e98a7eb16e",
    "title": "Dark Souls III",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/3/1c85bae45b1d549c2c22ae0780106bc5-98.jpg",
    "platform": "Xbox One",
    "date": "April 12, 2016",
    "description": "Developed by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge and deep RPG gameplay as they search for a way to survive the coming apocalypse.",
    "score": "87"
  },
  {
    "id": "c17765bf-5bf6-41cd-9700-1a94af32714d",
    "title": "Assassin's Creed Odyssey",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/9/a482ef1d5578b034141a141198a058ec-98.jpg",
    "platform": "Xbox One",
    "date": "October 2, 2018",
    "description": "Write your own epic odyssey and become a legendary Spartan hero. Forge your destiny in a world on the brink of tearing itself apart. Influence how history unfolds in an ever-changing world shaped by your choices.\n\nFeatures:\n\n* LEGENDARY SPARTAN HERO - Embark on your journey from outcast to legendary Spartan hero.\n* ANCIENT GREECE AWAITS - Explore an entire country full of unexpected encounters in untamed environments and bustling ancient cities.\n* CHOOSE YOUR PATH - Your choices shape the world around you. Play in a living world that constantly reacts to your every decision.\n* FIGHT EPIC BATTLES - Charge into epic clashes between Sparta and Athens in battles pitting 150v150 soldiers against each other.\n* SAIL THE AEGEAN SEA - Recruit crewmembers and customize your ship as you explore and battle your way on the open seas.",
    "score": "87"
  },
  {
    "id": "4865a0ac-db7d-4baf-9428-feeb92d98084",
    "title": "Forza Motorsport 6",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/6/8a6cb38b3282ebcb961abd0b40892a03-98.jpg",
    "platform": "Xbox One",
    "date": "September 15, 2015",
    "description": "More than 450 cars all carefully recreated and customizable, and complete with working cockpits and full damage. Tour twenty-six world-famous locales including Daytona, Le Mans, and more. 2-player split-screen racing, 24-player races, and realistic Drivatar opponents deliver packed tracks and action.",
    "score": "87"
  },
  {
    "id": "74663d74-294a-4189-b919-9f7d7758277e",
    "title": "Rocket League",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/1/7f873c4abe8ecbe7e30143990f93a04a-98.jpg",
    "platform": "Xbox One",
    "date": "February 17, 2016",
    "description": "Fire your rockets. High-octane team sports. Get behind the wheel of a high-flying, hard-hitting rocket powered car and drive into the Rocket League arena. Choose from a variety of vehicles to drive and customise in this football-meets-destruction derby team sport and master the skills youll need to fire home the goals. Soar high into the air to perform daring acrobatic strikes and daredevil saves, or use aggressive tactics to take down rival players at supersonic speeds.",
    "score": "87"
  },
  {
    "id": "eaabd88f-206b-46fc-a1b4-af42017b5b32",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/8/6af7ce78618dba784269787232b74e1c-98.jpg",
    "platform": "Xbox One",
    "date": "January 28, 2020",
    "description": "KENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.",
    "score": "87"
  },
  {
    "id": "9f825cb2-5ae4-4755-b2e7-22259bf7885e",
    "title": "Pro Evolution Soccer 2017",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/6/9c561d3cddcff38b8f385450382edbd2-98.jpg",
    "platform": "Xbox One",
    "date": "September 13, 2016",
    "description": "In PES 2017, the 1st touch is calculated by player attributes, as well as the further inclusion of real ball physics directly controlled by the input ball touch. See how different players control the ball in unique and different ways based on where and how you control them, dictating the flow of the game based on how they react to the unpredictable movement of the ball. In addition, there is more control in how you receive passes, and depending on the pass, players can visually execute the exact play intended, from receiving a pass to sending the ball out again. [Konami]",
    "score": "87"
  },
  {
    "id": "9338922c-c741-477a-a73f-f7514c547d4e",
    "title": "Titanfall 2",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/1/8ce66d6bf1274d3cd409a2c9b24b88f4-98.jpg",
    "platform": "Xbox One",
    "date": "October 28, 2016",
    "description": "In single player, Titanfall 2 delivers a crafted experience that explores the unique bond between man and machine. Playable offline, the single player campaign in Titanfall 2 lets fans step out onto The Frontier as a Militia rifleman with aspirations of becoming an elite Pilot. Stranded behind enemy lines and facing overwhelming odds, players must team up with a veteran Titan to uphold a mission they were never meant to carry out. In multiplayer, Respawn is continuing to evolve their gameplay to provide a more robust experience that delivers expanded depth and variety that includes six new Titans, deeper Pilot abilities, more customization options, and a robust progression system that is sure to satisfy fans. [Electronic Arts]",
    "score": "87"
  },
  {
    "id": "e51cc494-2b07-456c-8323-d9118ec1716e",
    "title": "Huntdown",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/8/83ffaa5681c54e95e7bdd9fcb2bad430-98.jpg",
    "platform": "Xbox One",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "87"
  },
  {
    "id": "6617aab7-21bb-4a6c-a712-a896372f0ff9",
    "title": "Destiny 2",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/5/545393e533fe4ec4c665ef5f17e10272-98.jpg",
    "platform": "Xbox One",
    "date": "September 6, 2017",
    "description": "In Destiny 2, the last safe city on Earth has fallen and lays in ruins, occupied by a powerful new enemy and his elite army, the Red Legion. Every player creates his own character called a “Guardian,” humanity’s chosen protectors.  As a Guardian in Destiny 2, players must master new abilities and weapons to reunite the city’s forces, stand together and fight back to reclaim their home. In Destiny 2 players embark on a fresh story filled with new destinations around our solar system to explore, and an expansive amount of activities to discover.  There is something for almost every type of gamer in Destiny 2, including gameplay for solo, cooperative and competitive players set within a vast, evolving and exciting universe. [Bungie]",
    "score": "87"
  },
  {
    "id": "692bdd56-a6cc-472a-b32c-05ed4569482f",
    "title": "Forza Horizon 3: Blizzard Mountain",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/8/759eaf614f3940479acbd71e51a6f425-98.jpg",
    "platform": "Xbox One",
    "date": "December 13, 2016",
    "description": "Blizzard Mountain invites players to the snowy elevations of a brand new playable area of Forza Horizon 3’s Australia. This is a place where speedy vehicles are welcome, ice and blizzard conditions are the norm, and snow tires are heartily recommended.",
    "score": "87"
  },
  {
    "id": "30d2b20e-c6b5-41bd-82b8-c129b49f0ada",
    "title": "XCOM 2",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/8/b39da50f15e510d93a69fb62145eca3b-98.jpg",
    "platform": "Xbox One",
    "date": "September 27, 2016",
    "description": "Earth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, building shining cities that promise a brilliant future for humanity on the surface, while concealing a sinister agenda and eliminating all who dissent from their new order. Only those who live at the edges of the world have a margin of freedom. Here, a force gathers once again to stand up for humanity. Always on the run, and facing impossible odds, the remnant XCOM forces must find a way to ignite a global resistance, and eliminate the alien threat once and for all.",
    "score": "87"
  },
  {
    "id": "b778193a-985e-46c2-ae20-fa5c1f2c73b5",
    "title": "Tony Hawk's Pro Skater 1 + 2",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/1/eaaf3c57ebb0d6806ffa77379578738d-98.jpg",
    "platform": "Xbox One",
    "date": "September 4, 2020",
    "description": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.",
    "score": "87"
  },
  {
    "id": "1885618d-9418-496e-a2ab-38593e185051",
    "title": "Forza Horizon 3: Hot Wheels",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/6/f75ef6d591e38e3a1e49247a985ce272-98.jpg",
    "platform": "Xbox One",
    "date": "May 9, 2017",
    "description": "Forza Horizon 3 Hot Wheels, the latest expansion for Forza Horizon 3, is now available exclusively on both Xbox One and Windows 10 PCs. Available either as part of the Forza Horizon 3 Expansion Pass, or as a standalone purchase, Forza Horizon 3 Hot Wheels transports you to a new Australian locale, where orange tracks spiral and loop into the air and iconic Hot Wheels cars come to life.",
    "score": "87"
  },
  {
    "id": "c1e3b406-7de4-489b-8ee8-0161e7dacbb8",
    "title": "Okami HD",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/8/c6a4d323290382930190eb2d478dbce2-98.jpg",
    "platform": "Xbox One",
    "date": "December 12, 2017",
    "description": "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.",
    "score": "87"
  },
  {
    "id": "1e1feee6-7432-4f7f-bb67-30f580a81127",
    "title": "Thumper",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/7/c3d6f9b59d4945726db2c2bd2b697551-98.jpg",
    "platform": "Xbox One",
    "date": "August 18, 2017",
    "description": "Thumper is rhythm violence: classic rhythm-action, blistering speed, and brutal physicality.",
    "score": "86"
  },
  {
    "id": "eb688d46-1ec9-4259-9942-13359312a031",
    "title": "The Witness",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/6/36e5be2ec84133873f3ea3005ca33efa-98.jpg",
    "platform": "Xbox One",
    "date": "September 13, 2016",
    "description": "You wake up, alone, on a strange island full of puzzles that will challenge and surprise you. You don't remember who you are, and you don't remember how you got here, but there's one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehow finding your way home. The Witness is a single-player game in an open world with dozens of locations to explore and over 500 puzzles. This game respects you as an intelligent player and it treats your time as precious. There's no filler each of those puzzles brings its own new idea into the mix. So, this is a game full of ideas.",
    "score": "86"
  },
  {
    "id": "06ef42ea-6f46-4412-845b-d9c184e8df6b",
    "title": "DiRT Rally",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/6/a1f6f9ca6c54f3afd00465790977d2c6-98.jpg",
    "platform": "Xbox One",
    "date": "April 5, 2016",
    "description": "DiRT Rally features 39 of the most iconic and relevant cars from yesteryear through to modern day, representing the cars that the players want, and the ones that make the most sense for the surfaces they race on. Six rallies with over 70 stages. Head to the muddy paths of Wales, the dusty trails of Greece and the icy tarmac of Monte Carlo. Take on the legendary hillclimb of Pikes Peak, the snowy thrills of Sweden, and the epic scenery of Finland. DiRT Rally has the iconic locations to test your nerve and delight your senses. Race at the Lydden Hill, Holjes and Hell tracks in six of the fastest off-road cars and take on your friends in bumper-to-bumper multiplayer racing.",
    "score": "86"
  },
  {
    "id": "88670555-399c-48b1-866d-d4599ba064ed",
    "title": "Sid Meier's Civilization VI",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/7/92ea4614d1fa4091a00e13295eb8b983-98.jpg",
    "platform": "Xbox One",
    "date": "November 22, 2019",
    "description": "Civilization VI offers new ways to interact with your world, expand your empire across the map, advance your culture, and compete against historys greatest leaders to build a civilization that will stand the test of time.",
    "score": "86"
  },
  {
    "id": "35d0f1a5-ec7c-4d9e-b037-79777b3401e8",
    "title": "Cuphead",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/1/9aac176f7ec2a599351e1014fbd13800-98.jpg",
    "platform": "Xbox One",
    "date": "September 29, 2017",
    "description": "Cuphead is a classic run and gun action game primarily focused on boss battles. Inspired by the cartoons of the 1930s, the visuals and audio are carefully created with the same techniques of the era, i.e. traditional cel animation (hand drawn & hand inked), watercolor backgrounds, and original jazz recordings. Play as Cuphead or Mugman (in single player or co-op) as you traverse strange worlds, acquire new weapons, learn powerful super moves, and discover hidden secrets. [Studio MDHR]",
    "score": "86"
  },
  {
    "id": "69fc8e1f-1978-43eb-bcb8-5c548a0f307b",
    "title": "Killer Instinct Season 3",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/6/8a33f73a5fdd0f7651ce635ecea16a1d-98.jpg",
    "platform": "Xbox One",
    "date": "March 29, 2016",
    "description": "Eight characters are coming to Killer Instinct with the Season 3 update, including Rash (Battletoads), Arbiter (Halo), Kim Wu, and Tusk.",
    "score": "86"
  },
  {
    "id": "14b76ffe-4fd3-4037-80e5-5f5cf1cd60ca",
    "title": "Pillars of Eternity: Complete Edition",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/1/ac8b3d1e730ca3f6ba538b8ab0acf2ef-98.jpg",
    "platform": "Xbox One",
    "date": "August 29, 2017",
    "description": "Pillars of Eternity, the ultimate role-playing experience on PC, comes to Xbox One! Created by and for role-playing fans by Obsidian Entertainment, masters of the RPG genre, Pillars started as a Kickstarter project, where it shattered all funding goals and pulled in more than 75,000 backers. From there, it released to broad critical acclaim, won dozens of awards, and has been a fan favorite on the PC. Now, Paradox Arctic has adapted this unmissable RPG for an entirely new audience on major consoles -- bringing Pillars' fantastical world, tactical combat, and unforgettable story to fans on a whole new platform. Pillars of Eternity: Complete Edition includes all previously released additional content from the PC version, including all DLC and expansions in a single package. \n\nBut Pillars of Eternity: Complete Edition goes beyond just offering everything together. Paradox Arctic has thoroughly updated the Xbox One version of the award-winning RPG for play with a controller, and have entirely redesigned the UI for easy viewing on televisions. Players will be able to easily navigate the game's detailed character creation, real-time-with-pause combat, and party management from their couches thanks to new TV-friendly menus and controls. \n\nPillars of Eternity: Complete Edition features: \n Award-winning writing, story and artwork of Pillars of Eternity, along with the expanded world and content of The White March: Parts I & II \n Countless character creation options, from races and classes to character backgrounds which drive your personal story \n An epic universe to explore, filled with intriguing party members and companions, a variety of in-game factions, and a lovingly rendered world to traverse \n All major updates from the original PC version, including a raised level cap, expanded party AI options, and new difficulty levels \n New UI and controls designed from the ground up, presenting the Pillars of Eternity experience like never before",
    "score": "86"
  },
  {
    "id": "ab3fb810-41a8-4541-92a0-3d4a7f6aadb9",
    "title": "Shovel Knight",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/6/90d81af20068e72365ce4951fa69d48a-98.jpg",
    "platform": "Xbox One",
    "date": "April 21, 2015",
    "description": "Shovel Knight is a sweeping classic action adventure game with awesome gameplay, memorable characters, and an 8-bit retro aesthetic. It's a hot mashup of new and old! You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this land with two goals: to defeat the evil Enchantress and quest for his lost beloved. He wields a Shovel Blade: a multipurpose weapon whose techniques have now been lost to the ages. Always honest and helpful, Shovel Knight is a shining example of the code of Shovelry: Slash Mercilessly and Dig Tirelessly!\n\nBut, between Shovel Knight and his beloved stands a cadre of villainous knights. These terrible foes, known as The Order of No Quarter, have been dispatched to prevent Shovel Knight from reaching the Enchantress, and will pursue their mission at any cost. If you love games with perfect platforming, beautiful art, infectious music, crazy bosses, humor and levity, and real heart... Shovel Knight is for you!",
    "score": "86"
  },
  {
    "id": "cc10a590-0095-4a68-804d-6dfb12f48b3d",
    "title": "NBA 2K14",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/5/5bfac6b3da8714e9a1c41bbfbdd5830b-98.jpg",
    "platform": "Xbox One",
    "date": "November 12, 2013",
    "description": "NBA 2K14 promises to raise the bar yet again, providing the best basketball gaming experience for legions of sports fans and gamers around the world.",
    "score": "86"
  },
  {
    "id": "202cf7f2-870f-4fa7-900d-2b3b9156de0c",
    "title": "DmC: Devil May Cry Definitive Edition",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/1/d5a329e6b00de96ef9d9067e1b97b3bd-98.jpg",
    "platform": "Xbox One",
    "date": "March 10, 2015",
    "description": "The definitive edition of this action game arrives with enhanced 1080p graphics at 60fps, new features and all the original DLC included. Chain together stylish combos with up to 8 unique weapons. Traverse the demonic world of Limbo as you join Dante and Vergil in the legendary rebirth of the Devil May Cry franchise.",
    "score": "86"
  },
  {
    "id": "b55cf4d2-e97d-4055-bf33-d4aef234962e",
    "title": "Sky Force Reloaded",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/6/d0475ea6a1f42b4982d6f97e1757d13f-98.jpg",
    "platform": "Xbox One",
    "date": "December 1, 2017",
    "description": "The best mobile shooter is now ready to rock your iPhone!Sky Force Reloaded is an award winning and highly acclaimed vertical shooter. It features 3d interactive objects, outstanding graphics, special effects, high quality soundtrack and 100% of pure gameplay.Ever wanted to play a good arcade vertical shooter? This one is for you!----------------------------------------------PRESS:IGN Review:9.5/10 - Force your friend to buy this one.AppSmile.com5/5 - With its recent introduction into the App Store, Sky Force Reloaded (or perhaps re-Reloaded) is a title no arcade junkie should miss.PocketGamer:10/10 - Graphically, Sky Force: Reloaded is stunning. The whole game screams quality.PocketPlayers.deOne of the best, if not THE best shooters!----------------------------------------------FEATURES:- 8 large levels- plenty of enemies,- interactive environment elements*- upgradable weapons- dynamic weather (rain, clouds, wind)- highscoresRecommended for fans of Raiden, 1942, 1945, iFighter, Siberian Strike",
    "score": "86"
  },
  {
    "id": "5c5194ea-c5e5-4807-be44-0aa9f6d7f962",
    "title": "NBA 2K16",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/1/0d15f4b13faee5909f8450adace2e2e6-98.jpg",
    "platform": "Xbox One",
    "date": "September 25, 2015",
    "description": "Be the Story. The NBA 2K franchise is back with a true-to-life NBA experience in NBA 2K16. Guide your MyPLAYER through the complete NBA journey, take control of an entire NBA franchise, or refine your skills online competing against gamers from around the globe. With animations that provide smoother movement and more realistic articulation, it promises to be the most authentic NBA gaming experience yet. [2K]",
    "score": "86"
  },
  {
    "id": "f122b82b-5730-47d9-8a8b-107fcbd83ef9",
    "title": "Titanfall",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/3/7207cad078308daa5f1f2bf9d669a812-98.jpg",
    "platform": "Xbox One",
    "date": "March 11, 2014",
    "description": "Crafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall, with its advanced combat techniques, gives you the freedom to fight your way as both elite assault Pilot and fast, heavily armored Titan. The experience combines fast-paced multiplayer action with the dramatically charged moments of a cinematic universe.",
    "score": "86"
  },
  {
    "id": "872ded22-f247-4127-8540-c7f50003a638",
    "title": "Diablo III: Ultimate Evil Edition",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/2/521b7adfd66b6d002c14c32d3e969c72-98.jpg",
    "platform": "Xbox One",
    "date": "August 19, 2014",
    "description": "Xbox One players can now experience the full adventure of Blizzard's epic action RPG, Diablo III, and the upcoming expansion, Reaper of Souls all from the comfort of their couch in Diablo III: Ultimate Evil Edition. Take on the role of one of six powerful character class Barbarian, Demon Hunter, Monk, Witch Doctor, Wizard, or the all-new Crusader and embark on a dark journey through Acts I-V to save the world of Sanctuary from ancient and sinister forces.",
    "score": "86"
  },
  {
    "id": "14050c44-e1e2-4a29-a897-05c8d4e4c1ec",
    "title": "Resident Evil 7: biohazard",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/7/2a00c969261328a420e64421f77d87c6-98.jpg",
    "platform": "Xbox One",
    "date": "January 24, 2017",
    "description": "Fear and isolation seep through the walls of an abandoned southern farmhouse. \"7\" marks a new beginning for survival horror with the Isolated View of the visceral new first-person perspective. Powered by the RE Engine, horror reaches incredible heights of immersion as players enter a terrifyingly new world of fear as they fight to survive.",
    "score": "86"
  },
  {
    "id": "d38599d2-0dfe-480a-991f-96dd7a126188",
    "title": "Dragon Ball FighterZ",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/2/f2c4e090ad41c8b507cbc5d3bb9793d6-98.jpg",
    "platform": "Xbox One",
    "date": "January 26, 2018",
    "description": "After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters. Partnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay to audiences worldwide. \n\nKey Features:\n\n* 3vs3 TAG/SUPPORT\nAllows players to train and master more than one fighter/style which brings deeper gameplay\n\n* HIGH-END ANIME GRAPHICS\nUsing the power of the Unreal engine and the talented team at Arc System Works, DRAGON BALL FighterZ is a visual tour-de-force \n\n* SPECTACULAR FIGHTS\nExperience aerial combos, destructible stages, famous scenes from the DRAGON BALL anime reproduced in 60FPS and 1080p resolution (Higher resolution will be supported on PS4 Pro and Xbox Scorpio)",
    "score": "86"
  },
  {
    "id": "dc4ddb82-44dd-4147-b958-1707b023d949",
    "title": "Destiny 2: Forsaken",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/2/a243162be1f41340f2a52cb462178bdb-98.jpg",
    "platform": "Xbox One",
    "date": "September 4, 2018",
    "description": "With 2 brand-new destinations to explore, and new weapons, armour and Supers to acquire, Forsaken takes players on an epic journey into the wild frontiers of our solar system where the lines between justice and revenge are blurred. Forsaken also features an all-new competitive and collaborative endgame activity, called Gambit. A first-of-its kind for Destiny, Gambit is a new, hybrid 4v4 mode that merges both PvE and PvP experiences into an epic battle. This entirely new way to play Destiny 2 offers something for all types of gamers to enjoy, appealing to those who thrive on the competitive challenge of PvP gameplay, while seamlessly blending the collaborative and unpredictable elements of PvE. [Bungie]",
    "score": "86"
  },
  {
    "id": "1f0a4651-979e-46e1-a829-fd36f0118343",
    "title": "Mortal Kombat 11",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/3/eec2bb9cc2d7407cbb462e41c233e70f-98.jpg",
    "platform": "Xbox One",
    "date": "April 23, 2019",
    "description": "Mortal Kombat is back and better than ever in the next evolution of the iconic franchise. The all new Custom Character Variations give you unprecedented control to customize the fighters and make them your own. The new graphics engine showcasing every skull-shattering, eye-popping moment, brings you so close to the fight you can feel it. And featuring a roster of new and returning Klassic Fighters, Mortal Kombat's best in class cinematic story mode continues the epic saga over 25 years in the making.",
    "score": "86"
  },
  {
    "id": "551a7575-d70e-4c02-89b0-219e5ca2a392",
    "title": "Tomb Raider: Definitive Edition",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/9/4dcd13c8fea3980bc5457caf59717d59-98.jpg",
    "platform": "Xbox One",
    "date": "January 28, 2014",
    "description": "Armed with only the raw instincts and physical ability to push beyond the limits of human endurance, Tomb Raider delivers an intense and gritty story into the origins of Lara Croft and her ascent from a frightened young woman to a hardened survivor.",
    "score": "86"
  },
  {
    "id": "8ac02fc5-5f23-49e5-9194-13a6b8e15c4f",
    "title": "Rise of the Tomb Raider",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/5/97db5b492982c9c94fbe043fe16ac09b-98.jpg",
    "platform": "Xbox One",
    "date": "November 10, 2015",
    "description": "Conquer a world strenuously protecting its secrets, endure dangers conditions and unstable landscapes, face viscous wildlife that act as guardians to ancient tombs, and explore massive interactive environments. Utilize the environment to your advantage, climb trees and go underwater to avoid or accost enemies, configure Lara's gear, weapons, and ammunition to suit your play style, dummy up explosives on the fly to wreak havoc, and wield Lara's signature combat bows and climbing axe. [Xbox.com]",
    "score": "86"
  },
  {
    "id": "dffdbf36-5004-4dca-89a1-31d8ee30fdd7",
    "title": "Forza Horizon 2",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/1/f51887518c128c7455aa452a4606c65b-98.jpg",
    "platform": "Xbox One",
    "date": "September 30, 2014",
    "description": "Race through a wide-open world featuring dramatic weather and day to night cycles. Connect with friends in this celebration of speed, style, and action-packed driving. Explore exotic locations in more than 200 of the world’s greatest cars.",
    "score": "86"
  },
  {
    "id": "c0395716-2a0c-45dc-8cc5-aaa359048428",
    "title": "Observer",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/4/3b03662f60aa97e4959c570523e634a0-98.jpg",
    "platform": "Xbox One",
    "date": "August 15, 2017",
    "description": "What would you do if your fears were hacked? The year is 2084. You are Daniel Lazarski, an elite neural detective known as an Observer, whose purpose is to hack and invade suspects’ minds. To gather evidence, you must relive their darkest fears, and, finally, face your own. From Bloober Team, the creators of Layers of Fear, >observer_ is a cyberpunk horror game designed to disturb you.",
    "score": "86"
  },
  {
    "id": "385c98c4-98d0-4e40-a326-92e1ecbd04a3",
    "title": "Dying Light: The Following",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "platform": "Xbox One",
    "date": "February 9, 2016",
    "description": "Dying Light: The Following is a significant expansion to Dying Light and the untold chapter of Kyle Crane’s story. Take to a vast new area that will transform your Dying Light experience through new game mechanics, environments and challenges on top of the established core of the game.",
    "score": "86"
  },
  {
    "id": "1720e58c-099d-4806-8b1a-b6d0448ae00b",
    "title": "DiRT 4",
    "rankNumber": "82.",
    "img": "https://static.metacritic.com/images/products/games/2/74a004122927e43816de4ecea1ab88ba-98.jpg",
    "platform": "Xbox One",
    "date": "June 6, 2017",
    "description": "Dirt 4 puts you at the wheel of the most powerful machines ever made as you face the toughest roads and circuits on the planet in rally, rallycross, and landrush.",
    "score": "86"
  },
  {
    "id": "c840abda-9813-4b83-b62f-c4b47d45cc4f",
    "title": "Forza Motorsport 7",
    "rankNumber": "83.",
    "img": "https://static.metacritic.com/images/products/games/1/749c9a72c91848567459e9be459e56df-98.jpg",
    "platform": "Xbox One",
    "date": "September 29, 2017",
    "description": "Experience the thrill of motorsport at the limit. Enjoy graphics at 60fps and native 4K resolution in HDR. Collect and race more than 700 cars, including the largest collection of Ferraris, Porsches, and Lamborghinis ever. Challenge yourself across 30 famous destinations and 200 ribbons, where race conditions change every time you return to the track. [Microsoft]",
    "score": "86"
  },
  {
    "id": "b6aa16d9-014c-45d9-8681-fa23015ad1b2",
    "title": "Mortal Kombat X",
    "rankNumber": "84.",
    "img": "https://static.metacritic.com/images/products/games/4/beed1039437c732b1be53d810ce74c46-98.jpg",
    "platform": "Xbox One",
    "date": "April 14, 2015",
    "description": "Mortal Kombat X combines cinematic presentation with all new gameplay to deliver the most brutal Kombat experience ever, offering a new fully-connected experience that launches players into a persistent online contest where every fight matters in a global battle for supremacy.  For the first time, Mortal Kombat X gives players the ability to choose from multiple variations of each character impacting both strategy and fighting style. Players step into an original story showcasing some of the game’s most prolific characters including Scorpion and Sub-Zero, while introducing new challengers that represent the forces of good and evil and tie the tale together.",
    "score": "86"
  },
  {
    "id": "5f409098-a3ad-4024-bf2b-299dade9d148",
    "title": "Dark Souls Remastered",
    "rankNumber": "85.",
    "img": "https://static.metacritic.com/images/products/games/7/6ac4855a606717857c8750bd34075a09-98.jpg",
    "platform": "Xbox One",
    "date": "May 25, 2018",
    "description": "Embark upon an epic dark fantasy in a universe stricken by decline and the Curse. Explore its intricate world design - full of hidden passages, dungeons and secrets - and uncover its deeply rooted lore.",
    "score": "86"
  },
  {
    "id": "7f692609-a9b9-4822-9633-a6d769b7ebc0",
    "title": "Wasteland 3",
    "rankNumber": "86.",
    "img": "https://static.metacritic.com/images/products/games/6/6004f2faa52881dbc4a97820e271d6a2-98.jpg",
    "platform": "Xbox One",
    "date": "August 28, 2020",
    "description": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies.",
    "score": "85"
  },
  {
    "id": "7b1c7417-506b-4d25-8de2-89541cb833a6",
    "title": "NHL 20",
    "rankNumber": "87.",
    "img": "https://static.metacritic.com/images/products/games/9/c69193dbba76bc4b34dd137dcd24e248-98.jpg",
    "platform": "Xbox One",
    "date": "September 10, 2019",
    "description": "EA SPORTS NHL 20 introduces cutting-edge gameplay innovation to showcase your skills, more customization to unlock your style, and new modes to compete with friends.\n\nRPM Tech-powered gameplay introduces Signature Shots that replicate your favourite NHL players' real-world shot styles. Over 45 new shot animations make every attack a threat, and new passing and puck pick-ups create faster, fluid gameplay executed at full speed.\n\nA revamped broadcast package delivers all-new visuals and commentary. Combined with over 1,100 new customization items for your club and character, your biggest goals look incredible during the action and in the highlight reel.\n\nFinally, NHL 20 adds three new game modes. HUT Squad Battles features weekly teams, built by athletes and artists, to challenge for unique rewards. The fan-favourite ONES can now be played with friends on the couch, and the all-new Eliminator mode in World of CHEL introduces a winner-take-all competition where you and your friends compete to be the best in the barn.",
    "score": "85"
  },
  {
    "id": "3a6c4679-c23a-4e7c-8ad3-04fa48f639b1",
    "title": "Thronebreaker: The Witcher Tales",
    "rankNumber": "88.",
    "img": "https://static.metacritic.com/images/products/games/2/72d971588cfa849b0bee16b67ce6b2f9-98.jpg",
    "platform": "Xbox One",
    "date": "December 4, 2018",
    "description": "From the creators of The Witcher 3: Wild Hunt comes a brand new tale set in the brutal and twisted universe of witcher Geralt of Rivia. The world stands on the verge of chaos, as the tensions between the power-hungry Nilfgaardian Empire and proud Northern Realms grow. Facing an imminent invasion, Meve — war-veteran Queen of Lyria and Rivia — is forced to once again enter the warpath, and set out on a dark journey of destruction and revenge.",
    "score": "85"
  },
  {
    "id": "eb23b8ca-9470-4ebf-9b03-095d06b13fff",
    "title": "Firewatch",
    "rankNumber": "89.",
    "img": "https://static.metacritic.com/images/products/games/9/1eee84cf6de2339d30db428c48eb46c5-98.jpg",
    "platform": "Xbox One",
    "date": "September 21, 2016",
    "description": "The year is 1989. You are a man named Henry who has retreated from his messy life to work as a fire lookout in the Wyoming wilderness. Perched high atop a mountain, its your job to look for smoke and keep the wilderness safe. An especially hot, dry summer has everyone on edge. Your supervisor Delilah is available to you at all times over a small, handheld radioyour only contact with the world you've left behind. But when something strange draws you out of your lookout tower and into the forest, youll explore a wild and unknown environment, facing questions and making choices that can build or destroy the only meaningful relationship you have.\n\nA Note: Firewatch is a video game about adults having adult conversations about adult things. If you plan on playing with a younger gamer, that might be good to know going in.\n\nIncludes\n\n*    A stunningly beautiful wilderness environment that expands as you explore.\n*    A tailor-made story: the choices you make shape the narrative and build relationships.\n*    An edge-of-your-seat mystery.\n*    Secrets and discoveries to be made over every hill.",
    "score": "85"
  },
  {
    "id": "352a5d50-2b78-46d9-a541-c35215cfd285",
    "title": "Guacamelee! 2",
    "rankNumber": "90.",
    "img": "https://static.metacritic.com/images/products/games/0/51a0fbd508249ff06dfab2a20d917c36-98.jpg",
    "platform": "Xbox One",
    "date": "January 18, 2019",
    "description": "Brawling has never been more beautiful! The long-awaited sequel to the smash hit action-platformer is here: Guacamelee! 2 brings luchador Juan Aguacate out of retirement for a stunning new Metroidvania-style adventure, where he must face his greatest challenge yet - one that threatens to tear apart the very fabric of the Mexiverse!\n\nExplore a huge, hand-crafted world inspired by Mexican culture and folklore, filled with sassy new villains and weirdos (and a few old friends!). Learn a deep repertoire of bone-crunching wrestling moves to fend off the skeletal hordes and overcome skillful platforming challenges... and who said anything about a Chicken Illuminati? Certainly not us!\n\nCheck out these features:\n\n* An epic adventure spanning time and space, featuring drop-in 4-player local co-op for you and your best amigos!\n* A brand new upgrade system: discover \"trainers\" around the world, defeat their challenges, and develop your skill sets for movement, combat, and more!\n* A vibrant, colorful adventure that takes you from the Mangrove Swamp to Hell itself, featuring twice as many enemy types as the first game and a roster of eccentric new bosses!\n* An absolutely fuego electro-Mexican soundtrack, and more gorgeous visuals than ever thanks to a fancy new rendering engine!\n* Definitely no secret society of chickens that teaches you ancient chicken abilities previously lost to the ages!",
    "score": "85"
  },
  {
    "id": "7b16c935-4115-4b85-bd45-fc1975d2f457",
    "title": "Call of Duty: Black Ops 4",
    "rankNumber": "91.",
    "img": "https://static.metacritic.com/images/products/games/5/b968c9c21d7c219bfb1af7ca9a7e32ca-98.jpg",
    "platform": "Xbox One",
    "date": "October 12, 2018",
    "description": "Black Ops returns - in your face. Featuring gritty, grounded, fluid Multiplayer combat, a massive Zombies offering with 3 full undead adventures at launch, and Blackout, where the universe of Black Ops comes to life in one huge battle royale experience featuring the largest map in Call of Duty history, signature Black Ops combat, characters, locations and weapons from the entire Black Ops series. Soldier up for all-out combat – tailor made for the Black Ops community. [Treyarch]",
    "score": "85"
  },
  {
    "id": "46e5c254-2fcf-48fe-9139-e98dc0d2262b",
    "title": "Batman: Arkham Knight",
    "rankNumber": "92.",
    "img": "https://static.metacritic.com/images/products/games/3/9bc954d829de2865be72968cee637f75-98.jpg",
    "platform": "Xbox One",
    "date": "June 23, 2015",
    "description": "Batman confronts the ultimate threat against the city he has been sworn to protect. The Scarecrow returns to congeal an imposing array of super villains, including The Penguin, Two-Face and Harley Quinn, to summarily destroy The Dark Knight. The game introduces Rocksteady's uniquely-designed imagining of the Batmobile drivable for the first time in the franchise. Batman: Arkham Knight offers gamers a complete Batman experience as they rip through the streets and soar across the skyline of the iconic Gotham City.",
    "score": "85"
  },
  {
    "id": "a5e1ec01-00a6-4a03-bade-eebaff10074b",
    "title": "Assassin's Creed Origins",
    "rankNumber": "93.",
    "img": "https://static.metacritic.com/images/products/games/1/2e70c5dde2ac1a574bb6ed7512676a6c-98.jpg",
    "platform": "Xbox One",
    "date": "October 27, 2017",
    "description": "Set in mysterious Ancient Egypt, Assassin’s Creed Origins is a new beginning. Experience a new way to fight while exploring the Great Pyramids and hidden tombs across the country of Ancient Egypt, and encounter many memorable storylines along your journey. And discover the origin story of the Assassin's Brotherhood. [Ubisoft]",
    "score": "85"
  },
  {
    "id": "aa3cd366-4177-4147-81ac-39055559a342",
    "title": "Dragon Age: Inquisition",
    "rankNumber": "94.",
    "img": "https://static.metacritic.com/images/products/games/6/cdbb455cc53e25ad6c46902a8b39d824-98.jpg",
    "platform": "Xbox One",
    "date": "November 18, 2014",
    "description": "Draft and lead a group of characters into rugged battles against a diversity of enemies – from earth-shattering High Dragons to demonic forces from the otherworld of the Fade. Go hand to hand in visceral, heroic combat as your followers fight by your side, or switch to tactical view to coordinate murderous offensives using the combined might of your party. See the tangible, visible results of your journey through a living world – raise structures, customize outposts, and change the landscape itself as environments are re-shaped in the wake of your Inquisition. Lead a party chosen from nine unique, fully-formed characters – each of whom react to your actions and choices differently, forming complex relationships both with you and with each other. Create your own character from multiple races, customize their appearance, and select their powers and abilities as the game progresses. Extensive customization options allow you to choose everything from the color of your follower’s boots to the features of your Inquisition stronghold. Become an agent of change in a time of uncertainty and upheaval.  Shape the course of empires, bring war or peace to factions in conflict, and drive the ultimate fate of the Inquisition. Will you stop the cataclysmic anarchy gripping the Dragon Age? [Electronic Arts]",
    "score": "85"
  },
  {
    "id": "d7386abf-5d63-4f77-b923-eb31b43c450f",
    "title": "The Outer Worlds",
    "rankNumber": "95.",
    "img": "https://static.metacritic.com/images/products/games/5/0383b3e86d463c45ad85fddc38e73fed-98.jpg",
    "platform": "Xbox One",
    "date": "October 25, 2019",
    "description": "The Outer Worlds is a new single-player first-person sci-fi RPG from Obsidian Entertainment and Private Division. Lost in transit while on a colonist ship bound for the furthest edge of the galaxy, you awake decades later only to find yourself in the midst of a deep conspiracy threatening to destroy the Halcyon colony. As you explore the furthest reaches of space and encounter various factions, all vying for power, the character you decide to become will determine how this player-driven story unfolds. In the corporate equation for the colony, you are the unplanned variable.",
    "score": "85"
  },
  {
    "id": "aa012080-cb7c-460e-8b6a-c98edc7b1f06",
    "title": "F1 2016",
    "rankNumber": "96.",
    "img": "https://static.metacritic.com/images/products/games/6/e6dfc923969a52a9ba566b79109c5200-98.jpg",
    "platform": "Xbox One",
    "date": "August 19, 2016",
    "description": "Includes the full 2016 season calendar of 21 tracks, including the brand new Baku circuit in Azerbaijan, and the full roster of 22 drivers and 11 teams, including the new Haas F1 Team. F1 2016 immerses you in not only the on-track excitement of a FORMULA ONE career, including the inclusion of the iconic Safety Car and also the Virtual Safety Car for the first time, but also uniquely offers the drama and vehicle development that goes on behind the scenes. Work with your agent, engineer and team to develop your car in the deepest ever career experience, spanning up to ten seasons. Forge your own path to glory, and rise to be the champion.",
    "score": "85"
  },
  {
    "id": "ee4b2b82-009e-447a-b5d8-bedc87fbe7be",
    "title": "Final Fantasy X / X-2 HD Remaster",
    "rankNumber": "97.",
    "img": "https://static.metacritic.com/images/products/games/2/e4976c73e52e128ccae1917668a973a5-98.jpg",
    "platform": "Xbox One",
    "date": "April 16, 2019",
    "description": "Final Fantasy X tells the story of a star blitzball player, Tidus, who journeys with a young and beautiful summoner named Yuna on her quest to save the world of Spira. Then return in Final Fantasy X-2, join Yuna along with her companions Rikku and Paine on a quest around the world.",
    "score": "85"
  },
  {
    "id": "efcd0d80-4309-4010-bdfc-3d80b99bed29",
    "title": "Halo: The Master Chief Collection",
    "rankNumber": "98.",
    "img": "https://static.metacritic.com/images/products/games/6/6eb1ac42c31447859845d764d97cf3f7-98.jpg",
    "platform": "Xbox One",
    "date": "November 11, 2014",
    "description": "The Master Chief's complete story available one console. Features a re-mastered Halo 2: Anniversary, along with Halo: Combat Evolved Anniversary, Halo 3, and Halo 4, new digital series, Halo: Nightfall, and access to the Halo 5: Guardians Beta.",
    "score": "85"
  },
  {
    "id": "fccea064-0e70-41c4-9f25-a4ddc30dd0bd",
    "title": "Pro Evolution Soccer 2016",
    "rankNumber": "99.",
    "img": "https://static.metacritic.com/images/products/games/9/9641648e288308b35b7626ab5b826ebc-98.jpg",
    "platform": "Xbox One",
    "date": "September 15, 2015",
    "description": "The upgraded feint moves allow for sudden directional changes that can cause defenders to lose their balance. But the developers have added a new system to the defenders arsenal. With Perfect Defence, players who time their tackles perfectly are able to powerfully shove their opponent out of the way and instantly secure the ball, allowing to create direct turnarounds and counter opportunities.",
    "score": "85"
  },
  {
    "id": "0ae8d002-77e3-4c94-8efc-e6db3bebecaa",
    "title": "Age of Wonders: Planetfall",
    "rankNumber": "100.",
    "img": "https://static.metacritic.com/images/products/games/6/a81f657e7b5e18f6bf047fd911c18aa4-98.jpg",
    "platform": "Xbox One",
    "date": "August 6, 2019",
    "description": "Age of Wonders: Planetfall is the new strategy game from Triumph Studios, creators of the critically acclaimed Age of Wonders series, bringing all the exciting tactical turn-based combat and in-depth empire building of its predecessors to space in an all-new, sci-fi setting.",
    "score": "85"
  }
]