[
  {
    "id": "faf6c441-e918-4d24-9876-0f4461f02c5e",
    "title": "Red Dead Redemption 2",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/8/f5b1cbf43a118c429f67022f9e93b41d-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 26, 2018",
    "description": "Developed by the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America’s unforgiving heartland. The game’s vast and atmospheric world also provides the foundation for a brand new online multiplayer experience. America, 1899. The end of the Wild West era has begun. After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang has to rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal fissures threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang that raised him. [Rockstar]",
    "score": "97"
  },
  {
    "id": "fb58a361-7136-421d-bda8-6b122c0636c9",
    "title": "Grand Theft Auto V",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/7/a149682ad949afdce7d25ee90d0ef848-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 18, 2014",
    "description": "The sprawling sun-soaked metropolis of Los Santos is chock full of self-help coaches, starlets and C-List celebrities, once on top of the media world, now struggling to stay relevant in time of economic malaise and lowest-common-denominator reality TV. Amidst this madness, three unique criminals plan their own chances of survival and success: Franklin, a street-level hustler in search of opportunities for serious money; Michael, an ex-con whose \"retirement\" is a less rosy than he hoped it would be; and Trevor, a violent dude driven by the chance for a quick high and the next big score. Nearly out of options, the crew risks it all in a series of daring and dangerous heists that could set them up for life - one way or the other.",
    "score": "97"
  },
  {
    "id": "3556f31a-2612-4a75-8f9b-86dc13d0e71a",
    "title": "Persona 5 Royal",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/2/1d340c792338fa16de96bd8b60d3cab5-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 31, 2020",
    "description": "Prepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. Persona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.",
    "score": "95"
  },
  {
    "id": "85890766-155b-46f9-a953-25e7c49e2704",
    "title": "The Last of Us Remastered",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/6/dcb5d2f7d2f23d0d4aa8fd809af6b12e-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 29, 2014",
    "description": "The Last of Us has been rebuilt for the PlayStation4 system. Now featuring full 1080p, higher resolution character models, improved shadows and lighting, in addition to several other gameplay improvements. 20 years after a pandemic has radically changed known civilization, infected humans run wild and survivors are killing each other for food, weapons; whatever they can get their hands on. Joel, a violent survivor, is hired to smuggle a 14 year-old girl, Ellie, out of an oppressive military quarantine zone, but what starts as a small job soon transforms into a brutal journey across the U.S. The Last of Us Remastered includes the Abandoned Territories Map Pack, Reclaimed Territories Map Pack, and the critically acclaimed The Last of Us: Left Behind Single Player campaign that combines themes of survival, loyalty, and love with tense, survival-action gameplay.\n\nRemastered Features:\n-Explore a brutal post-pandemic world, fully realized with the power of PlayStation4 system\n-Includes additional game content: over $30 in value\n-Delve into Ellies past in Left Behind, the single-player prequel chapter\n-Eight new multiplayer maps in the Abandoned and Reclaimed Territories packs\n-In-game cinematic commentary from the cast and creative director",
    "score": "95"
  },
  {
    "id": "dbe41d86-f563-4080-81eb-d90add0d28e5",
    "title": "God of War",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/8/452903806353a11fbecc0089ac94ef13-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 20, 2018",
    "description": "His vengeance against the gods of Olympus far behind him, Kratos now lives as a man in the lands of Norse Gods and monsters. It is in this harsh, unforgiving world that he must fight to survive… and teach his son to do the same. As mentor and protector to a son determined to earn his respect, Kratos is faced with an unexpected opportunity to master the rage that has long defined him. Questioning the dark lineage he’s passed on to his son, he hopes to make amends for the shortcomings of his past. Set within the untamed forests, mountains, and realms of Norse lore, God of War features a distinctly new setting with its own pantheon of creatures, monsters, and gods. [Playstation.com]",
    "score": "94"
  },
  {
    "id": "a99c8767-841c-4f38-a375-d9b76a8ae3bc",
    "title": "The Last of Us Part II",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/3/976dc172a149f212d4b059e6eede1900-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 19, 2020",
    "description": "Five years after their dangerous journey across the post-pandemic United States, Ellie and Joel have settled down in Jackson, Wyoming. Living amongst a thriving community of survivors has allowed them peace and stability, despite the constant threat of the infected and other, more desperate survivors. When a violent event disrupts that peace, Ellie embarks on a relentless journey to carry out justice and find closure. As she hunts those responsible one by one, she is confronted with the devastating physical and emotional repercussions of her actions.",
    "score": "93"
  },
  {
    "id": "8cc20680-323f-441e-98a6-3a871b4802e9",
    "title": "Persona 5",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/5/47dc3e3e49c9cbcf53beefcedcdd6cea-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 4, 2017",
    "description": "Beneath the veneer of typical urban high school life, a group of teenagers mask their mysterious alter egos, their \"phantom thief\" side. Who are they? Why are they dressed as such? What are their motives? And... why are they being pursued? A picaresque coming-of-age story, Persona 5 brings a new twist to the RPG genre. Assume the role of a second-year high school student who becomes a Persona-user through an unexpected incident. Having moved to Tokyo just before the start of the school year, he finds residence at a cafe run by his parents' friend, and is about to get his first taste of school life in the big city. The protagonist seems quiet and well-mannered at first glance, but gives a completely different impression once he has donned his \"phantom thief\" guise. What is the motivation of his alter ego...? Arsene is the protagonist's initial Persona, characterized by a mask-like face and a pair of huge, black wings. Some suspect an association between its name and the famous gentleman-thief, Arsene Lupin. What is the origin of this Persona, and what power does it hold? This is an account of the wild adventures experienced by a team of young misfits, who grow dramatically along the way. While attending Shujin High School, the protagonist will encounter a number of individuals, each with his or her own distinctive personality and charm. School life in the city is full of surprises and interesting events! It will most definitely be a fun year for the protagonist, living as an ordinary student. However, he and his friends become involved in an incident which leads to the awakening of their Personas. No one would ever suspect that these adolescents will eventually shake the world... Welcome to the next iteration of the Persona series, boasting a brand new metropolitan setting, all-new cast, and fresh, original story. [Atlus]",
    "score": "93"
  },
  {
    "id": "20c220fb-470b-41d6-8ff1-03f609a347b5",
    "title": "Metal Gear Solid V: The Phantom Pain",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/5/92ba4685e153548a1d1ea590b8432b29-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 1, 2015",
    "description": "Following the prologue METAL GEAR SOLID V: GROUND ZEROES, METAL GEAR SOLID V: THE PHANTOM PAIN concludes the METAL GEAR SOLID V experience by following the story of the protagonist of the series, Big Boss (a.k.a. Snake). The METAL GEAR SOLID V experience is Creator and Director Hideo Kojima's first time incorporating open world gameplay to the groundbreaking METAL GEAR franchise.",
    "score": "93"
  },
  {
    "id": "084bdfbc-b429-4377-8927-d494921a15b4",
    "title": "Uncharted 4: A Thief's End",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/2/bccdebd6ae21b1a35353b6d9f27af1a5-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 10, 2016",
    "description": "Set 3 years after the events of Uncharted 3, Nathan Drake has apparently left the world of fortune hunting behind. However, it doesn’t take long for adventure to come calling when Drake’s brother, Sam, re-emerges asking for his help to save his own life and offering an adventure Drake cannot resist. On the hunt for Captain Henry Avery’s long-lost treasure, Sam and Drake embark on a journey to find Libertalia, the pirate utopia deep in the forests of Madagascar. Uncharted 4: A Thief’s End takes players around the globe, through jungle isles, urban cities and snow-capped peaks on the search for Avery’s fortune. [Naughty Dog]",
    "score": "93"
  },
  {
    "id": "07327282-3d85-4b75-a254-e7bedabbebe2",
    "title": "Journey",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/0/2efadc9d1e6e95e69da629f43895d2cf-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 21, 2015",
    "description": "The pioneers that brought you the award-winning PlayStation Network titles flOw & Flower are back with another title that challenges traditional gaming conventions. With Journey, thatgamecompany (TGC) continues its tradition of delivering simple gameplay and accessible controls in a rich interactive environment that invites players to explore and experience emotional chords that are still uncommon in video games.\n\nAn exotic adventure with a more serious tone, Journey presents TGCs unique vision of an online adventure experience. Awakening in an unknown world, the player walks, glides, and flies through a vast and awe-inspiring landscape, while discovering the history of an ancient, mysterious civilization along the way.\n\nJourneys innovative approach to online play encourages players to explore this environment with strangers who cross their path from time to time. By traveling together, they can re-shape the experience  creating authentic moments they will remember and discuss with others.",
    "score": "92"
  },
  {
    "id": "2ce84913-84e3-4fcb-bf18-f1c18dfe0829",
    "title": "Bloodborne",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/5/d31120073f909d2c034c09f91e7a5073-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 24, 2015",
    "description": "Bloodborne is an action RPG in which you hunt for answers in the ancient city of Yharnam, now cursed with a strange endemic illness spreading through the streets like a disease. Peril, death and madness infest this dark world, and you're tasked with uncovering its darkest secrets which will be necessary for you to survive. Armed with a singular arsenal of weaponry, including guns and saw cleavers, you'll require wits, strategy and reflexes to dispatch the agile and intelligent enemies that guard the city's underbelly. You will utility holy chalices to access an array of vast underground ruins, chock full of traps, beasts, and rewards, to explore and conquer on your own or with other people.",
    "score": "92"
  },
  {
    "id": "22798886-4e07-4d36-a86c-143ff0b3ee55",
    "title": "Undertale",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/1/385b89f553f016616c5365cdc0f9b6f7-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 15, 2017",
    "description": "Welcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever.\n\n((Healthy Dog's Warning: Game contains imagery that may be harmful to players with photosensitive epilepsy or similar condition.))\n\nfeatures:\n\n*    Killing is unnecessary: negotiate out of danger using the unique battle system.\n*    Time your attacks for extra damage, then dodge enemy attacks in a style reminiscent of top-down shooters.\n*    Original art and soundtrack brimming with personality.\n*    Soulful, character-rich story with an emphasis on humor.\n*    Created mostly by one person.\n*    Become friends with all of the bosses!\n*    At least 5 dogs.\n*    You can date a skeleton.\n*    Hmmm... now there are 6 dogs...?\n*    Maybe you won't want to date the skeleton.\n*    I thought I found a 7th dog, but it was actually just the 3rd dog.\n*    If you play this game, can you count the dogs for me...? I'm not good at it.",
    "score": "92"
  },
  {
    "id": "a07298d2-82d5-4e19-9fd8-fd6c7ea25be1",
    "title": "The Witcher 3: Wild Hunt",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/2/425471cad15e750c9d5c3c50e9604e38-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 19, 2015",
    "description": "With the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic open world, slay beasts and decide the fates of whole communities with your actions, all in a genuine next generation format. Also known as \"The Witcher III: Wild Hunt\"",
    "score": "92"
  },
  {
    "id": "ef2a853d-09e3-4809-9f6c-855bf7bc2466",
    "title": "Divinity: Original Sin II - Definitive Edition",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/2/9a871bea6579f599afb60a8843ff7f52-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 31, 2018",
    "description": "Set a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are a Sourcerer: a dangerously powerful individual whose abilities summon creatures from the encroaching Void. The Divine is dead and the Void is everywhere. Sourcerers are blamed and the Divine Order is leading the charge against the threat: you. Captured and sent to Fort Joy, you will be \"cured\" of your powers -- no matter the cost. But the Order has secrets of its own that may cast doubt on its so-called holy mission. As you escape from Fort Joy, you realize that if the world remains godless, it will be consumed by the Void.",
    "score": "92"
  },
  {
    "id": "938ac95a-f28a-42eb-924e-e1b6044810df",
    "title": "Final Fantasy XIV: Shadowbringers",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/8/1a8d9f7ab605ba769f6822604892c0af-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 2, 2019",
    "description": "Take part in the next saga of FINAL FANTASY® XIV Online with the next legendary expansion pack—SHADOWBRINGERS.\n\nNew jobs: Gunbreaker and Dancer\nNew races: Viera and Hrothgar\nLevel cap increased: 70 to 80\nNew cities: The Crystarium and Eulmore\nJourney through expansive new areas, such as the Rak’tika Greatwood, Amh Araeng, Il Mheg and Lakeland.\nNew trails, including harrowing encounters with Titania and Innocence.\nNew beast tribes: pixies, Nu Mou, and dwarves\nNew 8-player raid: Eden\nAn exciting new series of alliance raids YoRHa:Dark Apocalypse\nThe Restoration of the Holy See of Ishgard - In the aftermath of the Dragonsong War, Disciples of the Hand and Land work together to rebuild Ishgard",
    "score": "91"
  },
  {
    "id": "c0ddcc3b-68a5-4c4d-a3d1-6269fe88614c",
    "title": "Shadow of the Colossus",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/8/b8fa7cf05ab8da759d053fcba9df9f75-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 6, 2018",
    "description": "Tales speak of an ancient realm where Colossi roam the majestic landscape.  Bound to the land, these creatures hold a key to a mystical power of revival – a power you must obtain to bring a loved one back to life.",
    "score": "91"
  },
  {
    "id": "11029195-db27-44cc-af52-09562f79aa97",
    "title": "The Witcher 3: Wild Hunt - Blood and Wine",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/0/9b1b2e62c39046ca8397075fb9ab5111-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 30, 2016",
    "description": "This expansion pack is an old-school add on with 20 hours of new adventures, where players will travel to the land of Toussaint.",
    "score": "91"
  },
  {
    "id": "4ad4ed24-e47c-474b-99b2-6e03db5377ed",
    "title": "Celeste",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/9/26adcc65f024318b4989f515662022b6-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 25, 2018",
    "description": "Help Madeline survive her journey to the top of Celeste Mountain in this super-tight, hand-crafted platformer from the creators of TowerFall.",
    "score": "91"
  },
  {
    "id": "48de7e05-da2b-46e1-ba07-25f8f8ec778a",
    "title": "INSIDE",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/6/c581ae173ec05ec8990c05374f7b117d-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 23, 2016",
    "description": "Hunted and alone, a boy finds himself drawn into the center of a dark project. The second game from Limbo developer Playdead.",
    "score": "91"
  },
  {
    "id": "56eb5f34-93b6-4ab1-a93c-f7e46e673730",
    "title": "NieR: Automata - Game of the YoRHa Edition",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/5/2ac66c0e4df312700c6744ce932d98dc-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 26, 2019",
    "description": "Humanity has been driven from the Earth by mechanical beings from another world. In a final effort to take back the planet, the human resistance sends a force of android soldiers to destroy the invaders. Now, a war between machines and androids rages on... A war that could soon unveil a long-forgotten truth of the world.",
    "score": "91"
  },
  {
    "id": "9d21dd8b-e907-4ef0-8a14-8391dd33e8b4",
    "title": "Resident Evil 2",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/6/fb1f200c3315a838e3ae1aa4f1f77045-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 25, 2019",
    "description": "In Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City that transformed its population into deadly zombies. Both Leon and Claire have their own separate playable campaigns, allowing players to see the story from both characters’ perspectives. The fate of these two fan favorite characters is in players hands as they work together to survive and get to the bottom of what is behind the terrifying attack on the city. Will they make it out alive?",
    "score": "91"
  },
  {
    "id": "57549a0d-50c6-4289-9ae2-e0fd2d6dde03",
    "title": "flower",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/0/8d46b88cfce157badeff5d905341985c-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 15, 2013",
    "description": "The pioneers that brought you the PLAYSTATION Network title flOw are back with another concept that challenges traditional gaming conventions. Flower expands the team's tradition of delivering simple gameplay, accessible controls and a medium to explore emotional chords uncommon in video games. In Flower, the surrounding environment, most often pushed to the background in games, is pulled to the forefront and becomes the primary \"character.\" The player fades from an external and stressful world in the opening of this fresh and genuine game only for PS3, and journeys through beautifully vivid landscapes, changing the his surroundings and exploring nature along the way.",
    "score": "91"
  },
  {
    "id": "7089e74d-e429-4cc5-be74-676f573cb0ad",
    "title": "Diablo III: Ultimate Evil Edition",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/5/1092744fa790bc2fa0cd1a0cd59d201b-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 19, 2014",
    "description": "PlayStation 4 players can now experience the full adventure of Blizzard’s epic action RPG, Diablo III, and the upcoming expansion, Reaper of Souls all from the comfort of their couch in Diablo III: Ultimate Evil Edition! Take on the role of one of six powerful character class Barbarian, Demon Hunter, Monk, Witch Doctor, Wizard, or the all-new Crusader and embark on a dark journey through Acts I-V to save the world of Sanctuary from ancient and sinister forces. With the new DUALSHOCK 4 wireless controller and a custom-designed console interface, players will be outfitted with touch pad functionality and new social features as they engage in pulse-pounding combat with hordes of monsters and acquire items of incredible power.",
    "score": "90"
  },
  {
    "id": "5a5016c0-2ef7-425f-b86e-74aa0294d205",
    "title": "Overwatch",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/6/038c915512e6003710577e71905696aa-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 23, 2016",
    "description": "Overwatch is a highly stylized team-based shooter set on earth in the near future. Every match is an intense multiplayer showdown pitting a diverse cast of soldiers, mercenaries, scientists, adventurers, and oddities against each other in an epic, globe-spanning conflict.",
    "score": "90"
  },
  {
    "id": "41222903-7710-49d7-8b23-da307fa2f6a8",
    "title": "Shovel Knight",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/3/4dd79ee1b7200558c3c43c9a03f362c1-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 21, 2015",
    "description": "Shovel Knight is a sweeping classic action adventure game with awesome gameplay, memorable characters, and an 8-bit retro aesthetic. It's a hot mashup of new and old! You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this land with two goals: to defeat the evil Enchantress and quest for his lost beloved. He wields a Shovel Blade: a multipurpose weapon whose techniques have now been lost to the ages. Always honest and helpful, Shovel Knight is a shining example of the code of Shovelry: Slash Mercilessly and Dig Tirelessly!\n\nBut, between Shovel Knight and his beloved stands a cadre of villainous knights. These terrible foes, known as The Order of No Quarter, have been dispatched to prevent Shovel Knight from reaching the Enchantress, and will pursue their mission at any cost. If you love games with perfect platforming, beautiful art, infectious music, crazy bosses, humor and levity, and real heart... Shovel Knight is for you!",
    "score": "90"
  },
  {
    "id": "ed417501-7d71-426f-b6f7-91f7ba2cd9ca",
    "title": "Rayman Legends",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/8/0d1b9de3d1d0c1413aa5170cbd0a9d39-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 18, 2014",
    "description": "There are several differences and new features in this PS4 version. In this version the textures of the game are more compressed, so you can see that the game’s graphics are clearer and more detailed than before. You will also see that there is no loading time when you enter or exit a level, which makes the navigation even faster and more enjoyable. Ubisoft has also integrated a new Camera Mode on PS4. By pressing the touchpad of the PS4 joystick, you pause the game and enter this mode, and by moving your fingers on the touchpad, you zoom in and out on the image and drag the image frame; and finally, by pressing the Share button, you can take a photo and share it with everyone. This Camera Mode is a great way to observe in detail all the characters and settings of the game, and a great way of expression to create wacky images with the elements found in the game. On PS4, you can also use the touchpad to scrape the famous Lucky Tickets, then you will really feel like you’re scraping lottery tickets (with the sound of scraping straight from the PS4 joystick). Finally, in this PS4 version, you’ll also find new playable heroes: Assassin Ray (a character inspired by Edward Kenway, the hero of Assassin’s Creed IV: Black Flag), Funky Ray (a delusional character that you can unlock by using Uplay points), and Champion Ray (a character who will be offered to the best players of the community and those who live in this community; this character correspond to the new VIP status, visible in the rankings of online challenges). [Playstation Blog]",
    "score": "90"
  },
  {
    "id": "6a5843f6-3d01-4e35-b460-b64fa43d4925",
    "title": "Fez",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/8/018c842f7529a75fa3d579f37abf3b71-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 25, 2014",
    "description": "Gomez is a 2D man on a voyage of discovery into the mysterious 3rd dimension. Change your perspective and look at the world in a different way.",
    "score": "90"
  },
  {
    "id": "14e28dbb-b9e7-4de5-b2df-c43ef9b80158",
    "title": "Monster Hunter: World",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/7/0245d66dc92ae7aaf60092cba62f1e7b-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 26, 2018",
    "description": "In Monster Hunter: World you assume the role of a hunter venturing to a new continent where you track down and slay ferocious beasts in heart-pounding battles. This new land and its diverse inhabitants play a critical role in each quest as you strategically use the surrounding environment including terrain, vegetation and wildlife to your advantage in battle or become hindered by the hazards they present. As a hunter, you must use your cunning and expertise to track and maneuver your targets throughout the intense, evolving battles. [Capcom]",
    "score": "90"
  },
  {
    "id": "7452df33-38db-4935-abcc-e5baf3943f83",
    "title": "Tales From The Borderlands: Episode 5 - The Vault of the Traveler",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "platform": "PlayStation 4",
    "date": "October 20, 2015",
    "description": "In the final episode of the season, all hell is breaking loose. Jack is now in control of Helios' systems, and he is ready to reclaim his rightful place as king of Hyperion - with or without you. It's a mad dash to get out of the chaotic space station alive, as everyone scrambles to grab the final Gortys piece and high tail it back to Pandora. Can you guide our motley crew through perilous corporate dangers in hopes of getting some copious alien riches? Loyalties will be tested, secrets will be revealed, and explosions will be in large supply in this final chapter of Tales From The Borderlands.",
    "score": "90"
  },
  {
    "id": "cca6fca0-7898-4f95-8767-5318955d609b",
    "title": "The Witcher 3: Wild Hunt - Hearts of Stone",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/7/6a8d43be84e5a8f4ae645613a2756f60-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 12, 2015",
    "description": "Hearts of Stone features over ten hours of new adventures and introduces new characters, powerful monsters, unique romance, and an entirely new storyline shaped by gamer choices. The expansion also introduces a new system of Runewords that significantly affects gameplay. Each Runeword impacts a different aspect of in-game mechanics and allows the players to experiment with various strategies and tactics. [CD Projekt]",
    "score": "90"
  },
  {
    "id": "4c72b46c-a6dd-4d2c-9e07-2856aabe8e25",
    "title": "Sekiro: Shadows Die Twice",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/6/a03dc14041cf90fe791985271f5e059b-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 22, 2019",
    "description": "Your death won’t come easily. Enter the world of late 1500s Sengoku Japan; a brutal, bloody period of constant life-and-death conflict. As tensions rise, a compelling new story unfolds amongst the chaos. Introducing Sekiro: Shadows Die Twice, a dark and twisted new gameplay experience developed by the renowned team at FromSoftware and published by Activision. Directed by Hidetaka Miyazaki, Sekiro: Shadows Die Twice is a third-person, action-adventure game with RPG elements. The single-player game puts players in the protagonist role of a hard-hearted warrior whose mission is to rescue his master, a young lord, and exact revenge on his arch nemesis. As “Sekiro,” or the “one-armed wolf,” players discover the many ways to strategically approach combat and engage enemies. [Activision]",
    "score": "90"
  },
  {
    "id": "87927309-90b9-4c22-b7fc-d2643f112c94",
    "title": "Astro Bot: Rescue Mission",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/4/70fd18c7d21daea37f03624d071d4db6-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 2, 2018",
    "description": "Astro Bot Rescue Mission is a platformer, developed exclusively for use with PS VR. Take control of Astro the captain Bot and go on an epic VR rescue mission to save your fellow Bots who are dispersed all over space.",
    "score": "90"
  },
  {
    "id": "b7bc0fcf-f892-466b-bd3b-87c5e84f02f3",
    "title": "Monster Hunter: World - Iceborne",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "platform": "PlayStation 4",
    "date": "September 6, 2019",
    "description": "Monster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivals the gameplay volume from the original release and features a new icy setting, storyline, monsters, gameplay options, and more.\n\nThe game's all-new story picks up after Monster Hunter: World and whisks hunters away to the newly discovered chilly locale that, once fully explored, becomes the largest region in World so far. The new locale is home to several new and returning monsters ready to challenge hunters throughout their expeditions and raises the stakes with the added higher difficulty Master Rank. Iceborne continues the skill-based progression and robust crafting system found in World and expands that with several new gameplay features that broaden the player's combat repertoire. All this leads to the ultimate hunter test against the mysterious new flagship monster, Velkhana.",
    "score": "89"
  },
  {
    "id": "f5905909-3ca7-43d3-9ea1-f644d3bff449",
    "title": "Rez Infinite",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/0/0067fb9d1735f7203cacee646bda856a-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 13, 2016",
    "description": "To resolve the world's rising crime rates, a new system called Project-K was created. However, Eden, the core of Project-K, has fallen into a vegetative state. Now it's up to you, a hacker, to travel through a cyberspace filled with firewalls, viruses, and other obstacles, and jump-start the system's artificial intelligence. Scattered throughout the levels are evolution spheres, which let you transform into more powerful humanoid forms. The game features a pounding soundtrack and unique vector worlds.",
    "score": "89"
  },
  {
    "id": "d8dedcb6-c7dc-4d58-a658-d22efbafa9bd",
    "title": "Titanfall 2",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/2/fae7cd4043af9a7f170bf9c93d26f501-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 28, 2016",
    "description": "In single player, Titanfall 2 delivers a crafted experience that explores the unique bond between man and machine. Playable offline, the single player campaign in Titanfall 2 lets fans step out onto The Frontier as a Militia rifleman with aspirations of becoming an elite Pilot. Stranded behind enemy lines and facing overwhelming odds, players must team up with a veteran Titan to uphold a mission they were never meant to carry out. In multiplayer, Respawn is continuing to evolve their gameplay to provide a more robust experience that delivers expanded depth and variety that includes six new Titans, deeper Pilot abilities, more customization options, and a robust progression system that is sure to satisfy fans. [Electronic Arts]",
    "score": "89"
  },
  {
    "id": "d180c2d0-1d0a-4908-bee7-eb7c144b3855",
    "title": "Dark Souls III",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/4/ff728f9a503208cfe52254e6224be46a-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 12, 2016",
    "description": "Developed by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge and deep RPG gameplay as they search for a way to survive the coming apocalypse.",
    "score": "89"
  },
  {
    "id": "4a977af7-93b2-4e6d-875b-2568ef028e5f",
    "title": "Tetris Effect",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/2/19fb7c752a424e72a87156fd248f87d7-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 9, 2018",
    "description": "From deep beneath the ocean to the furthest reaches of outer space, Tetris Effect’s 30-plus stages are more than just backdrops; together with music, characters, and animations tailor-made for each level and triggered by your actions, they’re all meant to make you feel something — to convey a mood, or even provoke an emotional response. [Enhance, Inc.]",
    "score": "89"
  },
  {
    "id": "bfd5d9a4-b554-4497-947a-2e14ceb6d007",
    "title": "Final Fantasy XIV: Stormblood",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/8/ab19338149682bf32a2378575586652e-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 20, 2017",
    "description": "Dive into the next chapter of the Final Fantasy XIV Online with its next expansion pack - Stormblood. Explore vast, new lands, including Ala Mhigo, and challenge new Primal threats across Eorzea as you embark on hundreds of new quests as the Warrior of Light. \n\nFEATURES\n\n* Level cap increased from 60 -> 70\n* New jobs, including red mage\n* New exploration with swimming and diving\n* New areas to explore\n* A new primal  Lakshmi\n* New dungeons\n* New High-level Raid The Bend of Time  Omega\n* New alliance raid Return to Ivalice\n* The Forbidden Land of Eureka\n* New gear and crafting recipes\n* A fourth residential district\n* Expanded item inventory and changes to the battle system",
    "score": "89"
  },
  {
    "id": "cbc19812-d1b6-4835-847b-bb3ea6b00076",
    "title": "Pistol Whip",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/0/4bfabdfe73117cf5d4a10e5702190156-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 30, 2020",
    "description": "Pistol Whip is an unstoppable action-rhythm FPS. Journey through a cinematic bullet hell powered by a breakneck soundtrack to become the ultimate action hero legend.",
    "score": "89"
  },
  {
    "id": "dce354fc-0962-4657-aada-cb5ed84aeef8",
    "title": "Bastion",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/7/eb82c6b59e4553979237036ff085f9b7-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 7, 2015",
    "description": "The goal of the game is to construct a safe haven in the wake of the Calamity, a cataclysmic event that shattered the world into a series of floating islands. As players journey into the wild unknown in search of survivors and supplies, they will confront strange beasts, forge an array of customizable weapons, and gain new powers from specially-brewed spirits. The entire play experience of Bastion is dynamically narrated, gradually revealing a rich backstory as the narrator reacts to the player's actions in real time.",
    "score": "89"
  },
  {
    "id": "df7eb89d-536e-476d-85a1-cbd546757b79",
    "title": "Apex Legends",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/1/d9661dc3c5f9505e2af27aecf9e4e8f8-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 4, 2019",
    "description": "Conquer with character in Apex Legends, a free-to-play Battle Royale shooter where legendary characters with powerful abilities team up to battle for fame and fortune on the fringes of the Frontier. Master an ever-growing roster of diverse legends, deep tactical squad play, and bold new innovations that level-up the Battle Royale experience—all within a rugged world where anything goes. Welcome to the next evolution of Battle Royale.",
    "score": "89"
  },
  {
    "id": "d0ee1c68-5e20-49d9-a24a-505c3d70cc94",
    "title": "Dreams",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/7/414587fc71d02964cacd4d79c89e9226-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 14, 2020",
    "description": "Dreams is the space you go to where you go to play and experience the dreams of Media Molecule and its community. It’s also a space in which to create your own dreams, whether they’re games, art, films, music or anything in-between and beyond. [Media Molecule]",
    "score": "89"
  },
  {
    "id": "d0ec4d12-dea4-4b49-831a-75d51e80dc9e",
    "title": "Dragon Age: Inquisition",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/7/fc41373dcce81139a504f7ec37c81501-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 18, 2014",
    "description": "Choose and spearhead a team of characters into rough battles against a variety of enemies – from earth-shaking High Dragons to demonic forces from the otherworld of the Fade. Go mano y mano in visceral, heroic combat as your followers fight at your six, or switch to tactical view to coordinate lethal offensives using the combined might of your company. View the tangible results of your path through a living world – construct structures, customize outposts, and change the landscape itself as environments are re-shaped in the wake of your Inquisition. Lead a company selected from nine unique, fully-realized characters – each of whom react to your actions and choices differently, forming complex relationships both with you and with each other. Hone your own character from multiple races, customize their appearance, and select their powers and abilities as the game progresses. Extensive customization options allow you to choose everything from the color of your follower’s boots to the features of your Inquisition stronghold. Become an agent of change in a time of uncertainty and upheaval.  Shape the course of empires, bring war or peace to factions in conflict, and drive the ultimate fate of the Inquisition. Will you stop the cataclysmic anarchy gripping the Dragon Age? [Electronic Arts]",
    "score": "89"
  },
  {
    "id": "e3afd8d2-d02e-495b-bbef-e0386b0d56ec",
    "title": "Battlefield 1",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/1/e88153ef354ef87717d8fa4bfc52e427-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 18, 2016",
    "description": "Intuitive destruction and dynamic weather ensure that no battle is ever the same. For even more gameplay possibilities, carve a path through walls and buildings, take down your enemies in creative ways, and leave your mark on the terrain around you through intuitive destruction. Through your actions, the pristine world around you change into a battle-scarred landscape, changing the world forever. With dynamic weather you will need to adapt your tactics to weather changes as the elements play a part in the battle. Playing the same map on a bright day, in heavy fog, or rain will impact what you see and hear, forcing you to adapt your play style on an ever-changing battlefield. Operations introduces a new way to play multiplayer. In Battlefield 1 you play a series of interconnected battles across multiple fronts. Play a sequence of battles where your actions have consequences beyond a single match, as you try to conquer territory or push back your attackers. At those times when you feel all is lost, call in the Behemoths - the largest fully player-controlled vehicles ever seen in Battlefield. Roam the battlefield and rain fire on your enemy to break their defenses. All-out war never felt so epic. Take control of the Armored Train, Air Ship, or the Battleship to dominate the battlefield across land, air, and sea. [Electronic Arts]",
    "score": "89"
  },
  {
    "id": "b3367f29-24cf-4ed5-bae9-27aac788d3a8",
    "title": "Horizon Zero Dawn",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/6/e5cfe9ceea82fd605822b1eb90ff3e73-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 28, 2017",
    "description": "Horizon Zero Dawn is a PS4-exclusive action role playing game developed by Guerrilla Games, creators of the Killzone franchise. As Horizon Zero Dawn’s main protagonist Aloy, a skilled hunter, explore a vibrant and lush world inhabited by mysterious mechanized creatures. Embark on an emotional journey to unravel mysteries of tribal societies, ancient artifacts and advanced technologies that will determine the fate of this planet, and of life itself.",
    "score": "89"
  },
  {
    "id": "c510ff1c-c387-44bc-8cdb-482a404f344b",
    "title": "Minecraft: PlayStation 4 Edition",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/5/b9e980273da77c20a0a6b922b95dd857-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 3, 2014",
    "description": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes.",
    "score": "89"
  },
  {
    "id": "a98f3d41-cd9f-49ba-a844-4a5f9efd0006",
    "title": "What Remains of Edith Finch",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/4/964df5f603d32600674e6b43703a1e0f-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 25, 2017",
    "description": "The game is a collection of short stories. Each of those stories focuses on the death of a different Finch family member and each is meant to look and feel different from the others, the way no two people in any family are alike. [Giant Sparrow]",
    "score": "88"
  },
  {
    "id": "4e0ff25d-9a0c-4edf-8e52-4d842e761b79",
    "title": "The Binding of Isaac: Rebirth",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/7/5d2ba077281975b78bbf07d4ef768877-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 4, 2014",
    "description": "Rebirth is a randomly generated action RPG shooter with emphatic Roguelike elements. Following Isaac on his journey gamers discover bizarre treasures that change Isaac’s form giving him extra-human abilities and enabling him to fend off droves of mysterious creatures, learn secrets and scrap his way to safety.",
    "score": "88"
  },
  {
    "id": "52408708-0c5f-46a8-8a08-b7094abf2ba1",
    "title": "Tony Hawk's Pro Skater 1 + 2",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/0/64dd7ba47face08621c57c84726bc0e2-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 4, 2020",
    "description": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.",
    "score": "88"
  },
  {
    "id": "e7e877cb-9374-4e17-902b-742d98f53268",
    "title": "NieR: Automata",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/2/199299cb57b2575571d52793cc02ca2d-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 7, 2017",
    "description": "NieR Producer Yosuke Saito, director Taro Yoko and composer Keiichi Okabe return, teaming up with character designer Akihiko Yoshida and PlatinumGames to present the next entry in the saga – NieR: Automata.",
    "score": "88"
  },
  {
    "id": "44a2db1d-8d87-4298-8545-7b5c83b0135e",
    "title": "Rise of the Tomb Raider: 20 Year Celebration",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/7/8f5162e7ae59cd595c82a1833029967a-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 11, 2016",
    "description": "Lara Croft embarks on her first Tomb Raiding expedition to the most treacherous and remote regions of Siberia. Rise of the Tomb Raider: 20 Year Celebration also includes the new “Blood Ties” single player content, VR support, new Co-op play for Endurance mode, and more. [Playstation.com]",
    "score": "88"
  },
  {
    "id": "e6c4aa25-49a4-4b5c-88ac-dd696ea3b6b8",
    "title": "NBA 2K17",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/5/69e511eacd3793a9638b5dae38697af9-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 16, 2016",
    "description": "NBA 2K17 promises to take the game to new heights and continue to blur the lines between video game and reality.",
    "score": "88"
  },
  {
    "id": "4ef23820-9e37-4421-9e55-4df9a5237162",
    "title": "Dishonored 2",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/4/8e507e31abccfeea0171e7d93a8da1a4-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 10, 2016",
    "description": "Dishonored 2 takes your protagonist, Corvo Attano or Emily Kaldwin, to the coastal city of Karnaca where the choices you make will have significant impact on the world.",
    "score": "88"
  },
  {
    "id": "b5302b9d-2e44-4f02-a30f-e0caa5f18f9e",
    "title": "Injustice 2: Legendary Edition",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/8/0001363b4e55d7ae506b471ae57b17d2-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 27, 2018",
    "description": "",
    "score": "88"
  },
  {
    "id": "be6a10da-4beb-4700-8f0e-f6490f711775",
    "title": "Divinity: Original Sin Enhanced Edition",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/4/553f93f9e5e531a406f50bb6bdfd84ff-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 27, 2015",
    "description": "Divinity Original Sin: Enhanced Edition is a much lauded Role-Playing-Game that blends deep customization and humor with dynamic turn based combat. Either in online co-op, split-screen co-op on your TV, or even alone, take advantage of a classless RPG system to create your heroes and conquer the evils of Rivellon!\n\nEmbark upon a journey with up to three companions as you bend the very fabric of time, where what seems like the case of a simple murder unravels into hours of quests facing fiendish foes, magical polymorphs, and dastardly bosses. As a Source Hunter, master the elements and use the environment to your advantage in dynamic combats mixing weather and magic to explode, poison, electrify, freeze and burn your enemies!",
    "score": "88"
  },
  {
    "id": "60365752-2ab3-4acd-9bbf-4227c9e04951",
    "title": "Devil May Cry 5",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/8/59e75f5dbf2ac27a96391eed0e125bde-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 8, 2019",
    "description": "The story is set several years after Devil May Cry 4.\nLegendary DMC action returns, made all the more stylish by the power modern gaming has to offer.\n\nBehold stunning visuals built upon the technology that brought you Resident Evil 7 biohazard. High framerate graphics and flexible design give our creators what they need to offer fans the latest and greatest DMC experience.",
    "score": "88"
  },
  {
    "id": "9907723f-b93e-44ef-9d0e-6576b684f217",
    "title": "Slay the Spire",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/7/ba921ee3e83012699ce7ee639c12677a-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 21, 2019",
    "description": "Slay the Spire is an energetic fusion of card games and roguelikes. Choose your cards wisely. Craft a unique deck, encounter bizarre creatures, discover relics of immense power, and make your way up the ever-changing Spire.",
    "score": "88"
  },
  {
    "id": "c3b26fad-33b6-4ae8-b4e5-32898bcf1a07",
    "title": "Owlboy",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/1/c96975f91f3a34ae3358c800598a9b22-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 10, 2018",
    "description": "Owlboy is a vertical platform adventure set in the sky, where the islands of the world have been spread apart after a great calamity. You play as Otus, among the last of the Owls, a renowned race that has produced many of the world's great wonders",
    "score": "88"
  },
  {
    "id": "5d7f4bf2-b269-45d4-8019-31a69026dc12",
    "title": "Keep Talking and Nobody Explodes",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/4/7a03c378e598d2b6cbe01b7e007f0a4f-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 13, 2016",
    "description": "One player is trapped in a virtual room with a ticking time bomb they must defuse. The other players are the “Experts” who must give the instructions to defuse the bomb by deciphering the information found in the bomb defusal manual. But there’s a catch: the experts can’t see the bomb, so everyone will need to talk it out – fast.",
    "score": "88"
  },
  {
    "id": "3b1622b9-93c9-4817-a33a-f599d1a7e827",
    "title": "The Talos Principle: Deluxe Edition",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/7/7e3dfc375aae43fd21e0a1a684e4eb90-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 13, 2015",
    "description": "In The Talos Principle, players assume the role of a sentient artificial intelligence placed within a simulation of humanity?s greatest ruins and linked together through an arcane cathedral. Players are tasked with solving a series of increasingly complex puzzles woven into a metaphysical parable about intelligence and meaning in an inevitably doomed world.",
    "score": "88"
  },
  {
    "id": "129abd8c-7cc4-47d9-a1ee-d20270f8ff41",
    "title": "Nex Machina: Death Machine",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/4/37d399b8c81e1e63acddea5c0c61104f-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 20, 2017",
    "description": "From the collaboration between Housemarque (Resogun, Alienation, Matterfall), and Robotron and Smash TV legendary creator Eugene Jarvis comes Nex Machina, an explosive arcade experience created with competition in mind. Can you survive the mechanical onslaught of hundreds of evil robots trying to obliterate any threat? Can you stop them from harvesting oblivious humans? In the vein of cult classics such Resogun and Robotron, Nex Machina is the ultimate top-down voxel shooter where everything can be blown up to pieces. Enter \"the zone\", become one with the game and pull off the most incredible feats. Packed with opportunities to create your own playstyle, face tough challenges and engage in a ruthlessly competitive environment, Nex Machina is what arcade games deserve to be in the 21th century. [Playstation.com]",
    "score": "88"
  },
  {
    "id": "9eddf0d4-7cd8-46b3-a2ec-b99d6e70abaa",
    "title": "Nioh",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/4/d57991d86d5a92a97b73f955a883b9d5-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 7, 2017",
    "description": "Take up your sword and travel to Japans blood-bathed Sengoku period  an era ravaged by warring states and dark, malevolent forces  and cut a violent path through the land as the masterless samurai, William. Cross blades in brutal hand-to-hand combat, wielding swords, axes, spears and even war hammers against foes both human and demon. Endure the vicious encounters and learn from your mistakes: each death will bring you resurrection and each resurrection a greater resolve to overcome your foes.",
    "score": "88"
  },
  {
    "id": "48b9ef20-e8e1-4258-8e5d-884388567061",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/9/1914df655227da69db0eca3865737861-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 28, 2020",
    "description": "KENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.",
    "score": "88"
  },
  {
    "id": "2f5dde8f-44da-4bab-bb14-133ddb2a3714",
    "title": "Guacamelee! Super Turbo Championship Edition",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/0/1ee61d2c25e273f79e45dec39abbe10c-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 1, 2014",
    "description": "Guacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania style of games, by adding a strong melee combat component, a new dimension switching mechanic, and cooperative same-screen multiplayer for the entire story. The game also blurs the boundaries between combat and platforming by making many of the moves useful and necessary for both of these.",
    "score": "87"
  },
  {
    "id": "9265242d-b150-4479-91a6-063105185810",
    "title": "Frostpunk: Console Edition",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/0/7002b2d5bf1d74ccc93bedfacc20e048-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 11, 2019",
    "description": "In a completely frozen world, people develop steam-powered technology to oppose the overwhelming cold. Society in its current form becomes ineffective and it has to change in order to survive.",
    "score": "87"
  },
  {
    "id": "7bff0a6b-7211-48b6-b7fe-8b26b8d4240c",
    "title": "Bloodborne: The Old Hunters",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/7/6937f77cb624399df1b7a97cbb407ece-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 24, 2015",
    "description": "Set in a nightmare world where hunters from the past are trapped forever, explore brand new stages full of dangers, rewards, and deadly beasts to overcome. You’ll find multiple new outfits and weapons to add to your arsenal as well as additional magic to wield and add more variety to your combat strategy. [SCEJ]",
    "score": "87"
  },
  {
    "id": "1cd5c234-5873-46d4-bede-964d6b94a3f8",
    "title": "XCOM 2",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/7/e47c254b6e8be1269a80857ae8ff41ac-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 27, 2016",
    "description": "Earth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, building shining cities that promise a brilliant future for humanity on the surface, while concealing a sinister agenda and eliminating all who dissent from their new order. Only those who live at the edges of the world have a margin of freedom. Here, a force gathers once again to stand up for humanity. Always on the run, and facing impossible odds, the remnant XCOM forces must find a way to ignite a global resistance, and eliminate the alien threat once and for all.",
    "score": "87"
  },
  {
    "id": "7ddbeb9d-1515-404f-99b2-2cfa537c82f1",
    "title": "Injustice 2",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/6/db6a7c7456f92e684bf8885b6defe7d0-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 16, 2017",
    "description": "Every battle defines you. Power up and build the ultimate version of your favorite DC legends in INJUSTICE 2. With a massive selection of DC Super Heroes and Super-Villains, INJUSTICE 2 allows you to equip every iconic character with unique and powerful gear earned throughout the game. Experience an unprecedented level of control over how your favorite characters look, how they fight, and how they develop across a huge variety of game modes. This is your super Hero. Your Journey. Your Injustice.",
    "score": "87"
  },
  {
    "id": "04754191-e27d-4f07-b5bd-a69c978be746",
    "title": "The Witness",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/1/f218526e8cf0179eda1d9ee7dc38ec10-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 26, 2016",
    "description": "You awaken, alone, on a strange island full of puzzles that challenge and surprise you. You can't remember who you are, and you don't remember how you came to be here, but there's one thing you can do: explore the island in hope of discovering clues, regaining your memory, and somehow finding your way home. The Witness is a single-player game in an open world with dozens of locations to explore and over 500 puzzles to solve. This game respects you as an intelligent player and it treats your time as precious. There's no filler; each of those puzzles brings its own new idea into the mix.",
    "score": "87"
  },
  {
    "id": "6a365d34-b0f4-48cf-904c-6706916edbf4",
    "title": "Dead Cells",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/1/2f089f7c9f32e527125846736fa9783d-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 7, 2018",
    "description": "Dead Cells puts you in control of a failed alchemic experiment trying to figure out what's happening on a sprawling, ever-changing and seemingly cursed Island. Tough but fair combat, responsive controls, challenging foes, permadeath and of course, the emergency panic roll to get you out of trouble, make for a demanding, visceral and cathartic action game.\n\nExperience a roguevania, mixing an interconnected world, branching paths and unlockable skills with the constant adrenaline-pumping threat of permadeath. No checkpoints. You either vanquish the final boss in one go, or you try again. However, you keep some of your progress for successive runs; new paths you've unlocked, access to new levels, mutations, abilities and weapons.\n\nSpeaking of weapons, Dead Cells features a plethora of ways to slay your enemies. A large variety of swords, bows and of course spells, but also whips, grenades and turrets, each one with its own unique twist. Plus, mutations and scrolls allow you to build and customize your character differently with each and every run.\n\nAt the end of the day though, it's your skills as a player that matter most! Roguelites are about constantly sharpening your skills, until what was an insurmountable obstacle becomes a walk in the park. Patience, you'll get better! ... eventually.\n\nFEATURES:\n\n* Roguevania: The progressive exploration of an interconnected world, with the replayability of a rogue-lite and the adrenaline pumping threat of permadeath.\n\n* 2D Souls-lite Action: Tough but fair combat, the iconic dodge roll, more than 90 weapons and spells with unique gameplay... The unforgiving action wed to the absence of any kind of safety net makes for an adrenalin pumping ride each and every run.\n\n* Nonlinear Progression: Sewers, Ossuary or Ramparts? Once unlocked, special permanent abilities allow you to access new paths to reach your objective. Opt for the path that suits your current build, your play style, or just your mood.\n\n* Exploration: Secret rooms, hidden passages, charming landscapes. Take a moment to stroll the towers and breath in that fresh sea mist infused air.",
    "score": "87"
  },
  {
    "id": "7d1c9257-e122-4bbf-a77e-e56c800f1bc8",
    "title": "Sid Meier's Civilization VI",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/6/77690f29c2bebd383547c672f32c5560-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 22, 2019",
    "description": "Civilization VI offers new ways to interact with your world, expand your empire across the map, advance your culture, and compete against historys greatest leaders to build a civilization that will stand the test of time.",
    "score": "87"
  },
  {
    "id": "3587d6cc-991f-49e8-8789-9fbf127a2bcc",
    "title": "Final Fantasy VII Remake",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/5/40531eb3a9013197e4bf63dbfb866719-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 10, 2020",
    "description": "Long ago, we looked upon a foreboding sky. The memory of the star that threatened all burns eternal in our hearts. In its wake came an age of silence. Yet with each fond remembrance, we knew those encountered were not forgotten, that some day we would see them again. Perhaps it was no more than wishful thinking. But after the long calm, there are the beginnings of a stir. The reunion at hand may bring joy, it may bring fear, but let us embrace whatever it brings. For they are coming back. At last the promise has been made.",
    "score": "87"
  },
  {
    "id": "df77e383-d0a5-4ee4-9c1f-18f559551e89",
    "title": "Street Fighter V: Arcade Edition",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/9/c3ff9db6a6ad91873bee0c36175f9c5d-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 16, 2018",
    "description": "Street Fighter V: Arcade Edition is a brand-new disc that includes all base content from the original Street Fighter V release, Arcade Mode and a code for Character Pass 1 and 2 content, which includes 12 playable characters and 12 premium costumes.\n\n* ARCADE MODE\nChoose from six different paths themed after classic Street Fighter games.\n\n* GALLERY\nUnlock hundreds of illustrations as you play through Arcade Mode.\n\n* TEAM BATTLE \nAssemble local teams, set your own rules and see who comes out on top.\n\n* EXTRA BATTLE\nComplete online challenges to earn Fight Money, EXP, unique costumes and more.\n\n* NEW V-TRIGGERS\nEach character will have two V-Triggers, adding more depth to the combat system.\n\n* NEW VISUALS\nThe UI is redesigned with new color schemes and exciting pre-and-post fight effects.",
    "score": "87"
  },
  {
    "id": "34ce4b67-0612-4670-9eb4-fe553a033610",
    "title": "Night in the Woods",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/4/d4b4b8dea97e1b18b9147c49cfbf5a37-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 21, 2017",
    "description": "Night In The Woods is a 2D story-focused adventure/exploration game with extracurricular activities to enjoy, characters to meet, and secrets to discover. Run, jump and use astral projection to explore the many sides of town of Possum Springs and the surrounding environs. Waste time around town with your crew of nerd friends. Acquire abilities that allow you to stroll into new areas. Unearth the secrets of a big cast of characters and the town itself. Experience a nutty world and the events unfolding there. Play bass. Break stuff.",
    "score": "87"
  },
  {
    "id": "24389c12-ecad-4941-9e31-e7bd283638d8",
    "title": "Dragon Ball FighterZ",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/1/88e3aed5814ef0e900d27af955a65bc6-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 26, 2018",
    "description": "After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters. Partnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay to audiences worldwide. \n\nKey Features:\n\n* 3vs3 TAG/SUPPORT\nAllows players to train and master more than one fighter/style which brings deeper gameplay\n\n* HIGH-END ANIME GRAPHICS\nUsing the power of the Unreal engine and the talented team at Arc System Works, DRAGON BALL FighterZ is a visual tour-de-force \n\n* SPECTACULAR FIGHTS\nExperience aerial combos, destructible stages, famous scenes from the DRAGON BALL anime reproduced in 60FPS and 1080p resolution (Higher resolution will be supported on PS4 Pro and Xbox Scorpio)",
    "score": "87"
  },
  {
    "id": "4b6a2b44-3ff9-4cd2-9462-cc446cd1a634",
    "title": "Batman: Arkham Knight",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/4/3748c5ef059e99cad03237ba33949409-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 23, 2015",
    "description": "Batman confronts the ultimate threat against the city he has been sworn to protect. The Scarecrow returns to congeal an imposing array of super villains, including The Penguin, Two-Face and Harley Quinn, to summarily destroy The Dark Knight. The game introduces Rocksteady's uniquely-designed imagining of the Batmobile drivable for the first time in the franchise. Batman: Arkham Knight offers gamers a complete Batman experience as they rip through the streets and soar across the skyline of the iconic Gotham City.",
    "score": "87"
  },
  {
    "id": "ee795e2f-2db6-4387-8e34-d87ca9912e38",
    "title": "Marvel's Spider-Man",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/6/ed190baf9e24c7373ba6b5533ed31eda-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 7, 2018",
    "description": "This isn't the Spider-Man you've known before, or seen in a movie. This is an experienced Peter Parker who is more masterful in fighting major crimes in New York City. At the same time he is struggling to balance his tumultuous personal life and career while the fate of nine million New Yorkers rests upon his shoulders.",
    "score": "87"
  },
  {
    "id": "ca0b3287-7190-451f-9de6-212283f5a03b",
    "title": "Okami HD",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/9/9a15c8d244ba9272fea0034cd196a248-98.jpg",
    "platform": "PlayStation 4",
    "date": "December 12, 2017",
    "description": "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.",
    "score": "87"
  },
  {
    "id": "811c5ea5-8e1e-4b83-83d6-d70a844ccd71",
    "title": "TowerFall Ascension",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/1/9311ea8093d30f14460261315f90bb8d-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 11, 2014",
    "description": "TowerFall is an archery combat platformer for up to 4 players. It's a local party game centering around hilarious, intense versus matches. The core mechanics are simple and accessible, but combat is fast and fierce. It's best played competitively with friends, cross-legged on the floor within punching distance of each other.",
    "score": "87"
  },
  {
    "id": "4dbe49c9-2cd7-4b93-b5cd-a1d896931f35",
    "title": "Monster Boy and the Cursed Kingdom",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/4/81cc2582fec32adb42c768dfffa6c021-98.jpg",
    "platform": "PlayStation 4",
    "date": "December 4, 2018",
    "description": "A legendary game series returns with an all-new adventure and in HD. Monster Boy is a colorful side-scrolling action adventure created in cooperation with Ryuichi Nishizawa, the creator of the famous Wonder Boy in Monster World series. Monster Boy is being created to bring back the enjoyment of the classic games that shine by simplicity. Exciting gameplay, upbeat music and smooth graphics. You'll need to overcome huge bosses, find hidden passages, discover powerful equipment and use all your wits and skills to remove a powerful curse. Transform into 6 different creatures, each with their own skills and abilities. Take advantage of all the unique powers to open new paths and advance in an epic story.",
    "score": "87"
  },
  {
    "id": "25914cc7-6a55-4c29-8c58-6854afff555c",
    "title": "FIFA 14",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/5/d653953db2613210718bce351944ba6c-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 12, 2013",
    "description": "Fuelled by EA SPORTS IGNITE, FIFA 14 feels alive with players who think, move, and behave like world-class footballers, and dynamic stadiums that come to life. Players have four times the decision making ability and feel alive with human-like reactions, anticipation, and instincts. With 10 times more animation depth and detail than previous consoles, FIFA 14 delivers the dynamic movements and biomechanics of the worlds best footballers. Players are agile and athletic as they plant, pivot and cut, and explode out of each step. The increased fidelity has a game-changing effect on gameplay. Plus, the artistry and athleticism of footballers will come to life with the addition of hundreds of new types of skills and hundreds of new behaviors. And for the first time ever, fans will feel the electricity of a living stadium as the emotions of new 3D crowds rise and fall around the stories on the pitch.",
    "score": "87"
  },
  {
    "id": "30c0b7a0-15e6-4491-8563-b442a0f2d5b5",
    "title": "DOOM Eternal",
    "rankNumber": "82.",
    "img": "https://static.metacritic.com/images/products/games/6/3a99440dc8efd4b087dc5c2f08a97ee0-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 20, 2020",
    "description": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]",
    "score": "87"
  },
  {
    "id": "05763ddb-0750-4b0a-a56e-aa3536c71b8c",
    "title": "Pro Evolution Soccer 2016",
    "rankNumber": "83.",
    "img": "https://static.metacritic.com/images/products/games/2/adb11404e1bd7716ba8ab8363ee32472-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 15, 2015",
    "description": "The upgraded feint moves allow for sudden directional changes that can cause defenders to lose their balance. But the developers have added a new system to the defenders arsenal. With Perfect Defence, players who time their tackles perfectly are able to powerfully shove their opponent out of the way and instantly secure the ball, allowing to create direct turnarounds and counter opportunities.",
    "score": "87"
  },
  {
    "id": "d13f3039-e433-4d7d-a3c4-2556ae2001b7",
    "title": "Zero Escape: The Nonary Games",
    "rankNumber": "84.",
    "img": "https://static.metacritic.com/images/products/games/5/2076b7b23b28ef6d3bfc3a181d585df7-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 24, 2017",
    "description": "Two Nonary Games, two sets of nine unwilling participants kidnapped to an unfamiliar location. One set trapped on a sinking boat with nine hours to escape, the other locked in a facility and forced to either trust or betray each other. If they break the rules or fail to escape… they’ll die.",
    "score": "87"
  },
  {
    "id": "92ca0d80-072b-4b84-ab3a-da4cffa08ed0",
    "title": "Wolfenstein II: The New Colossus",
    "rankNumber": "85.",
    "img": "https://static.metacritic.com/images/products/games/0/b3c6bc64a3458dbfde65f18fb44500ff-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 27, 2017",
    "description": "Wolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players to Nazi-controlled America on a mission to recruit the boldest resistance leaders left. Fight the Nazis in iconic American locations, equip an arsenal of badass guns, and unleash new abilities to blast your way through legions of Nazi soldiers in this definitive first-person shooter. America, 1961. The Nazis maintain their stranglehold on the world. You are BJ Blazkowicz, aka Terror-Billy, member of the Resistance, scourge of the Nazi empire, and humanitys last hope for liberty. Only you have the guts, guns, and gumption to return stateside, kill every Nazi in sight, and spark the second American Revolution.",
    "score": "87"
  },
  {
    "id": "423e4738-16d0-466c-90b0-8f6e4b77d0dc",
    "title": "Odin Sphere Leifthrasir",
    "rankNumber": "86.",
    "img": "https://static.metacritic.com/images/products/games/2/523651ab22e06912cabf570006596fcc-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 7, 2016",
    "description": "The tale of Armageddon is about to be told... In the world of Erion, the magical kingdom of Valentine held an enormous power. The \"Cauldron\" -- the source of this great power-- Maintained the kingdom's prosperity. However, Valentine suffered a sudden, mysterious downfall. And so the neighboring kingdoms clashed over the now-masterless Cauldron.",
    "score": "87"
  },
  {
    "id": "b3a6e6ae-6ab0-44b4-92d9-73ad87200516",
    "title": "Dark Souls II: Scholar of the First Sin",
    "rankNumber": "87.",
    "img": "https://static.metacritic.com/images/products/games/0/2d63bdf59528ea52e257f05547b2885e-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 7, 2015",
    "description": "Dark Souls II: Scholar of the First Sin includes the 3 previously released DLC packs  - Crown of the Sunken King, Crown of the Old Iron King, and Crown of the ivory King - along with additional features. All versions of the game include the following features (Existing Dark Souls II owners will receive a patch to implement these elements): Additional NPCs added for an enhanced story experience. Parameter adjustments for improved game balance. Augmented item descriptions. Improved online matchmaking functionality. [Bandai Namco]",
    "score": "87"
  },
  {
    "id": "c8a7aaa0-4837-41a2-9468-b0402e81007a",
    "title": "Sonic Mania Plus",
    "rankNumber": "88.",
    "img": "https://static.metacritic.com/images/products/games/4/2e95365b2c8822f4a88654bef572771e-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 17, 2018",
    "description": "Sonic Mania Plus is the definitive retail enhanced version of the original Sonic Mania's digital release, presented in a pristine collectible physical release. The encore pack is a $5 upgrade fee for owners of the original game.",
    "score": "87"
  },
  {
    "id": "a13168b2-cf96-4d5f-83a8-6ba5465c4c63",
    "title": "NBA 2K16",
    "rankNumber": "89.",
    "img": "https://static.metacritic.com/images/products/games/9/bfd89f8e33d35b3bc55e12397956d96b-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 25, 2015",
    "description": "Be the Story. The NBA 2K franchise is back with a true-to-life NBA experience in NBA 2K16. Guide your MyPLAYER through the complete NBA journey, take control of an entire NBA franchise, or refine your skills online competing against gamers from around the globe. With animations that provide smoother movement and more realistic articulation, it promises to be the most authentic NBA gaming experience yet. [2K]",
    "score": "87"
  },
  {
    "id": "9e2dc093-bb3f-46c0-8022-28517804dd68",
    "title": "Fallout 4",
    "rankNumber": "90.",
    "img": "https://static.metacritic.com/images/products/games/7/cb580ff127697995b5613abcd28adff2-98.jpg",
    "platform": "PlayStation 4",
    "date": "November 10, 2015",
    "description": "As the sole survivor of Vault 111, you enter a world destroyed by nuclear war. Every second is a fight for survival, and every choice is yours. Only you can rebuild and determine the fate of the Wasteland. Welcome home.",
    "score": "87"
  },
  {
    "id": "f6b9a041-4a37-476a-adab-80d3a5506261",
    "title": "Uncharted: The Nathan Drake Collection",
    "rankNumber": "91.",
    "img": "https://static.metacritic.com/images/products/games/1/1af6cd8464d45ec0c5591984d745e5be-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 9, 2015",
    "description": "From the storytellers at Naughty Dog, comes the epic that altered adventure storytelling, rebuilt by Bluepoint Games with the power of the PS4 system. Follow the harrowing journey of Nathan Drake across the globe, from humble beginnings to incredible discoveries. Meet a unique cast of characters as Drake puts life and friendships on the line in a race against ruthless enemies to uncover unimaginable treasure. UNCHARTED: The Nathan Drake Collection includes the single-player campaigns for UNCHARTED: Drake’s Fortune, UNCHARTED 2: Among Thieves, and UNCHARTED 3: Drake’s Deception.",
    "score": "86"
  },
  {
    "id": "3a9dadad-596e-42ef-abea-ab94b37d22e3",
    "title": "Tales from the Borderlands: A Telltale Game Series",
    "rankNumber": "92.",
    "img": "https://static.metacritic.com/images/products/games/3/c50b5a10cb4c49160568147683de5af5-98.jpg",
    "platform": "PlayStation 4",
    "date": "October 20, 2015",
    "description": "Like all good tales, there’s more than one side to a story. Especially one about a Vault key, the Hyperion Corporation, bandits, loot, gangsters, Vault Hunters, secret Atlas tech, explosions, getaways, extortion, betrayal, and mayhem. Set after the events seen in Borderlands 2, Tales from the Borderlands is about Rhys, a Hyperion company man looking to become the next Handsome Jack, and it’s also about Fiona, a Pandoran con artist out to score the biggest of all swindles. Lured into danger by a Vault key and all it promises, the unlikely duo are thrown together with a common goal and a huge amount of mistrust. Who is telling the truth, and why is it important That’s up to you to decide. You are Rhys…and you are also Fiona, because like every tale worth telling, there are two…oh, you read that part already? Well, it’s important to remember that there *are* two sides to every story, and you my friend, you will tell this tale, or…tales, through the choices that you make. Your every decision as both Rhys and Fiona will affect the people and world around you: this is a game where YOU are the final author in a brand new Borderlands story set on the unforgiving world of Pandora. [TellTale Games]",
    "score": "86"
  },
  {
    "id": "ec76cfab-335a-46da-a3d8-7bc6998f97b6",
    "title": "F1 2017",
    "rankNumber": "93.",
    "img": "https://static.metacritic.com/images/products/games/3/72356e903cf71d84e0afcce79ad8dc8e-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 25, 2017",
    "description": "Win the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. The game sports an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both online and offline.",
    "score": "86"
  },
  {
    "id": "fe5f34c9-eee6-41a7-9b77-ebcb3b379726",
    "title": "F1 2020",
    "rankNumber": "94.",
    "img": "https://static.metacritic.com/images/products/games/0/a6b5c97bd1982a9bf6de744278b973fe-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 6, 2020",
    "description": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.",
    "score": "86"
  },
  {
    "id": "bc58068a-abfa-463b-811e-3d080b4b360e",
    "title": "Velocity 2X",
    "rankNumber": "95.",
    "img": "https://static.metacritic.com/images/products/games/6/e4c3f93c1df6ab5fdbf092a4131c4ba8-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 2, 2014",
    "description": "Velocity 2X features puzzle-platforming action alongside top-down shoot-'em-up gameplay.",
    "score": "86"
  },
  {
    "id": "fcbc93cd-b990-45ec-8419-616c238927cd",
    "title": "Stardew Valley",
    "rankNumber": "96.",
    "img": "https://static.metacritic.com/images/products/games/3/5162aaf6f3c4f681f96d431e4ec21c96-98.jpg",
    "platform": "PlayStation 4",
    "date": "December 13, 2016",
    "description": "You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness.",
    "score": "86"
  },
  {
    "id": "ff222592-e0cd-43af-8474-a91a29ff5477",
    "title": "Dragon Quest Builders 2",
    "rankNumber": "97.",
    "img": "https://static.metacritic.com/images/products/games/8/eb856467c3ab1e3a729b980a61466da4-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 12, 2019",
    "description": "DRAGON QUEST BUILDERS 2 is a block-building role-playing game with a charming single player campaign and a robust multiplayer building mode that supports up to four players online. Create your customized character, team-up with your fearless friend Malroth, gather the skills required to become a full-fledged builder, and combat the Children of Hargon, a vile cult that worships destruction. Then, take your builder online and join your friends to collaborate and create something truly magnificent. Don’t let the name fool you, despite the 2, this is a completely standalone experience featuring new characters, an expansive world, unlimited building combinations, and a storyline that promises to satisfy longtime fans and newcomers alike. [Square Enix]",
    "score": "86"
  },
  {
    "id": "483b6203-9091-4eea-93f4-d7f427314036",
    "title": "Steins;Gate Elite",
    "rankNumber": "98.",
    "img": "https://static.metacritic.com/images/products/games/2/9042d277fa7c03dab0affc36b9bd4afb-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 19, 2019",
    "description": "STEINS;GATE ELITE is a remastered title with animated scenes from the anime, creating a brand-new, immersive experience. Follow a group of young, tech-savvy Lab Members who discover the means of changing the past by using e-mail and a modified microwave. Their experiment to push the boundaries of time spirals out of control as they become entangled in a conspiracy surrounding SERN, the organization behind the Large Hadron Collider, and John Titor, who claims to be from a dystopian future.",
    "score": "86"
  },
  {
    "id": "5dc7d732-8d4a-4da7-9305-378c1c70e831",
    "title": "Thimbleweed Park",
    "rankNumber": "99.",
    "img": "https://static.metacritic.com/images/products/games/4/ad23159de873b21144a2be11f50fa5d2-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 22, 2017",
    "description": "Thimbleweed Park is the curious story of two washed up federal agents called in to investigate a dead body found in the river just outside of town, bloated and pixelated from a death some too soon.",
    "score": "86"
  },
  {
    "id": "008a7862-e063-4c6d-ae1e-e3edf02128f1",
    "title": "Ni no Kuni: Wrath of the White Witch Remastered",
    "rankNumber": "100.",
    "img": "https://static.metacritic.com/images/products/games/8/c157252b3a8ec19a7fa62a81432bde18-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 20, 2019",
    "description": "Ni no Kuni: Wrath of the White Witch Remastered = Journey back to the other world in Ni no Kuni: Wrath of the White Witch. LEVEL-5's classic tale returns better than ever. Join Oliver as he embarks on an adventure through a world inhabited by new friends and ferocious foes alike in the hopes of bringing back his mother after a tragic incident. With a copy of the Wizard's Companion in his hand and his trusty friend Drippy by his side, he will travel across this rich fantasy world to tame familiars, take on enemies, and overcome the countless challenges that stand between him and his mother's salvation.\n\nFeatures:\n\nThis charming tale unfolds through the use of animation storyboarded and created by the legendary Studio Ghibli and music composed by the renowned Joe Hisaishi. Ni no Kuni: Wrath of the White Witch combines beautiful animated visuals, masterful storytelling, and a sweeping score to create an epic role-playing adventure like no other.\n\n* TAKE THE OTHER WORLD WITH YOU - Take Ni no Kuni: Wrath of the White Witch wherever you go on Nintendo Switch\n* ALL-STAR PRODUCTION - LEVEL-5's mastery of the RPG genre is combined with Studio Ghibli's world-class animation and\nmusic composed by the renowned Joe Hisaishi\n* CAPTIVATING STORY - A charming yet tragic tale unfolds through the use of animation storyboarded and created by Studio\nGhibli with English and Japanese voice-overs\n* ROLE-PLAYING MASTERY - A rich mixture of familiar RPG elements, expertly crafted and designed, and featuring dozens of\nlocations to explore, hundreds of creatures to battle, and a wealth of quests and secrets to uncover\n* DYNAMIC COMBAT - Switch freely between characters and familiars in an exciting battle system that combines real-time and\nturn-based tactical elements",
    "score": "86"
  }
]