[
  {
    "id": "64d69f6b-dfb8-4db0-9be6-8473fe2972ce",
    "title": "The Legend of Zelda: Breath of the Wild",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/9/6d163aaa6b6cc28519ffea9195649929-98.jpg",
    "platform": "Switch",
    "date": "March 3, 2017",
    "description": "Forget everything you know about The Legend of Zelda games. Step into a world of discovery, exploration and adventure in The Legend of Zelda: Breath of the Wild, a boundary-breaking new game in the acclaimed series. Travel across fields, through forests and to mountain peaks as you discover what has become of the ruined kingdom of Hyrule in this open-air adventure. Explore the wilds of Hyrule any way you like - Climb up towers and mountain peaks in search of new destinations, then set your own path to get there and plunge into the wilderness. Along the way, you'll battle towering enemies, hunt wild beasts and gather ingredients for the food and elixirs you'll need to sustain you on your journey. More than 100 Shrines of Trials to discover and explore - Shrines dot the landscape, waiting to be discovered in any order you want. Search for them in various ways, and solve a variety of puzzles inside. Work your way through the traps and devices inside to earn special items and other rewards that will help you on your adventure.\n*    Be prepared and properly equipped - With an entire world waiting to be explored, you'll need a variety of outfits and gear to reach every corner. You may need to bundle up with warmer clothes or change into something better suited to the desert heat. Some clothing even has special effects that, for example, can make you faster and stealthier.\n*    Battling enemies requires strategy - The world is inhabited with enemies of all shapes and sizes. Each one has its own attack method and weaponry, so you must think quickly and develop the right strategies to defeat them.\n*    amiibo compatibility - Tap the Wolf Link amiibo (sold separately) to make Wolf Link appear in game. Wolf Link will attack enemies on his own and help you find items you're searching for.",
    "score": "97"
  },
  {
    "id": "b4d9e5e8-3b81-4f39-a96d-96d6518a6905",
    "title": "Super Mario Odyssey",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/0/95d6598e9d4f35b872429b25d2d044d0-98.jpg",
    "platform": "Switch",
    "date": "October 27, 2017",
    "description": "New Evolution of Mario Sandbox-Style Gameplay. Mario embarks on a new journey through unknown worlds, running and jumping through huge 3D worlds in the first sandbox-style Mario game since Super Mario 64 and Super Mario Sunshine. Set sail between expansive worlds aboard an airship, and perform all-new actions, such as throwing Mario's cap.",
    "score": "97"
  },
  {
    "id": "848b5224-73ca-4a14-bfce-b4e88a0cf634",
    "title": "Divinity: Original Sin II - Definitive Edition",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/7/e49223cd814965726e7de71fa7842951-98.jpg",
    "platform": "Switch",
    "date": "September 4, 2019",
    "description": "Set a thousand years after the first game, Divinity: Original Sin II presents a darker, more grounded narrative and expands on the tactical combat system of its award-winning predecessor. In Divinity: Original Sin, you were on a quest for the forbidden Source magic. Now, you yourself are a Sourcerer: a dangerously powerful individual whose abilities summon creatures from the encroaching Void. The Divine is dead and the Void is everywhere. Sourcerers are blamed and the Divine Order is leading the charge against the threat: you. Captured and sent to Fort Joy, you will be \"cured\" of your powers -- no matter the cost. But the Order has secrets of its own that may cast doubt on its so-called holy mission. As you escape from Fort Joy, you realize that if the world remains godless, it will be consumed by the Void.",
    "score": "93"
  },
  {
    "id": "9ef94bf7-83a9-46a2-aca5-8e8bb6126961",
    "title": "Undertale",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/7/c15ca7be6ab41982351c83d45911f629-98.jpg",
    "platform": "Switch",
    "date": "September 18, 2018",
    "description": "Welcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever.\n\n((Healthy Dog's Warning: Game contains imagery that may be harmful to players with photosensitive epilepsy or similar condition.))\n\nfeatures:\n\n*    Killing is unnecessary: negotiate out of danger using the unique battle system.\n*    Time your attacks for extra damage, then dodge enemy attacks in a style reminiscent of top-down shooters.\n*    Original art and soundtrack brimming with personality.\n*    Soulful, character-rich story with an emphasis on humor.\n*    Created mostly by one person.\n*    Become friends with all of the bosses!\n*    At least 5 dogs.\n*    You can date a skeleton.\n*    Hmmm... now there are 6 dogs...?\n*    Maybe you won't want to date the skeleton.\n*    I thought I found a 7th dog, but it was actually just the 3rd dog.\n*    If you play this game, can you count the dogs for me...? I'm not good at it.",
    "score": "93"
  },
  {
    "id": "b31e5242-baf2-4234-a78e-21bf862eb4af",
    "title": "Super Smash Bros. Ultimate",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/6/cb1c4fbf6a314df9c7354aea84c4198a-98.jpg",
    "platform": "Switch",
    "date": "December 7, 2018",
    "description": "Inklings from the Splatoon series, as well as returning Smash characters like Mario and Link will be making appearances in this classic Nintendo franchise's Switch debut. Faster combat, new items, new attacks, new defensive options, and more will keep the battle raging whether you’re at home or on the go.",
    "score": "93"
  },
  {
    "id": "35ac3a18-639c-4fd1-a308-956c7d571120",
    "title": "Celeste",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/4/a53232ef0f7a0122744dfd3901f9bf7e-98.jpg",
    "platform": "Switch",
    "date": "January 25, 2018",
    "description": "Help Madeline survive her journey to the top of Celeste Mountain in this super-tight, hand-crafted platformer from the creators of TowerFall.",
    "score": "92"
  },
  {
    "id": "78523f85-6e61-47fb-848d-49e265c660ec",
    "title": "Bayonetta 2",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/6/ac323c38bfe096a79b5982d595644731-98.jpg",
    "platform": "Switch",
    "date": "February 16, 2018",
    "description": "In this climatic sequel to the critically acclaimed Bayonetta action game, players will be on the edge of their seats from start to finish. Brimming with epic, gorgeous cut scenes and battles that are more exhilarating than ever, this game never lets up on the action. Fight on top of a jet as it soars through a downtown city. Duke it out against a giant angel, who bears a whip for an arm, on top of a speeding train. And take to the skies in a fight against a demonic monster while ascending to the top of a skyscraper.",
    "score": "92"
  },
  {
    "id": "b6b799c7-9258-4e31-9ccb-db58d6784bec",
    "title": "Mario Kart 8 Deluxe",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/3/47645cf22467c563a70fca6c8930b5ba-98.jpg",
    "platform": "Switch",
    "date": "April 28, 2017",
    "description": "Race and battle your friends in the definitive version of Mario Kart 8. Hit the road with the definitive version of Mario Kart 8 and play anytime, anywhere! Race your friends or battle them in a revised battle mode on new and returning battle courses. Play locally in up to 4-player multiplayer in 1080p while playing in TV Mode. Every track from the Wii U version, including DLC, makes a glorious return. Plus, the Inklings appear as all-new guest characters, along with returning favorites, such as King Boo, Dry Bones, and Bowser Jr. Race your friends in the definitive version of Mario Kart 8, only on Nintendo Switch. Race as every character on every track from the Wii U version, including DLC characters and tracks. Pop some balloons in the revamped Battle mode, complete with Balloon Battle and Bob-omb Blast. Battle on new courses, like Urchin Underpass and Battle Stadium, or returning ones, such as GCN Luigi's Mansion and SNES Battle Course 1. Inkling Girl & Inkling Boy from Splatoon, King Boo, Dry Bones, and Bowser Jr. join the roster. Players can choose a new Smart Steering feature which makes driving and staying on the track easy for novice players and kids even at 200cc. Three new vehicles have been added, two are even inspired by Splatoon. Carry two items at the same time. Returning items include Boo, the item stealing ghost, and the Feather, which gives you a high jump in battle mode. Play your friends in local wireless multiplayer with up to 8 players. Drive through in 1080p HD quality in TV mode. Play on the go with handheld mode and play anytime, anywhere.",
    "score": "92"
  },
  {
    "id": "db7b158b-df31-4c2d-ab93-977e898d5408",
    "title": "INSIDE",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/2/9707c53332e67137577454c38a8e2126-98.jpg",
    "platform": "Switch",
    "date": "June 28, 2018",
    "description": "Hunted and alone, a boy finds himself drawn into the center of a dark project.",
    "score": "91"
  },
  {
    "id": "7d4a9a0a-70e2-4825-9b5d-8129875dbbdc",
    "title": "Dragon Quest XI S: Echoes of an Elusive Age - Definitive Edition",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/5/39f4fe25429b192582ddb68d4d24b24f-98.jpg",
    "platform": "Switch",
    "date": "September 27, 2019",
    "description": "Dragon Quest XI: Echoes of an Elusive Age tells a captivating tale of a hunted hero and is the long-awaited role-playing game from series creator Yuji Horii, character designer Akira Toriyama and composer Koichi Sugiyama. While it is the eleventh mainline entry in the critically acclaimed series, Dragon Quest XI is a completely standalone experience that features entirely new characters, a beautifully detailed world, finely tuned turn-based combat, and an immersive story that will appeal to long-time fans and franchise newcomers alike. A young man, about to participate in his village's coming of age ceremony, travels to a Sacred Stone alongside his childhood friend. After a series of unexpected events, this intrepid adventurer learns he is the reincarnation of a legendary hero from a forgotten age. The young hero sets forth into an unknown world on a journey to unravel the mystery of his past... but the welcome he receives is far from warm. Upon revealing his identity to the King, the hero is branded as \"The Dark spawn\" and hunted by a relentless army. Fleeing from his pursuers, the hero assembles a band of endearing adventurers who believe he is actually The Luminary reborn. The hero and his newfound companions embark on a quest that will take them across continents and over vast oceans as they learn of an ominous threat facing the world.",
    "score": "91"
  },
  {
    "id": "d368cc7c-755d-467a-9bdd-d488c800e196",
    "title": "Sonic Mania Plus",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/2/788798514cd10999c6aa3c9bfa2f16d0-98.jpg",
    "platform": "Switch",
    "date": "July 17, 2018",
    "description": "Sonic Mania Plus is the definitive retail enhanced version of the original Sonic Mania's digital release, presented in a pristine collectible physical release. The encore pack is a $5 upgrade fee for owners of the original game.",
    "score": "91"
  },
  {
    "id": "de03d998-6267-493f-8dbf-6ba273e5b930",
    "title": "SteamWorld Heist: Ultimate Edition",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/5/a567680ef0b22c6a5c1e57765b3b1bed-98.jpg",
    "platform": "Switch",
    "date": "December 28, 2017",
    "description": "Join Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier by upgrading your robots with unique abilities, weapons – and even stylish hats!",
    "score": "91"
  },
  {
    "id": "8e6a0621-596c-4f8d-9b20-7a66211e0b82",
    "title": "Shovel Knight: Treasure Trove",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/2/8f0aa6ca9fc5eb75cf3077824bd5737c-98.jpg",
    "platform": "Switch",
    "date": "March 3, 2017",
    "description": "Shovel Knight: Treasure Trove is the full and complete edition of Shovel Knight, a sweeping classic action adventure game series with awesome gameplay, memorable characters, and an 8-bit retro aesthetic! Become Shovel Knight, wielder of the Shovel Blade, as he runs, jumps, and battles in a quest for his lost beloved. Take down the nefarious knights of the Order of No Quarter and their menacing leader, The Enchantress.\n\nBut that's not everything! Shovel Knight: Treasure Trove also features three additional campaigns that are games all unto themselves! Take control of Plague Knight, Specter Knight, and King Knight on adventures of their own! Together, they form a grand and sweeping saga!\n\nWith a fully cooperative campaign, a full-featured challenge mode, a 4 player battle mode, and body swap mode, you'll be digging for a long time. With Shovel Knight: Treasure Trove, you get it all. Uphold the virtues of Shovelry, earn relics and riches, and discover the true meaning of shovel justice!",
    "score": "91"
  },
  {
    "id": "70169069-7977-4a19-a4c9-f550f4e7ba80",
    "title": "Animal Crossing: New Horizons",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/5/3a9359329fd2b8b0022bc57246aca1c8-98.jpg",
    "platform": "Switch",
    "date": "March 20, 2020",
    "description": "If the hustle and bustle of modern life’s got you down, Tom Nook has a new business venture up his sleeve that he knows you’ll adore: the Nook Inc. Deserted Island Getaway Package. Sure, you’ve crossed paths with colorful characters near and far. Had a grand time as one of the city folk. May’ve even turned over a new leaf and dedicated yourself to public service. But deep down, isn’t there a part of you that longs for…freedom? Then perhaps a long walk on the beach of a deserted island, where a rich wealth of untouched nature awaits, is just what the doctor ordered. Peaceful creativity and charm await as you roll up your sleeves and make your new life whatever you want it to be. Collect resources and craft everything from creature comforts to handy tools. Embrace your green thumb as you interact with flowers and trees in new ways. Set up a homestead where the rules of what goes indoors and out no longer apply. Make friends with new arrivals, enjoy the seasons, pole-vault across rivers as you explore, and more.",
    "score": "90"
  },
  {
    "id": "be59c099-72d5-4daf-86bb-1062a305c352",
    "title": "Bastion",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/9/b7d5c23a22bc842bdcb97401649856a8-98.jpg",
    "platform": "Switch",
    "date": "September 13, 2018",
    "description": "Bastion is an original action role-playing game featuring a reactive narrator who marks your every move, lush hand-painted 2D artwork, and tight responsive gameplay that rewards playing with finesse. The game is designed to be simple to pick up and start playing, while offering a lot of rich choices around character customization as well as a deep story and gameworld you can lose yourself in.",
    "score": "90"
  },
  {
    "id": "e8c8d183-f88e-44d0-b54a-8af5230bcbf6",
    "title": "Hollow Knight",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/0/5b84d3dacaade3ecb031bb98abb8d703-98.jpg",
    "platform": "Switch",
    "date": "June 12, 2018",
    "description": "Hollow Knight is a 2D action-adventure game with an emphasis on traditional 2D animation and skillful gameplay. Journey to Hallownest, a vast and ancient underground kingdom inhabited by a bizarre collection of insects and monsters. Players will forge their own path as they explore ruined cities, forests of fungus, temples of bone and other fantastic lands, all on their way to uncovering an ancient mystery.",
    "score": "90"
  },
  {
    "id": "af50ea24-4660-4412-8e1d-277b6080ae59",
    "title": "Ori and the Blind Forest: Definitive Edition",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/5/2e1029f1b2168bde70a2821ad1059dcf-98.jpg",
    "platform": "Switch",
    "date": "September 27, 2019",
    "description": "Ori and the Blind Forest: Definitive Edition delivers a multitude of new areas, difficulty options, and gameplay upgrades that should appeal to both new and seasoned Ori players.",
    "score": "90"
  },
  {
    "id": "e4160448-5173-4203-a40d-558cc6fcd2d2",
    "title": "Bayonetta + Bayonetta 2",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/2/386b17c36a974513c0e2415d4f68422c-98.jpg",
    "platform": "Switch",
    "date": "February 16, 2018",
    "description": "The Witch is Back. The witching hour strikes again. Brimming with intricate battles that take place in, on and all over epic set pieces, Bayonetta 2 finds our sassy heroine battling angels and demons in unearthly beautiful HD. You're bound to love how it feels to string together combos with unimaginable weapons and to summon demons using Bayonetta's Wicked Weave in this frantic stylized action game. Bayonetta 2 is a Wii U exclusive. Bayonetta comes packed in with the purchase of every retail packaged version of Bayonetta 2.\n\nFeatures:\n-Initiate the new Umbran Climax technique to temporarily summon demons and boost Bayonetta's attack power and range whenever you fill her magic gauge.\n-Fight with new over-the-top weapons that open new possibilities to the way you battle, including the Kafka, a bow that shoots poisonous arrows; the Rakshasa, a pair of beautiful katana blades; and a giant rifle-inspired scythe known as the Chernobog.\n-Team up with a friend in Tag Climax, a two-player online co-op mode. Enjoy a little friendly competition by trying to deal the most damage as you work together to take down angels and demons.\n-In online quick matches, you can wager halos, the in-game currency that you earn by defeating enemies. You receive a large sum back if you can prove you're a better fighter than your partner. Halos can then be traded in a story mode shop to unlock new techniques, buy accessories and pick up alternate weapon variations.\n-Every chapter ends with a medal ranking: Stone, Bronze, Silver, Gold, Platinum or Pure Platinum. The more skilled you are, the higher your ranking.\n-This game is approachable for players of all levels, with settings of three difficulty levels. Through Touch Play, you can play with the GamePad stylus and touch screen, regardless of which difficulty you choose.",
    "score": "90"
  },
  {
    "id": "c05cab85-37dd-409f-8891-2d8144d51b33",
    "title": "Dead Cells",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/3/b02ca05bec07e5fa45eee36942fb6d22-98.jpg",
    "platform": "Switch",
    "date": "August 7, 2018",
    "description": "Dead Cells is a rogue-lite, metroidvania action-platformer. You'll explore a sprawling, everchanging castle... assuming you're able to fight your way past its keepers in 2D souls-lite combat. No checkpoints. Kill, die, learn, repeat. RogueVania: The progressive exploration of an interconnected world, with the replayability of a rogue-lite and the adrenaline pumping threat of permadeath. 2D Souls-lite Action: Tough but fair combat, more than fifty weapons and spells with unique gameplay, and of course, the emergency panic roll to get you out of trouble. Nonlinear progression: Sewers, Ossuary or Remparts? Once unlocked, special permanent abilities allow you to access new paths to reach your objective. Opt for the path that suits your current build, your play style or just your mood. Exploration: Secret rooms, hidden passages, charming landscapes. Take a moment to stroll the towers and breath in that fresh sea mist infused air...",
    "score": "89"
  },
  {
    "id": "c73132c2-eb05-4072-b44d-62626dac38c0",
    "title": "Into the Breach",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/8/68d21c1517de5b0bac067588a2a6a4ff-98.jpg",
    "platform": "Switch",
    "date": "August 28, 2018",
    "description": "Control powerful mechs from the future to defeat an alien threat. Each attempt to save the world presents a new randomly generated challenge in this turn-based strategy game.",
    "score": "89"
  },
  {
    "id": "f91504ad-8cfc-4489-8834-2894c80e8b77",
    "title": "Xenoblade Chronicles: Definitive Edition",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/4/d44b7f8ad0f84de2d0694370170661a8-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2020",
    "description": "Join the fight between man and machine in the definitive edition of this critically-acclaimed RPG. Discover the origins of Shulk as he and his companions clash against a seemingly-unstoppable mechanical menace. Wield a future-seeing blade, chain together attacks, and carefully position your party members in strategic, real-time combat as you journey across a massive world. During an attack from the mechanical invaders known as the Mechon, Shulk discovers that he can tap into the full power of a mysterious blade known as the Monado. With the mighty Monado in hand, Shulk sets out to defeat the Mechon once and for all. In addition to the Mechon, you’ll run into wildlife that ranges from docile to deadly. Keep an eye on what attracts monsters’ attention to avoid unwanted conflict…or try your hand at bringing down an ultra-powerful Unique Monster. Upgrade your party as you progress through the adventure by selecting equipment, enhancing weapon skills, and using benefit-granting gems. Put your dependable companions to work by filling the party gauge to trigger a Chain Attack and attack enemies in quick succession.",
    "score": "89"
  },
  {
    "id": "637b2962-86ed-4b00-b8f9-1f919bcdf4ae",
    "title": "Fire Emblem: Three Houses",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/6/4aad95030d9871fd9bbcdda73056a407-98.jpg",
    "platform": "Switch",
    "date": "July 26, 2019",
    "description": "War is coming to the continent of Fódlan. Here, order is maintained by the Church of Seiros, which hosts the prestigious Officer's Academy within its headquarters. You are invited to teach one of its three mighty houses, each comprised of students brimming with personality and represented by a royal from one of three territories. As their professor, you must lead your students in their academic lives and in turn-based, tactical RPG battles wrought with strategic, new twists to overcome. Which house, and which path, will you choose?",
    "score": "89"
  },
  {
    "id": "90720d30-7005-4c23-a7ae-ffefe8721c9f",
    "title": "Okami HD",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/3/2c53d63d8d42a4dc74fd09e420e08940-98.jpg",
    "platform": "Switch",
    "date": "August 9, 2018",
    "description": "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.",
    "score": "89"
  },
  {
    "id": "e7bb2cd3-33e4-4e0e-91cb-fe8615541af2",
    "title": "Hyper Light Drifter",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/1/91e68ee1f4223c7c93696b83c50827c3-98.jpg",
    "platform": "Switch",
    "date": "September 6, 2018",
    "description": "Echoes of a dark and violent past resonate throughout a savage land, steeped in treasure and blood. Hyper Light Drifter is an action adventure RPG in the vein of the best 16bit classics, with modernized mechanics and designs on a much grander scale.\n\nDrifters of this world are the collectors of forgotten knowledge, lost technologies and broken histories. Our Drifter is haunted by an insatiable illness, traveling further into the lands of Buried Time, hoping to discover a way to quiet the vicious disease.",
    "score": "88"
  },
  {
    "id": "6891f1a3-ff76-4e93-b33f-c45186b59a9c",
    "title": "What Remains of Edith Finch",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/4/7a05e6223f58c435d10d63a149e62866-98.jpg",
    "platform": "Switch",
    "date": "July 4, 2019",
    "description": "What Remains of Edith Finch is a collection of short stories about a cursed family in Washington State.",
    "score": "88"
  },
  {
    "id": "8e06498a-4733-4ceb-b3a2-d13a588142f4",
    "title": "Super Mario Maker 2",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/6/2103339464eea1e0229343b0540b0d6d-98.jpg",
    "platform": "Switch",
    "date": "June 28, 2019",
    "description": "Mario fans of the world, unite! Now you can play, create, and share the side-scrolling Super Mario courses of your dreams in the Super Mario Maker 2 game, available exclusively on the Nintendo Switch™ system! Dive into the single-player Story Mode and play built-in courses to rebuild Princess Peach’s castle. Make your own courses, alone or together. And with a Nintendo Switch Online membership*, share your courses, access a near-endless supply made by others, enjoy online multiplayer, and more. A new side-scrolling Mario adventure that unleashes the creative potential of Super Mario Maker 2 awaits in Story Mode, which contains over 100 built-in courses. And in Course Maker, a wide range of parts, tools, and more are available so you can construct your own courses. Want coin-shooting cannons? Bowser riding on a giant Goomba? Cat Mario sliding down slopes to take out an army of baddies? Go for it! You call the shots. Pass a Joy-Con controller to a partner to build cooperatively on a single system.",
    "score": "88"
  },
  {
    "id": "f73a2535-f07e-4aa8-9e02-cdf0962b6911",
    "title": "Downwell",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/6/7d3d32a57d8c28ef5bdcffcba9c34a97-98.jpg",
    "platform": "Switch",
    "date": "January 31, 2019",
    "description": "Downwell is a curious game about a young person venturing down a well in search of untold treasures with only his Gunboots for protection. Make your way further and further down into the darkness filled with nasty creatures and mysterious secrets to collect the spectacular red gems scattered about the rocks. Step into precariously placed shops and buy some helpful items or level up between levels to battle well-dwelling monsters and uncover hidden caves filled with riches and relics. No two trips down the well are ever the same.",
    "score": "88"
  },
  {
    "id": "9fe2f119-7739-40f1-99eb-3b697e092776",
    "title": "Diablo III: Eternal Collection",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/7/211623aa5a884c47a91be3c3c13f9851-98.jpg",
    "platform": "Switch",
    "date": "November 2, 2018",
    "description": "Generations of gamers have battled the demonic hordes of Diablo, and now it's your turn to take part in the action-RPG legacy. This Eternal Collection features Diablo III, the Reaper of Souls expansion set and the Rise of the Necromancer packall together in one definitive volume. Prepare yourself, mortal hero. The hellgates are opening.",
    "score": "88"
  },
  {
    "id": "45b2a581-d7ba-48cb-9cc6-8c16fdb428ad",
    "title": "SteamWorld Dig 2",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/5/e523dd194bc3c7a9b97e4ab240b144d5-98.jpg",
    "platform": "Switch",
    "date": "September 21, 2017",
    "description": "Grab your pickaxe and dig into the sequel to SteamWorld Dig. A platform mining adventure forged in Metroidvania flames. In search of her lost friend, a lone steambot and her unlikely companion must dig deep, gain riches and explore an underworld riddled with danger. But time is running short... [Nintendo]",
    "score": "88"
  },
  {
    "id": "f5614cbd-bc3e-46ab-b060-f1578c598ba2",
    "title": "Ikaruga",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/3/37cccee2d512feb81d85f47f79c22339-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2018",
    "description": "A rebel pilot named Shinra must battle an enemy nation using a specially-designed fighter called the Ikaruga, which can switch between two energy polarities (black or white) at the touch of a button. Bullets that are the same color as Shinra's ship can be absorbed, while the opposite color will do damage - this polarity-switching mechanic is the game's core feature and the foundation for its stage and enemy design. It's now up to Shinra makes his final stand, as the Ikaruga might be the rebel federation's last chance to defeat the oppressive Horai regime.",
    "score": "88"
  },
  {
    "id": "02caac1f-a9a4-4309-911f-2c6ca66850ef",
    "title": "Cave Story +",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/8/7d7e067d8806cff5c9d10c1938fd725f-98.jpg",
    "platform": "Switch",
    "date": "June 20, 2017",
    "description": "Cave Story takes you into a rare world where a curious race of innocent, rabbit-like creatures called Mimiga run free. You wake up in a dark cave with no memory of who you are, where you came from or why you're in such a place. Uncovering Mimiga Village, you discover that the once-carefree Mimiga are in danger at the hands of a maniacal scientist. Their only hope rests squarely on the shoulders of a quiet, amnesiac boy who can't remember his own name. Take control, learn the origins of this world's power, stop the delusional villain and save the Mimiga.",
    "score": "88"
  },
  {
    "id": "4a50c634-2bc5-4b4c-be4e-4358b5581fca",
    "title": "Spiritfarer",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/6/708b1e0546ef7bee71d14fd61c115656-98.jpg",
    "platform": "Switch",
    "date": "August 18, 2020",
    "description": "A cozy management game about dying. \n\nWhat will you leave behind?\nPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \n\nA unique, endlessly varied adventure!\nFarm, mine, fish, harvest, cook, and craft your way across mystical seas. Unwind for hours into cozy and relaxing gameplay. Join the adventure as Daffodil the cat, in two-player cooperative play.\n\nLearn how to say goodbye.\nExperience moving, emotional stories filled with unforgettable moments. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?",
    "score": "88"
  },
  {
    "id": "9d90b314-0290-426a-b569-c74ed4142979",
    "title": "A Short Hike",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/9/2bce32debd624728e4ac46e1e6c75ff7-98.jpg",
    "platform": "Switch",
    "date": "August 18, 2020",
    "description": "Follow the marked trails or explore the backcountry as you make your way to the summit. Along the way, meet other hikers, discover hidden treasures, and take in the world around you. Explore the island any way you like. Choose your own path to follow and see where it leads you. You never know what you might stumble into!\n    Hike at your own pace - there's no need to rush to the summit! Take your time fishing along the river banks or swimming by the lakeshore.\n    Collect hidden treasures to reach new heights. Try taking a dive off the mountain peaks to soar above the forests.\n    Chat with the other hikers you meet along your route. You might be able to help each other out!\n    Listen to a lush original soundtrack by Mark Sparling that progresses dynamically as you explore the wilderness.",
    "score": "88"
  },
  {
    "id": "bd22e22b-c68c-49ce-bfd2-de4408c601cc",
    "title": "Stardew Valley",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/7/0fbec193c10fa4848c8b6027a0ee6235-98.jpg",
    "platform": "Switch",
    "date": "October 5, 2017",
    "description": "You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness.",
    "score": "87"
  },
  {
    "id": "ca9c0c4e-26dd-4e38-a446-19ea62a289b1",
    "title": "Cuphead",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/6/ff10db91dc7f90f6a6accdf30417f17b-98.jpg",
    "platform": "Switch",
    "date": "April 17, 2019",
    "description": "Cuphead is a classic run and gun action game heavily focused on boss battles. Inspired by cartoons of the 1930s, the visuals and audio are painstakingly created with the same techniques of the era, i.e. traditional hand drawn cel animation, watercolor backgrounds, and original jazz recordings.\nPlay as Cuphead or Mugman (in single player or local co-op) as you traverse strange worlds, acquire new weapons, learn powerful super moves, and discover hidden secrets while you try and pay your debt back to the devil!",
    "score": "87"
  },
  {
    "id": "508591c8-1025-44b2-a8f6-086faa4d0ca4",
    "title": "Astral Chain",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/9/8c2eaef143968e1ef036e7e0d95cd856-98.jpg",
    "platform": "Switch",
    "date": "August 30, 2019",
    "description": "As part of a police special task force, it’s up to you to fight against mysterious, alien-like creatures who have invaded the world.  In the Ark, a multi-cultural city in the near future, disaster strikes when gates to another dimension suddenly appear! Dangerous creatures begin to emerge, attacking the people and polluting the land, and normal police forces are unable to compete with them. To stand up against these threats, a brand new, special police unit known as Neuron is formed. Choose between two playable characters – one male, one female – on your adventure. The character you don’t choose also appears as your younger twin, and a fellow member of Neuron.  In order to resist the creatures, humanity developed a special weapon: the Legion. The Legion acts as your partner, and helps with your investigations. However, it’s in battle where the Legion shows its real ability...",
    "score": "87"
  },
  {
    "id": "ee3abdac-a046-4601-8979-b24edcb1b90d",
    "title": "Dragon Ball FighterZ",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/0/6c9cc301c257ee591029186806423bd9-98.jpg",
    "platform": "Switch",
    "date": "September 28, 2018",
    "description": "After the success of the Xenoverse series, its time to introduce a new classic 2D DRAGON BALL fighting game for this generations consoles. DRAGON BALL FighterZ is born from what makes the DRAGON BALL series so loved and famous: endless spectacular fights with its allpowerful fighters. Partnering with Arc System Works, DRAGON BALL FighterZ maximizes high end Anime graphics and brings easy to learn but difficult to master fighting gameplay to audiences worldwide. \n\nKey Features:\n\n* 3vs3 TAG/SUPPORT\nAllows players to train and master more than one fighter/style which brings deeper gameplay\n\n* HIGH-END ANIME GRAPHICS\nUsing the power of the Unreal engine and the talented team at Arc System Works, DRAGON BALL FighterZ is a visual tour-de-force \n\n* SPECTACULAR FIGHTS\nExperience aerial combos, destructible stages, famous scenes from the DRAGON BALL anime reproduced in 60FPS and 1080p resolution (Higher resolution will be supported on PS4 Pro and Xbox Scorpio)",
    "score": "87"
  },
  {
    "id": "362b76e0-6edb-4abd-9d0c-cbe78f82a7bf",
    "title": "Guacamelee! 2",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/0/5c8e7d712d2dc5821d5e2c4bf4d78c03-98.jpg",
    "platform": "Switch",
    "date": "December 10, 2018",
    "description": "Brawling has never been more beautiful! The long-awaited sequel to the smash hit action-platformer is here: Guacamelee! 2 brings luchador Juan Aguacate out of retirement for a stunning new Metroidvania-style adventure, where he must face his greatest challenge yet - one that threatens to tear apart the very fabric of the Mexiverse!\n\nExplore a huge, hand-crafted world inspired by Mexican culture and folklore, filled with sassy new villains and weirdos (and a few old friends!). Learn a deep repertoire of bone-crunching wrestling moves to fend off the skeletal hordes and overcome skillful platforming challenges... and who said anything about a Chicken Illuminati? Certainly not us!\n\nCheck out these features:\n\n* An epic adventure spanning time and space, featuring drop-in 4-player local co-op for you and your best amigos!\n* A brand new upgrade system: discover \"trainers\" around the world, defeat their challenges, and develop your skill sets for movement, combat, and more!\n* A vibrant, colorful adventure that takes you from the Mangrove Swamp to Hell itself, featuring twice as many enemy types as the first game and a roster of eccentric new bosses!\n* An absolutely fuego electro-Mexican soundtrack, and more gorgeous visuals than ever thanks to a fancy new rendering engine!\n* Definitely no secret society of chickens that teaches you ancient chicken abilities previously lost to the ages!",
    "score": "87"
  },
  {
    "id": "f63d83f7-fc6d-4938-a852-44370903bb32",
    "title": "Enter the Gungeon",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/3/163de0cd93062dc341da7bad56bfe1de-98.jpg",
    "platform": "Switch",
    "date": "December 14, 2017",
    "description": "Enter the Gungeon is a gunfight dungeon crawler following a band of misfits seeking to shoot, loot, dodge roll and table-flip their way to personal absolution by reaching the legendary Gungeon’s ultimate treasure: the gun that can kill the past.",
    "score": "87"
  },
  {
    "id": "01b11d5c-c69c-42e9-a6f0-b19bb861b4bc",
    "title": "The Legend of Zelda: Link's Awakening",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/0/4be9f81bf6aefa2aa81865ff1b309358-98.jpg",
    "platform": "Switch",
    "date": "September 20, 2019",
    "description": "[*Reviews will go up on September 19 at 5am Pacific] 26 years after its original release on Game Boy, The Legend of Zelda: Link's Awakening will be reborn as a new experience on Nintendo Switch. Buffeted by a storm, Link washes ashore on the mysterious Koholint Island. In order to return home, Link must overcome challenging dungeons and battle against fearsome monsters. This new version of the classic adventure includes many unique elements that appeared in the original Game Boy release, such as 2D platformer-style rooms and appearances from characters outside of The Legend of Zelda series.",
    "score": "87"
  },
  {
    "id": "4b63da0d-55ee-4cc8-ab88-a69e83e0a903",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/6/c9fbfb8b99c42e59a92c44c0ff2d82e0-98.jpg",
    "platform": "Switch",
    "date": "January 28, 2020",
    "description": "Kentucky Route Zero is a magical realist adventure game about a secret highway in the caves beneath Kentucky. An antique furniture delivery man trying to make his small shop's last delivery gets lost along the way and meets a haunted TV repairwoman, a young boy and his giant eagle brother, a pair of robot musicians, and dozens of other characters. Together, they explore the nocturnal highways and country roads of Kentucky, the storied Echo River by ferry, and the mysterious Route Zero, the secret highway that runs through Mammoth Cave.",
    "score": "87"
  },
  {
    "id": "557974a1-03b4-49f4-91ad-5dad1e043b61",
    "title": "Super Mega Baseball 3",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/2/f72fb2c81962daefabcdcfd2c6fe9102-98.jpg",
    "platform": "Switch",
    "date": "May 13, 2020",
    "description": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. Super Mega Baseball 3 features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits.",
    "score": "87"
  },
  {
    "id": "19e1360e-c23b-432f-a246-89f190556b2a",
    "title": "Axiom Verge",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/2/9757b92e1404f7311b6274b39e1a461f-98.jpg",
    "platform": "Switch",
    "date": "October 5, 2017",
    "description": "Life. Afterlife. Real. Virtual. Dream. Nightmare. It's a thin line.\n\nThis is the action-adventure you've been waiting decades for. After a lab accident, a scientist awakens in a mysterious, alien world. Is this a distant planet? The far future? Or a complex virtual-reality computer simulation?\n\nPlumb the recesses of a large, labyrinthine world in order to learn its secrets and uncover your role within it.\n\nDiscover tons of weapons, items, and abilities, each with their own unique behaviors and usage. You'll need your wits to find them all.\n\nCombat bizarre biomechanoid constructs, the deadly fallout of an ancient war, and the demons of your own psyche.\n\nAnd finally, break the game itself by using glitches to corrupt foes and solve puzzles in the environment.\n\nLife. Afterlife. Real. Virtual. Dream. Nightmare. It's a thin line.\n\nIt's Axiom Verge.",
    "score": "87"
  },
  {
    "id": "14032bbd-e9c5-4200-911a-3205166e7f1b",
    "title": "Katamari Damacy REROLL",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/2/d59cecfc1c20f4ff094c45450c2d2339-98.jpg",
    "platform": "Switch",
    "date": "December 7, 2018",
    "description": "The stop-at-nothing pushing prince is back and ready to reroll. When the King of All Cosmos accidentally destroys all the stars in the sky, he orders you, his pint-sized princely son, to put the twinkle back in the heavens above. Join the King and Prince of Cosmos on their wacky adventure to restore the stars at home or on the go – now in full HD.",
    "score": "87"
  },
  {
    "id": "eeba17df-5b67-4085-adce-2f44a24f5276",
    "title": "Owlboy",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/0/82102b7e0667aba6f1a5a068f3898053-98.jpg",
    "platform": "Switch",
    "date": "February 13, 2018",
    "description": "Owlboy is a vertical platform adventure set in the sky, where the islands of the world have been spread apart after a great calamity. You play as Otus, among the last of the Owls, a renowned race that has produced many of the world's great wonders",
    "score": "87"
  },
  {
    "id": "eaeebc7a-f916-41f5-9739-b3044fb43474",
    "title": "Velocity 2X",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/2/e1d944936f41d328f4cca921d736941d-98.jpg",
    "platform": "Switch",
    "date": "September 20, 2018",
    "description": "Velocity 2X is the highly anticipated sequel to Velocity Ultra that features amazing puzzle-platforming action alongside award-winning top-down shoot em-up gameplay!\n\nEngage the Quarp Drive teleport to outsmart the enemy in race-tuned space combat, then dock your ship, jump out and run around on foot to infiltrate enemy bases. Once youve disabled internal defences, jump back into the Quarp Jet and continue your mission!\n\nVelocity 2X takes the same approach to great gameplay design that made Velocity Ultra so much fun, and applies it to a puzzle-platforming adventure too, making Velocity 2X twice the twitchy fun!",
    "score": "87"
  },
  {
    "id": "d7d0d151-d9bb-4eb9-ae8f-1b773b1b5675",
    "title": "Iconoclasts",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/2/de854580425cd1cefa34bfa06f17d13c-98.jpg",
    "platform": "Switch",
    "date": "August 2, 2018",
    "description": "Robin just wants to be a mechanic and help people, but without a license she's a sinner in Mother's eyes. Ever since picking up her wrench, the world has been going nuts and she's wanted to bolt it back together. Now Penance is raining down on everyone she loves and One Concern agents are after her.\n\nBut something big is going on bigger than droughts of Ivory fuel and personal conflicts and Robin's in the thick of it.\n\n* Hours of nut-twisting platform action-adventure\n* Numerous densely detailed locations filled with fine-tuned action and puzzles\n* 20+ gear-grinding, screen-filling boss battles stand in your way\n* Three game-changing difficulty settings supported by a unique tweak system\n* A heart-wrenching epic can one mechanic fix the whole world?\n\nIconoclasts is the masterwork of indie developer Joakim Sandberg, seven long years in the making. Iconoclasts delivers awesome action, hilarious hijinks and an emotional rollercoaster of deeply personal storytelling.",
    "score": "87"
  },
  {
    "id": "3cd462d2-0042-4f46-b357-8ad416d2e107",
    "title": "Rocket League",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/1/0d3ced047044dbf626dee57536d555d8-98.jpg",
    "platform": "Switch",
    "date": "November 14, 2017",
    "description": "Rocket League is a high-powered hybrid of arcade soccer and driving with rewarding physics-based gameplay. Take to the pitch for a fully-featured offline season mode, multiple game types, casual and competitive online matches, and special \"Mutators\" that let you change the rules entirely. Express yourself with one of the deepest customization systems around and battle opponents on other platforms with cross-network play.",
    "score": "86"
  },
  {
    "id": "31d66bdf-636d-45c7-b10b-382a9585f8de",
    "title": "The Messenger",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/0/0699e5b6b4ec177412b51482e424acf6-98.jpg",
    "platform": "Switch",
    "date": "August 30, 2018",
    "description": "As a demon army besieges his village, a young ninja ventures through a cursed world, to deliver a scroll paramount to his clan’s survival. What begins as a classic action platformer soon unravels into an expansive time-traveling adventure full of thrills, surprises, and humor.",
    "score": "86"
  },
  {
    "id": "49cfa19c-8635-404f-8813-ca5ee2520a13",
    "title": "Huntdown",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/9/9800846ccbb7d92c64a6840b5432e938-98.jpg",
    "platform": "Switch",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "86"
  },
  {
    "id": "b0b2386d-6ace-42df-9918-25b00b13f858",
    "title": "Streets of Rage 4",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/4/a35a4da391146e66621f989f7ec02074-98.jpg",
    "platform": "Switch",
    "date": "April 30, 2020",
    "description": "Amongst the best beat’em up series ever created, jammin’ ‘90s beats and over the top street beating, the iconic series Streets of Rage comes back with a masterful tribute to and revitalization of the classic action fans adore.\n\nThe all-time classic Streets of Rage, known as Bare Knuckle (ベア・ナックル Bea Nakkuru) in Japan, is a beat ‘em up series known for this timeless gameplay and electronic dance influenced music. Streets of Rage 4 builds upon the classic trilogy’s gameplay with new mechanics, beautiful hand-drawn visuals and a God tier soundtrack.\n\nTeam up with iconic and brand-new characters\n\nStreets of Rage 4 got its iconic characters back: Axel, Blaze, and Adam teaming up with new brother and sister in arms Floyd Iraia and Cherry Hunter. With some brand-new moves and kickass tracks to take a listen, our heroes are ready to dish out beatdowns to a fledgling group of ill-advised criminals in full force.",
    "score": "86"
  },
  {
    "id": "b3d65b6f-d41c-4a5d-90e6-131e2b85e17e",
    "title": "Donkey Kong Country: Tropical Freeze",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/4/7e2f60080d753a3315b5ae51ad1f949d-98.jpg",
    "platform": "Switch",
    "date": "May 4, 2018",
    "description": "Help Donkey Kong and his friends get back their home from Vikings in the Donkey Kong Country: Tropical Freeze game from Retro Studios. All the challenging ground-pounding, barrel-blasting and mine cart action from the Donkey Kong Country series is back, along with a bushel of new game-play elements and features.",
    "score": "86"
  },
  {
    "id": "ab0c4d31-ed76-4616-aed1-5d679c1ab1da",
    "title": "Monster Boy and the Cursed Kingdom",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/4/2365740177f853c723d32c70f46608dd-98.jpg",
    "platform": "Switch",
    "date": "December 4, 2018",
    "description": "A legendary game series returns with an all-new adventure and in HD/ Monster Boy is a colorful side-scrolling action adventure created in cooperation with Ryuichi Nishizawa, the creator of the famous Wonder Boy in Monster World series.\n\nMonster Boy is being created to bring back the enjoyment of the classic games that shine by simplicity. Exciting gameplay, upbeat music and smooth graphics. You'll need to overcome huge bosses, find hidden passages, discover powerful equipment and use all your wits and skills to remove a powerful curse.\n\nTransform into 6 different creatures, each with their own skills and abilities. Take advantage of all the unique powers to open new paths and advance in an epic story.\n\nWe put all our passion into Monster Boy to create a truly enjoyable love letter to gaming from the 80's and 90's - will you join us and celebrate together with us?\n\nFeatures:\n\n* Switch between up to 6 playable characters: Each character feels different and all of them keep the gameplay fresh and exciting.\n* Unlock new paths and secrets with special equipment: Look for magic weapons and equipment that gradually open up the world.\n* Over 15 hours of epic adventure: Explore the new 'Monster World' in a huge interconnected environment.\n* Soundtrack from Japanese superstar composers: Yuzo Koshiro, Motoi Sakuraba, Michiru Yamane, Keiki Kobayashi and Takeshi Yanagawa\n* Full HD graphics at 60 frames per second: The game supports 1080p/60fps (docked) and 720p/60fps (portable mode)\n* HD Rumble support: Feel the action with high performance HD Rumble support",
    "score": "86"
  },
  {
    "id": "4faaede3-3690-45e4-a722-6245968bdb57",
    "title": "Transistor",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/2/3d21781525254f5e95cf6cc7c5af58b6-98.jpg",
    "platform": "Switch",
    "date": "November 1, 2018",
    "description": "Wield an extraordinary weapon of unknown origin in this sci-fi themed action role-playing game from the creators of Bastion.\n\nFight through a stunning futuristic city\n\nThe game seamlessly integrates thoughtful strategic planning into a fast-paced action experience, combining responsive gameplay and rich atmospheric storytelling.\n\nDuring the course of the adventure, you will piece together the Transistor's mysteries as you pursue its former owners.",
    "score": "86"
  },
  {
    "id": "23de5963-8a7f-473d-b373-d7da51e7eb7f",
    "title": "Minecraft: Switch Edition",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/7/49d553990488e666f576cc0b11906ed4-98.jpg",
    "platform": "Switch",
    "date": "May 11, 2017",
    "description": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes.",
    "score": "86"
  },
  {
    "id": "771a627f-08a3-446e-9495-aa9c3ba2bf67",
    "title": "Shantae and the Pirate's Curse",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/0/f5c83f2aea42d110b6c10877063f142f-98.jpg",
    "platform": "Switch",
    "date": "March 20, 2018",
    "description": "Embark on a brand new adventure which teams Shantae with her arch nemesis, Risky Boots! When a curse falls upon Sequin Land, Risky Boots and Shantae must join forces to battle unimaginable evil. Shantae must give up her job as Scuttle Towns \"Guardian Genie\" and become a pirate if she hopes to get her magic back and save the day. As a pirate, Shantae gains new weapons and tools to advance her quest and power through monsters!\n\n*    Flintlock Pistol (blast enemies and switches from afar)\n*    Pirate Hat (glide on the wind using this enormous headwear)\n*    Risky's Boots (run at super speeds! Chain your attacks as you dash through enemies & over lava)\n*    Cannon (blast yourself into the air on a belch of black powder)\n\nCore Gameplay Components:\n\n*    Whipping! Destroy monsters, topple bosses, and solve puzzles with your hair\n*    Platforming! Run and jump through deviously designed levels\n*    Exploring! Navigate a world of interconnected levels and Labyrinths\n*    Belly Dancing! Dance with your Magic Lamp to suck up magic and items\n*    Customizing! Earn new abilities, unlock stat-boosting artifacts, magic & costumes\n*    Storytelling! Flirtatious characters and wonderfully off-beat humor",
    "score": "86"
  },
  {
    "id": "fa83f2d5-f346-41d9-9479-5a1eb52e8fac",
    "title": "Guacamelee! Super Turbo Championship Edition",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/1/e4be0f16f6fe17db0c40f110ebff87c7-98.jpg",
    "platform": "Switch",
    "date": "October 8, 2018",
    "description": "Evil chose the wrong day to double-dip.\n\nCarlos Calaca has kidnapped El Presidente's Daughter, and he plans to sacrifice her in order to merge the World of the Living with the World of the Dead.\n\nJuan Aguacate, an agave farmer who stumbles upon a Legendary Luchador mask, must find the strength and courage to become the Hero he's always dreamed of being and put a stop to this.\n\nGuacamelee! STCE is a Metroidvania-style action-platformer set in a magical world inspired by traditional Mexican culture and folklore.\n\nThe game features melee combat, parallel dimensions and same-screen co-op. The Super Turbo Championship Edition also includes extra abilities, new level content and enhanced graphics. Also chickens.",
    "score": "86"
  },
  {
    "id": "08c8f38a-37e1-4872-a241-497a36cc36ee",
    "title": "Star Wars Pinball",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/5/c67cec310add94160f0a69cc265e9615-98.jpg",
    "platform": "Switch",
    "date": "September 13, 2019",
    "description": "May the Force be with you! Use the Force to guide the silver ball! Will you choose the Light or Dark side?\n\nFeel the power of the Force in Star Wars Pinball! Set in a galaxy far, far away, each of the tables in this brand new pack lets you interact with the most iconic characters, and relive the greatest moments of the Star Wars universe: Star Wars: Episode V The Empire Strikes Back, Star Wars: The Clone Wars, and Boba Fett. May the Force be with you!\n\nInfluence the Balance of the Force! Join either the Light Side or Dark Side and take part in the epic struggle by simply posting scores for your chosen side!\n\nFull list of features:\n-Three brand new tables: Star Wars: Episode V The Empire Strikes Back, Boba Fett, and The Clone Wars\n-Compete against other players to achieve the highest ForceScore, and team up with your friends to increase your TeamScore\n-Hotseat multiplayer mode\n-New tables released regularly through the Nintendo eShop",
    "score": "86"
  },
  {
    "id": "718953ee-35a3-4e2b-92b6-4711caf1149b",
    "title": "AI: The Somnium Files",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/2/4f1a275fc753c7d629c8c8ce696a9578-98.jpg",
    "platform": "Switch",
    "date": "September 17, 2019",
    "description": "One rainy night in November, a woman's body is found\nat an abandoned theme park, mounted on a\nmerry-go-round horse. She had been stabbed\nrepeatedly, and her left eye was gouged out.\n\nKaname Date of the Metropolitan Police Department\narrives on the scene. He recognizes the woman.\nSuddenly, a crash rings out through the rain...\n\nAI: THE SOMNIUM FILES chronicles an investigation\nthrough both dreams and reality.\nA thrilling neo-noir detective adventure following\nDate and his partner is about to unfold.",
    "score": "86"
  },
  {
    "id": "5f46e114-1e3c-4688-8908-970c19130d16",
    "title": "Sid Meier's Civilization VI",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/8/5aaa34faef5256387067a75572b04e80-98.jpg",
    "platform": "Switch",
    "date": "November 16, 2018",
    "description": "Civilization VI offers new ways to interact with your world, expand your empire across the map, advance your culture, and compete against historys greatest leaders to build a civilization that will stand the test of time. Play as one of 24 different leaders from various countries around the world and throughout history. Build an empire of lucrative trade routes with Cleopatra of Egypt, flex the military might of your legions with Trajan of Rome, or develop a powerhouse of culture with Hojo Tokimune of Japan. Each of the leaders can be played any way you prefer, with unique abilities, units, and infrastructure in their quest for victory.",
    "score": "86"
  },
  {
    "id": "22638423-c903-4a88-be7f-0799068c8db4",
    "title": "Crypt of the NecroDancer: Nintendo Switch Edition",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/2/1db04c6098edd813b7ef3e28d2e6cbf2-98.jpg",
    "platform": "Switch",
    "date": "February 1, 2018",
    "description": "Crypt of the NecroDancer is a hardcore rhythm-based roguelike game. Can you survive this deadly dungeon of dance, slay the NecroDancer, and recapture your still beating heart? Or will you be a slave to the rhythm for all eternity? Players must move on the beat to navigate procedurally generated dungeons while battling dancing skeletons, zombies, dragons, and more! Groove with the game's epic dance soundtrack, or select songs from your own MP3 collection! You can even play with a dance pad to really shake your bones!",
    "score": "86"
  },
  {
    "id": "90235cd5-8750-4ddf-bcae-2340e1e53cb2",
    "title": "Warframe",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/9/b61df101341abcd6198d3679f09af6cf-98.jpg",
    "platform": "Switch",
    "date": "November 20, 2018",
    "description": "They were called Tenno. Warriors of blade and gun: masters of the Warframe armor. Those that survived the old war were left drifting among the ruins. Now they are needed once more. The Grineer, with their vast armies, are spreading throughout the solar system. A call echoes across the stars summoning the Tenno to an ancient place. They summon you. Allow the Lotus to guide you. She has rescued you from your cryostasis chamber and given you a chance to survive. The Grineer will find you; you must be prepared. The Lotus will teach you the ways of the Warframes and the secrets to unlocking their powers. Come Tenno, you must join the war.",
    "score": "86"
  },
  {
    "id": "838ab054-c8ae-405c-a4b5-b86ebe3abed6",
    "title": "Luigi's Mansion 3",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/8/ca97c87d3945aae2a8b7ddb2742b0639-98.jpg",
    "platform": "Switch",
    "date": "October 31, 2019",
    "description": "Luigi embarks on a dream vacation with Mario and friends upon receiving an invitation to a luxurious hotel. However, his dream quickly becomes a nightmare when King Boo reveals everything had been a ploy to capture Mario and friends. With the assistance of Professor E. Gadd once again, the reluctant and cowardly hero Luigi traverses up and down treacherous floors of the now-ominous hotel on a quest to save them. Wield the upgraded Poltergust G-00 to slam and blow away the ghosts’ defenses, or summon Gooigi, an all-green doppelganger that can help Luigi overcome obstacles he can’t get past alone. Interchange between Luigi and Gooigi as one player, or grab a friend and control one each. For more frenetic multiplayer action, race the timer to clear various objectives on a series of floors in ScareScraper mode. ScareScraper mode can be played online* or locally with up to eight players on four Nintendo Switch systems (additional games required; sold separately).",
    "score": "86"
  },
  {
    "id": "1b1ed364-9c9d-4761-9081-d7f07bc8ba94",
    "title": "Assault Android Cactus+",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/0/1b44bb029054c51712c063ad1f200116-98.jpg",
    "platform": "Switch",
    "date": "March 8, 2019",
    "description": "Experience an arcade style twin stick shooter set in a vivid sci fi universe. Junior Constable Cactus is outside her pay grade when she responds to a distress call and ends up stranded on a crippled space freighter under attack by its own robot workers. With a draining battery mechanic instead of lives, Assault Android Cactus+ challenges you to think fast and shoot faster. Charge head first into an army of refitted robots, transforming stages and massive boss showdowns.",
    "score": "86"
  },
  {
    "id": "993d827e-459d-4598-878b-12f886bb8b3e",
    "title": "BlazBlue: Central Fiction - Special Edition",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/4/3cf5160b5038da2d9bc376d9cb11c7b8-98.jpg",
    "platform": "Switch",
    "date": "February 7, 2019",
    "description": "BlazBlue: Central Fiction is the newest installment in the storied BlazBlue franchise and stands alone as the pinnacle of next gen 2D fighters! Like a well-timed 2D punch, BlazBlue: Central Fiction bashes massive amounts of content and innovation into one slick title that hits hard and keeps the pummeling steady! Prepare yourself for a brand new story, new characters, levels, modes, system mechanics and more! Choose from over 33 unimaginable fighters as you battle for 2D supremacy!",
    "score": "86"
  },
  {
    "id": "1df551f4-cee5-4132-bf91-cf9e37b2b1af",
    "title": "Sonic Mania",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/9/cbf429c726c4df87893d49fba45a5834-98.jpg",
    "platform": "Switch",
    "date": "August 15, 2017",
    "description": "Sonic Mania brings fans back into the 2D world of platform games with nostalgic pixel-style art and core \"classic\" gameplay by reimagining iconic Zones and Acts from Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic CD and Sonic The Hedgehog 3 and Knuckles, and adding in completely new Zones with all-new Acts and boss fights into the mix. [Nintendo]",
    "score": "86"
  },
  {
    "id": "da17b6d8-9394-47e1-82c5-a422b0427883",
    "title": "Mini Metro",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/9/8a8d133c3f38065e47c0126516ddecf2-98.jpg",
    "platform": "Switch",
    "date": "August 30, 2018",
    "description": "",
    "score": "86"
  },
  {
    "id": "3a6a2c19-4938-4af0-a4ab-fbee7a0f266d",
    "title": "Cadence of Hyrule: Crypt of the NecroDancer Featuring The Legend of Zelda",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/1/04b9af7d38d2c8120fabbeb2ecb3e16f-98.jpg",
    "platform": "Switch",
    "date": "June 13, 2019",
    "description": "In the latest rhythmic action-adventure from Brace Yourself Games, you can enjoy the gameplay of Crypt of the Necrodancer in the setting of The Legend of Zelda series. As Linkor even as Princess Zeldayou'll explore the randomly generated overworld and dungeons on a quest to save Hyrule. Every beat of each remixed, The Legend of Zelda tune is a chance to move, attack, defend, and more, so stay one step ahead of each enemy and bossor face the music. From modern-looking Lynels to the Hyrulean Soldiers of old, you must master the instinctive movements of each pixel-art enemy, and strategically outstep them in rhythmic combat. So equip yourself with an arsenal of iconic Legend of Zelda items, as well as the spells and weapons from Crypt of the Necrodancer. You must be prepared to face Hyrule's most wicked bosses, which have been transformed by magic, granting them mighty, new forms!\n\n* A rhythmic action-adventure game in the world of the Legend of Zelda series\n* Explore the randomly generated overworld and dungeons to save Hyrule as Link or Princess Zelda\n Use items from the Legend of Zelda series, plus spells and weapons from the Crypt of the Necrodancer game\n* Outstep legendary enemies and bosses in rhythmic combat\n* Keep the beat with 25 remixed classic Legend of Zelda tunes",
    "score": "85"
  },
  {
    "id": "87468ac6-8599-4aa1-b533-9190c11c474c",
    "title": "Thumper",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/8/f3b5bfbd2b8a211034dc19b924bf594b-98.jpg",
    "platform": "Switch",
    "date": "May 18, 2017",
    "description": "Thumper is rhythm violence: classic rhythm-action, blistering speed, and brutal physicality.",
    "score": "85"
  },
  {
    "id": "b72a24aa-acff-41b6-aa26-1e8cb37a8c3c",
    "title": "Blaster Master Zero II",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/8/4222dd6d65d4a52d57dbc8f99b9329ab-98.jpg",
    "platform": "Switch",
    "date": "March 20, 2019",
    "description": "The side-scrolling/top-down hybrid action adventure gameplay returns with a brand new sequel to \"Blaster Master Zero\"!\n\nExperience the yet-untold story of Jason and Eve after defeating Earth's mutant scourge as they venture into the depths of space in their new battle tank, \"GAIA-SOPHIA\"!\n\nThe story of Blaster Master Zero 2 begins a few months after the events of the first game (released on March 9, 2017), where the main protagonist Jason saves planet Earth from the mutants. Eve has been infected by mutant cells that are slowly corrupting her body, so together with Jason and Fred, they board G-SOPHIA and begin an intergalactic journey to Eve's home planet, Sophia, in hopes of finding a cure for the mutant infection.",
    "score": "85"
  },
  {
    "id": "70da4997-166d-4e4e-865b-3578ee7e0e63",
    "title": "Final Fantasy XII: The Zodiac Age",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/1/1f0a08a75b22a54d8417b8c8ef1dc03f-98.jpg",
    "platform": "Switch",
    "date": "April 30, 2019",
    "description": "Enter an era of war within the world of Ivalice. The small kingdom of Dalmasca, conquered by the Archadian Empire, is left in ruin and uncertainty. Princess Ashe, the one and only heir to the throne, devotes herself to the resistance to liberate her country. Vaan, a young man who lost his family in the war, dreams of flying freely in the skies. In a fight for freedom and fallen royalty, join these unlikely allies and their companions as they embark on a heroic adventure to free their homeland.\n\nFinal Fantasy XII: The Zodiac Age improves upon the 2006 classic Final Fantasy XII, now more beautiful and easier to play than ever. The high-definition remaster introduces several modern advancements, including reconstructed battle design and a revamped job system. With newly implemented trophies and share functions, as well as stark visual and sound improvements in true HD for the first time, players both returning and new to the game will experience a grand adventure that spans the world of Ivalice in an entirely fresh and improved way.",
    "score": "85"
  },
  {
    "id": "76259111-ec7b-4f15-adde-b7702f014971",
    "title": "Slay the Spire",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/0/d5efe5a8a6d086a44fbf1374aa6f749a-98.jpg",
    "platform": "Switch",
    "date": "June 6, 2019",
    "description": "Slay the Spire is an energetic fusion of card games and roguelikes. Choose your cards wisely. Craft a unique deck, encounter bizarre creatures, discover relics of immense power, and make your way up the ever-changing Spire.",
    "score": "85"
  },
  {
    "id": "62927a8f-90fb-4f88-b1c6-e4f9d0b32fac",
    "title": "Bug Fables: The Everlasting Sapling",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/0/e70478ab294a54673276ad113a64d73e-98.jpg",
    "platform": "Switch",
    "date": "May 28, 2020",
    "description": "Bug Fables is an adventure RPG following three heroes, Vi, Kabbu, and Leif, as they embark on an epic quest in Bugaria in search of treasure and immortality! The game combines colorful platforming with the heroes' unique abilities as they explore a wide variety of areas in the kingdom. Battles are turn-based and make use of action commands that can enhance attacks.",
    "score": "85"
  },
  {
    "id": "1ccae705-0eb9-4c96-a2ef-2a17e4278402",
    "title": "Night in the Woods",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/3/e35c4298ad0ec4b5f1c2f8ec42986c04-98.jpg",
    "platform": "Switch",
    "date": "February 1, 2018",
    "description": "Night In The Woods is a 2D story-focused adventure/exploration game with many extracurricular activities to enjoy, characters to meet, and secrets to discover. Run, jump and use astral projection to explore the many sides of town of Possum Springs and the surrounding environs. Waste time around town with your crew of loser friends. Gain abilities that grant passage to new areas. Discover the secrets of a large cast of characters and the town itself. Experience a big crazy world and the remarkable events unfolding there. Play bass. Break stuff.",
    "score": "85"
  },
  {
    "id": "3a5b2710-4d99-4465-8344-6e4317e6cfe7",
    "title": "The Witcher 3: Wild Hunt - Complete Edition",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/0/793f6a24fd8c7435688ab04c75f02c6c-98.jpg",
    "platform": "Switch",
    "date": "October 15, 2019",
    "description": "AKA \"Switcher 3\".... A whole world to explore, at home and on the go. The Witcher 3: Wild Hunt is a story-driven, open world adventure set in a dark fantasy universe. You are Geralt of Rivia, mercenary monster slayer. At your disposal is every tool of the trade: razor-sharp swords, lethal mixtures, stealthy crossbows, and powerful combat magic. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down the Child of Prophecy, a living weapon that can alter the shape of the world.\n\nThe Complete Edition contains every piece of downloadable content released for the game, including two massive story expansions: Hearts of Stone & Blood and Wine. It's the perfect opportunity to enter this world for the first time or relive the adventure on the go!\n\nFeatures:\n\n* A gigantic open world to explore.\n Visit the luxurious and corrupt city of Novigrad, face the frigid cold of the wind-swept Skellige islands, and challenge the dark forces roaming the forlorn, ravaged No Man's Land. Sail through open seas, dive in search of long lost artifacts or gallop your mount into combat the world of the Witcher beckons to be explored.\n\n* Unparalleled novel-like story spanning over 150 hours of gameplay.\n With over 100 hours of core and side-quest gameplay and over 50 hours of additional content, The Witcher 3: Wild Hunt combines the intense, plot-driven pull of traditional RPGs with the freedom of choice only open world games can offer. Make choices and face their consequences to unlock endings tailored to how you play.\n\n* Now on Switch play at home and on the go.\n Developed to take advantage of everything Nintendo Switch has to offer, the game delivers a truly powerful on-the-go experience.",
    "score": "85"
  },
  {
    "id": "6aa477fb-2d69-4ed7-ba56-2cf6fb59c998",
    "title": "The Binding of Isaac: Afterbirth +",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/4/d408a6521a06a2d6e87c3a2bb96e51e0-98.jpg",
    "platform": "Switch",
    "date": "March 17, 2017",
    "description": "The latest expansion to The Binding of Isaac: Rebirth features: 55+ new items, new final chapter with boss and ending, new playable character, greed hard mode, daily greed runs, 5 new challenges, loads of new achievements, new bosses and other little editions, plus new dev tools! so you can design, edit and play and endless number of mods, features and whole new games that the community will no doubt eventually design.",
    "score": "85"
  },
  {
    "id": "9c662c3e-0d88-4b1a-86ee-8fa16bd21abc",
    "title": "Two Point Hospital",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/1/1b296ff702f24597029bdb0984d96def-98.jpg",
    "platform": "Switch",
    "date": "February 25, 2020",
    "description": "Build up a hospital from nothing to a masterpiece as you design the most beautiful - or functional - healthcare operation in the whole of Two Point County. Optimize your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact specifications. Expand your hospital to multiple buildings as you look to get as many patients through the door as possible. Place decorative and functional items around your hospital to improve its prestige, lower patient boredom, increase happiness and keep those end of year awards flowing in.",
    "score": "85"
  },
  {
    "id": "f6e28e46-c185-43a4-af81-b69865f07277",
    "title": "Dragon Quest Builders 2",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/9/8ec459cb5b5e847a88a7518ece75ca22-98.jpg",
    "platform": "Switch",
    "date": "July 12, 2019",
    "description": "To stop the worshippers of an ancient evil, you must join forces with the mysterious Malroth and build a ravaged world into the realm of your dreams. In this RPG adventure, you’ll explore huge islands, gather and craft with materials, design towns, level them up, and defend them from monsters and bosses alongside townspeople. As you progress, you’ll unearth crafting and building recipes. Dash, glide, explore underwater, fast travel, and play in optional first-person perspective as you try to find them all. In the Isle of Awakening, you and up to three other Builders can explore together in local wireless*; or play online** together too.",
    "score": "85"
  },
  {
    "id": "4f711c99-1d98-40c1-8000-9d8f6610d14a",
    "title": "Lonely Mountains: Downhill",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/4/c05abefb028295d3540cfeb9e6d2fb10-98.jpg",
    "platform": "Switch",
    "date": "May 7, 2020",
    "description": "Just you and your bike — take it on a thrilling ride down an unspoiled mountain landscape. Make your way through thick forests, narrow trails and wild rivers. Race, jump, slide and try not to crash — all the way from the peak to the valley.",
    "score": "85"
  },
  {
    "id": "ce417513-34c3-4e5c-91a4-a4da8994b3a1",
    "title": "West of Loathing",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/9/202a01eaab4dc7d1d19c0316b351ebbb-98.jpg",
    "platform": "Switch",
    "date": "May 31, 2018",
    "description": "West of Loathing is a single-player slapstick comedy adventure role-playing game set in the wild west of the Kingdom of Loathing universe. Traverse snake-infested gulches, punch skeletons wearing cowboy hats, grapple with demon cows, and investigate a wide variety of disgusting spittoons. Talk your way out of trouble as a silver-tongued Snake Oiler, plumb the refried mysteries of the cosmos as a wise and subtle Beanslinger, or let your fists do the talking as a fierce Cow Puncher. Explore a vast open world and encounter a colorful cast of characters, some of whom are good, many of whom are bad, and a few of whom are ugly. [Nintendo]",
    "score": "85"
  },
  {
    "id": "92aae93b-9afb-4c00-9ef7-d009a976d2f5",
    "title": "Steins;Gate Elite",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/3/fc6591a8325b01506bf66ab264f40940-98.jpg",
    "platform": "Switch",
    "date": "February 19, 2019",
    "description": "Follow a group of young, tech-savvy “lab members” who discover the means of changing the past via e-mail using a modified microwave. Their experiments in pushing the boundaries of time begin to spiral out of control as they become entangled in a conspiracy surrounding SERN, the organization behind the Large Hadron Collider, and John Titor, who claims to be from a dystopian future.",
    "score": "85"
  },
  {
    "id": "67992d8e-525a-4d74-aec1-088279e800a9",
    "title": "Darkest Dungeon",
    "rankNumber": "82.",
    "img": "https://static.metacritic.com/images/products/games/3/8344281531f0023de5eceb44ec83fb7b-98.jpg",
    "platform": "Switch",
    "date": "January 18, 2018",
    "description": "Darkest Dungeon is a gothic roguelike RPG dungeon crawler about the psychological stresses of adventuring. You will lead a band of four heroes on a perilous side-scrolling descent, dealing with a prodigious number of threats to their bodily health, and worse, a relentless assault on their mental fortitude! Five hundred feet below the earth you will not only fight unimaginable foes, but famine, disease, and the stress of the ever-encroaching dark. Darkest Dungeon focuses on the humanity and psychological vulnerability of the heroes and asks: What emotional toll does a life of adventure take?",
    "score": "85"
  },
  {
    "id": "18497479-d696-4985-b13a-cf77ccf1e899",
    "title": "Mutant Mudds Collection",
    "rankNumber": "83.",
    "img": "https://static.metacritic.com/images/products/games/0/f28f98f85662e56124a26f59b852ecbf-98.jpg",
    "platform": "Switch",
    "date": "December 14, 2017",
    "description": "Love pixels? Fond of platformers? Is there a special place in your heart for the 8-bit and 16-bit era? Want to have fun? Yes!? Well, you've come to the right place, my friend. Mutant Mudds is a \"12-bit\" action platformer full of pixels and platforming fun! Our hero, Max, may be just a 2D sprite, but he can leap into the third dimension by jetting between the background and the foreground playfields with his trusty jetpack in this unique dimensionally-woven experience. Armed with a heavy-duty water cannon, Max has what he needs to vanquish his long-term nemesi: the Mutant Mudds. Max must blast and hover his way across the soiled landscape to seek out mysterious Water Sprites. Legend says collecting all of the mysterious Water Sprites will wash the filthy Mutant Mudds away for good!",
    "score": "85"
  },
  {
    "id": "44c39967-7e78-4fae-8cbc-4fd0453f63a6",
    "title": "NeuroVoider",
    "rankNumber": "84.",
    "img": "https://static.metacritic.com/images/products/games/3/66ada73b181421144c7d1a1b9c3d051b-98.jpg",
    "platform": "Switch",
    "date": "September 7, 2017",
    "description": "NeuroVoider is a twin-stick shooter RPG set in a cyber futuristic world about brains shooting around evil robots with nuclear rocket launchers. Battle through the horde of vigilant robots, boost your character with the smoking remains of your victims, and defeat the master NeuroVoider to end this eternal war. Play it coop with up to 4 friends, or go alone in an adventure of hack'n'slash rampage, with a pinch of rogue-lite, and some permadeath.",
    "score": "85"
  },
  {
    "id": "c9b6e466-e2da-4c23-9681-28d20e48738a",
    "title": "Final Fantasy X / X-2 HD Remaster",
    "rankNumber": "85.",
    "img": "https://static.metacritic.com/images/products/games/4/82334e6818ce94e25c0e86648e802cdc-98.jpg",
    "platform": "Switch",
    "date": "April 16, 2019",
    "description": "Two of the Most Celebrated RPGs of their Generation - Now in Beautiful High Definition!\n\nOver 200 hours of gameplay, including the International version content never before released in North America.\n\nRelive the fateful journey with fully remastered HD visuals and rearranged music.",
    "score": "85"
  },
  {
    "id": "515509ab-6aaa-4160-b88d-6bb84925d4ea",
    "title": "Mario + Rabbids: Kingdom Battle",
    "rankNumber": "86.",
    "img": "https://static.metacritic.com/images/products/games/8/6dbc2eea84890a1acfe8bc934a94fd5e-98.jpg",
    "platform": "Switch",
    "date": "August 29, 2017",
    "description": "Welcome to the story of an unexpected encounter between Mario and the irreverent Rabbids. To bring order back to a splintered Mushroom Kingdom, Mario, Luigi, Princess Peach, and Yoshi team up with Rabbids heroes in a journey through four different worlds. Outwit unpredictable enemies in dynamic turn-based combat and co-op challenges, and solve puzzles along the way. Discover a feel-good and modern combat adventure designed exclusively for the Nintendo Switch system, playable anywhere, anytime, with anyone. [Ubisoft]",
    "score": "85"
  },
  {
    "id": "d23eced9-219b-4f03-8372-3dbd081fb053",
    "title": "Disgaea 4 Complete+",
    "rankNumber": "87.",
    "img": "https://static.metacritic.com/images/products/games/1/7cd5dd85e0eab98a17448419f1cf73c3-98.jpg",
    "platform": "Switch",
    "date": "October 29, 2019",
    "description": "When the Corrupternment threatens to disrupt the way of life in Hades, Valvatorez finds himself at the helm of a fiery revolution. Dive into a tale of revolution and redemption, woven throughout a dark and hilarious realm of vampires, werewolves, and other devilish denizens. Engage in immersive and in-depth tactics-based gameplay brimming with over-the-top destructive action, and unload a horde of special features to take your Netherworldly adventures to another level.",
    "score": "85"
  },
  {
    "id": "64212246-6cff-4e0b-a581-cc8e66e3ef61",
    "title": "Keep Talking and Nobody Explodes",
    "rankNumber": "88.",
    "img": "https://static.metacritic.com/images/products/games/4/0539a132763d8484a7adc46b96870b8d-98.jpg",
    "platform": "Switch",
    "date": "August 16, 2018",
    "description": "In Keep Talking and Nobody Explodes, one player is trapped in a room with a ticking time bomb they must defuse. The other players are the “Experts” who must give the instructions to defuse the bomb by deciphering the information found in the Bomb Defusal Manual. But there’s a catch: the Experts can’t see the bomb, so everyone will need to talk it out – fast. Rounds are fast-paced, tense, occasionally silly, and almost always loud. Puzzle solving and communication skills – and maybe a few friendships – will be put to the test as players race to defuse bombs while communicating quickly, clearly, and effectively.",
    "score": "84"
  },
  {
    "id": "4e03cf89-3255-4fdb-9dfb-ee6e02de350b",
    "title": "Shantae: Half-Genie Hero - Ultimate Edition",
    "rankNumber": "89.",
    "img": "https://static.metacritic.com/images/products/games/5/cfa1edd073f2410ecb32e792dec2b483-98.jpg",
    "platform": "Switch",
    "date": "May 8, 2018",
    "description": "Iconic genie Shantae is back in her most thrilling adventure yet! The award-winning 2D platforming series levels-up to stunning new heights thanks to an eye-popping new graphical style, an infectious soundtrack and incredible new game features. Transform into different creatures, dance through dynamic, danger-filled stages, complete quests for friends and face-off against awesome screen-filling bosses in an action-packed thrill ride without equal.\n\nFEATURES:\n\n* The complete package! -- This Ultimate Edition contains the award-winning Shantae: Half-Genie Hero, plus three major expansions - Pirate Queen's Quest DLC, Friends To The End DLC and Costume Mode DLC -- all in one bumper package!\n\n* Day One Edition bonuses! -- Also includes the essential Shantae: Half-Genie Hero artbook, and the toe-tapping, 30-song Risky Beats soundtrack CD!\n\n* Incredible visuals! -- Eschewing the series' former pixel art look, 2D characters and 3D worlds combine seamlessly in Shantae: Half-Genie Hero for the most beautiful platformer yet.\n\n* Peerless adventuring! -- Revisit stages with new transformation abilities and morph into a wacky range of creatures (elephants! crabs! mice!) to uncover deeply hidden secrets and unexplored areas.\n\n* Play as the full gang! -- Shantae's got company! Take control of popular co-stars Sky, Bolo, Rottytops and even series antagonist Risky Boots herself, and use each character's unique skills to journey through new storylines and scenarios long after Shantae's quest is over!",
    "score": "84"
  },
  {
    "id": "fe4ff8c0-224c-4c5a-86a9-73be01a4e4af",
    "title": "Thronebreaker: The Witcher Tales",
    "rankNumber": "90.",
    "img": "https://static.metacritic.com/images/products/games/0/b3950d40a50edd2a639879ad334139f3-98.jpg",
    "platform": "Switch",
    "date": "January 28, 2020",
    "description": "Thronebreaker is a single player role-playing game set in the world of The Witcher that combines narrative-driven exploration with unique puzzles and card battle mechanics.\n\nCrafted by the developers responsible for some of the most iconic moments in The Witcher 3: Wild Hunt, the game spins a truly regal tale of Meve, a war-veteran and queen of two Northern Realms Lyria and Rivia. Facing an imminent Nilfgaardian invasion, Meve is forced to once again enter the warpath and set out on a dark journey of destruction and revenge.\n\nKEY FEATURES\n\nAN ALL NEW EPIC TALE\n* Experience an all-new 30-hour Witcher world tale with 20 possible world end-states.\n* Embark on a grand adventure full of thought-provoking quests.\n* Influence the state of the world around you by making difficult choices and face their consequences.\n* Meet a cast of rich, multidimensional characters some of them will join you on your quest, others you'll have to face on the battlefield.\n\nTRAVEL TO NEVER-BEFORE-SEEN KINGDOMS\n* Explore new and mysterious regions of the monster-infested world of The Witcher.\n* Traverse vast lands and unique locations, all with their distinct theme from vibrant countrysides and war-torn landscapes, to grand castles and snow-capped mountains.\n* Save villages from hordes of monsters, look for treasures hidden among ancient ruins, scour the land for resources, and more the world of Thronebreaker is teeming with things to do.\n\nPREPARE FOR WAR\n* Develop and customize your very own battle camp.\n* Train and recruit units, unlock new skills and work on your tactics.\n* Manage resources you find and trade them with local merchants.\n* Learn more about your companions and increase their strength in battle.\n\nLEAD YOUR ARMY IN EPIC BATTLES\n* Build an army from characters you meet and interact with during your journey.\n* Fight in epic story battles and solve unique puzzles and challenges.\n* Use unique skills and abilities of your army and lead it to victory.",
    "score": "84"
  },
  {
    "id": "8be3102f-9fa2-40d3-826a-7c2b4856abd1",
    "title": "Valkyria Chronicles",
    "rankNumber": "91.",
    "img": "https://static.metacritic.com/images/products/games/1/a32871d4222c7ecdb1a49302a72b6234-98.jpg",
    "platform": "Switch",
    "date": "October 16, 2018",
    "description": "Fierce Combat & Explosive Tactics!\n\nAs heroic Commander Welkin, you must lead a small platoon in defense of your country against the evil invading Empire.\nTurn-Based tactics meet action-packed real-time shooting in this beautifully crafted epic.\n\nFight in third-person, real-time battles!\nEpic storyline filled with dramatic warfare!\nCustomize your platoon with 50 characters!",
    "score": "84"
  },
  {
    "id": "2534f629-00d4-4791-9845-7b796cd98484",
    "title": "Shovel Knight: Specter of Torment",
    "rankNumber": "92.",
    "img": "https://static.metacritic.com/images/products/games/5/0f740cde52daa374c0381518d50fafa9-98.jpg",
    "platform": "Switch",
    "date": "March 3, 2017",
    "description": "Shovel Knight: Specter of Torment is the action-packed prequel to Shovel Knight! Take control of Specter Knight, servant to the Enchantress, in a quest to recruit a cadre of knights and create the Order of No Quarter. With his scythe and preternatural agility at the ready, he can glide across the ground, clamber up walls, and command an arsenal of curious weapons.\n\nIf he carries out his duties, Specter Knight may have a chance at regaining his lost humanity and breaking his chains of servitude. But what cruel tricks might the Enchantress have up her sleeve?",
    "score": "84"
  },
  {
    "id": "08f16a8c-053a-4467-bcaa-bea00c4af422",
    "title": "WHAT THE GOLF?",
    "rankNumber": "93.",
    "img": "https://static.metacritic.com/images/products/games/8/07bba4965651a717a5de48856783df24-98.jpg",
    "platform": "Switch",
    "date": "May 21, 2020",
    "description": "The golf game for people who hate golf!\n\nA silly physics-based golf parody where every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd they will make you go: WHAT THE GOLF?\n\nGolf a house, a horse or car!\n\nFeatures:\n- More surprising new golf mechanics than you can imagine\n- Epic golf boss fights\n- Made by people who know nothing about golf\n- First (and hopefully the last) game that let you golf a horse\n- Will NOT make you a better golf player\n- Surprises!",
    "score": "84"
  },
  {
    "id": "080d956d-398b-43f2-a934-b6f62d73fbae",
    "title": "80 DAYS",
    "rankNumber": "94.",
    "img": "https://static.metacritic.com/images/products/games/4/11e81d7afedb08919d1a6c5175e66044-98.jpg",
    "platform": "Switch",
    "date": "October 1, 2019",
    "description": "1872, with a steampunk twist. Phileas Fogg has wagered he can circumnavigate the world in just eighty days. Choose your own route around a 3D globe, travelling by airship, submarine, mechanical camel, steam-train and more, racing other players and a clock that never stops.",
    "score": "84"
  },
  {
    "id": "d6962240-9ad1-4315-a36e-9c9f058bd11a",
    "title": "VA-11 Hall-A: Cyberpunk Bartender Action",
    "rankNumber": "95.",
    "img": "https://static.metacritic.com/images/products/games/6/72d6233730e3e9002c3ec36093c66478-98.jpg",
    "platform": "Switch",
    "date": "May 2, 2019",
    "description": "Welcome to VA-11 Hall-A!\n\nIn this world, corporations reign supreme, all human life is infected with nanomachines designed to oppress them, and the terrifying White Knights ensure that everyone obeys the laws.\n\nBut, this story is not about those people.\n\nYou are a bartender at VA-11 Hall-A, affectionately nicknamed \"Valhalla.\" Although it is just a small bar in downtown Glitch City, it attracts the most fascinating people this side of dystopia. Keep your clients lubricated and you will be made privy to the most interesting stories.",
    "score": "84"
  },
  {
    "id": "b7f667a8-f026-4971-a414-9bbe05eb0948",
    "title": "Toki Tori 2 +",
    "rankNumber": "96.",
    "img": "https://static.metacritic.com/images/products/games/6/c667d821352e43a96a145a57a32fafa8-98.jpg",
    "platform": "Switch",
    "date": "February 23, 2018",
    "description": "Experience Toki Tori’s Epic Puzzle Adventure on the go, for the first time ever. Explore a forest island, learn magical songs and interact with the local wildlife to solve environmental puzzles. Toki Tori 2+’s game design requires just two moves: whistle and stomp. It's super accessible, yet it builds up to incredible complexity later on. There’s a ton to do, too. After puzzle-solving your way to five Ancient Frogs and saving the island from a strange pollution, you can still find 100s of golden wings, snap dozens of creature pictures and go Achievement hunting. You can now create checkpoints wherever you like, allowing for easy experimentation.\n\n    - A unique take on the Metroidvania formula\n    - Follow the path, or stray off-road and tackle the expert puzzles\n    - Whistle magical songs to rewind, fast-travel and more\n    - Snap dozens of Tokidex creature pictures",
    "score": "84"
  },
  {
    "id": "8e3ac826-5429-40c1-8b1f-63fcdc94f1eb",
    "title": "Bayonetta",
    "rankNumber": "97.",
    "img": "https://static.metacritic.com/images/products/games/9/e5beb7d8e4b80a2d269271b6330f1e04-98.jpg",
    "platform": "Switch",
    "date": "February 16, 2018",
    "description": "Bayonetta is a cinematic and stylish action game from the creative mind of Hideki Kamiya. As a gun-wielding witch with powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless enemies in a game of 100% pure all-out action. Outlandish finishing moves are performed with acrobatic grace as Bayonetta flows from one fight to another. Bayonetta pushes the limits of the action genre with magnificent over-the-top action and fast-paced, dynamic climax combat.",
    "score": "84"
  },
  {
    "id": "7a8addcf-797c-4440-9e42-1afa5d709ac4",
    "title": "Mega Man X Legacy Collection",
    "rankNumber": "98.",
    "img": "https://static.metacritic.com/images/products/games/6/d83b23e662eebbab002488ece9b5e98d-98.jpg",
    "platform": "Switch",
    "date": "July 24, 2018",
    "description": "Mega Man X Legacy Collection includes Mega Man X, X2, X3, and X4",
    "score": "84"
  },
  {
    "id": "7700c0ce-bf71-48e9-afea-7c92d591baa0",
    "title": "Rayman Legends: Definitive Edition",
    "rankNumber": "99.",
    "img": "https://static.metacritic.com/images/products/games/8/27596ceca4b2d2f86688686d7c948c31-98.jpg",
    "platform": "Switch",
    "date": "September 12, 2017",
    "description": "Rayman, winner of multiple artistic and musical achievements, is coming to Nintendo Switch with Rayman Legends Definitive Edition.\n\nRayman, Globox, and the Teensies are off wandering through an enchanted forest when they discover a mysterious tent filled with a series of captivating paintings. As they look more closely, they notice each painting seems to tell the story of a mythical world. While focusing on a painting that shows a medieval land, they are suddenly sucked into the painting, entering the world, and the adventure begins. The gang must run, jump, and fight their way through each world to save the day and discover the secrets of every legendary painting.\n\n*    Join the team with up to 4 players in local co-op!\n*    Compete with your friends in tournaments with the Kung Foot experience (local wireless multiplayer)\n*    Run, jump & smack your way through 100+ maps\n*    Jump to the rhythm and rock the party to beat the crazy musical levels",
    "score": "84"
  },
  {
    "id": "b4f2306c-eec5-4bbb-b727-dd835f3c2852",
    "title": "The Elder Scrolls V: Skyrim",
    "rankNumber": "100.",
    "img": "https://static.metacritic.com/images/products/games/2/381e2e7b85c324573c94ae1b9eea92a1-98.jpg",
    "platform": "Switch",
    "date": "November 17, 2017",
    "description": "The open-world adventure from Bethesda Game Studios where you can virtually be anyone and do anything, now allows you to go anywhere—at home and on the go. New features include motion controls, gear based on the Legend of Zelda series, and amiibo compatibility. Dragons, long lost to the passages of the Elder Scrolls, have returned and the future of Skyrim hangs in the balance. As Dragonborn, the prophesized hero born with the power of The Voice, you are the only one who can stand against them. Live another life, in another world—from battling ancient dragons, exploring rugged mountains, building a home, or mastering hundreds of weapons, spells and abilities. For the first time ever, go into battle Legend of Zelda style: fight with the Master Sword, guard with the Hylian Shield, while wearing the Champion's Tunic. The game also includes official add-ons—Dawnguard, Hearthfire, and Dragonborn. [Nintendo]",
    "score": "84"
  }
]