[
  {
    "id": "6f45e56c-61c3-4b27-97ec-7deede1100e6",
    "title": "Half-Life 2",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/8/3154ea81c0d3578b829a6640ac5ecfe7-98.jpg",
    "platform": "PC",
    "date": "November 16, 2004",
    "description": "[Metacritic's 2004 PC Game of the Year]  By taking the suspense, challenge and visceral charge of the original, and adding startling new realism and responsiveness, Half-Life 2 opens the door to a world where the player's presence affects everything around him, from the physical environment to the behaviors -- even the emotions -- of both friends and enemies. The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people -- people he cares about -- are counting on him. [Vivendi Universal]",
    "score": "96"
  },
  {
    "id": "292476f9-f6cf-4187-8bbc-9f5b69d9fe23",
    "title": "Grand Theft Auto V",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/2/bab786f634eee57a1c68be2dddf3d1e5-98.jpg",
    "platform": "PC",
    "date": "April 13, 2015",
    "description": "Los Santos: a sprawling sun-soaked metropolis full of self-help gurus, starlets and fading celebrities, once the envy of the Western world, now struggling to stay alive in a time of economic uncertainty and cheap reality TV. Amidst the turmoil, three very unique criminals plot their own chances of survival and success: Franklin, a street hustler looking for tangible opportunities and serious money; Michael, a professional ex-con whose retirement is less rosy than he figured it would be; and Trevor, a violent dude driven by the opportunity for a cheap high and his next big score. With options at a premium, the crew risks it all in a myriad of daring and dangerous heists that could set them up for life.",
    "score": "96"
  },
  {
    "id": "ed5f96c2-5c91-4589-9734-27d75fe93314",
    "title": "The Orange Box",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/5/cf1e9a839c0b223409d505c354dfe59b-98.jpg",
    "platform": "PC",
    "date": "October 10, 2007",
    "description": "Games included in The Orange Box compilation: The original Half-Life 2 - The player again picks up the crowbar of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, its populace dwindling. Freeman is thrust into the unenviable role of rescuing the world from the wrong he unleashed back at Black Mesa. And a lot of people - people he cares about - are counting on him. Half-Life 2: Episode One - The player reprises his role of Dr. Freeman, who must immediately face the repercussions of his actions in City 17 and the Citadel. Freeman reconnects with Alyx Vance and her robot, Dog, as they continue their support of the resistance's battle against the Combine forces.  Half-Life 2: Episode Two -- the second installment in Valve's episodic trilogy advances the award-winning story, leading the player to new locations outside of City 17. Portal - a pioneering type of single player action game that rewrites the rules for how players approach and manipulate their environment – much like how Half-Life 2's Gravity Gun reinvented the way gamers interact with objects in the game. Team Fortress 2 - an all-new version of the legendary title that spawned team based multiplayer action games. The game's daring new art style features the most advanced graphics of any Source-based game released to date. [Valve Software]",
    "score": "96"
  },
  {
    "id": "b6104a60-c4fb-47ad-8ebc-08c3b4c6844b",
    "title": "Half-Life",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/5/5764f80ddd3e67da3b29eb759e8a4737-98.jpg",
    "platform": "PC",
    "date": "November 19, 1998",
    "description": "Half-Life combines great storytelling in the tradition of Stephen King with intense action and advanced technology to create a frighteningly realistic world where players need to think smart to survive. Half-Life has won more than 50 Game of the Year awards from publications around the world, and was named 'Best PC Game Ever' in PC Gamer's November 1999 issue. [Sierra]",
    "score": "96"
  },
  {
    "id": "b1414c07-ac05-4bef-b760-fe561b7857c9",
    "title": "BioShock",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/4/6e40cbab3978d4fe0c1390f8b46f23cc-98.jpg",
    "platform": "PC",
    "date": "August 21, 2007",
    "description": "Going beyond \"run and gun corridors,\" \"monster-closet AIs\" and static worlds, BioShock creates a living, unique and unpredictable FPS experience. After your plane crashes into icy uncharted waters, you discover a rusted bathysphere and descend into Rapture, a city hidden beneath the sea. Constructed as an idealistic society for a hand picked group of scientists, artists and industrialists, the idealism is no more. Now the city is littered with corpses, wildly powerful guardians roam the corridors as little girls loot the dead, and genetically mutated citizens ambush you at every turn. Take control of your world by hacking mechanical devices, commandeering security turrets and crafting unique items critical to your very survival. Upgrade your weapons with ionic gels, explosives and toxins to customize them to the enemy and environment. Genetically modify your body through dozens of Plasmid Stations scattered throughout the city, empowering you with fantastic and often grotesque abilities. Explore a living world powered by Ecological A.I., where the inhabitants have interesting and consequential relationships with one another that impact your gameplay experience. Experience truly next generation graphics that vividly illustrate the forlorn art deco city, highlighted by the most detailed and realistic water effects ever developed in a video game. Make meaningful choices and mature decisions, ultimately culminating in the grand question: do you exploit the innocent survivors of Rapture...or save them? [2K Games]",
    "score": "96"
  },
  {
    "id": "1bbafe44-73f2-4fb2-a53f-69af1e9c4c80",
    "title": "Baldur's Gate II: Shadows of Amn",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/9/fee92d54ce517ca92f49122771fd4aa5-98.jpg",
    "platform": "PC",
    "date": "September 24, 2000",
    "description": "An epic continuation of the story that began in \"Baldur's Gate,\" this RPG is set along the southern portion of the Sword Coast, a detailed and rich area of the Forgotten Realms called Amn. It features 300 spells and 130-plus monster types compared to only 130 spells and 60 monster types in Baldur's Gate. [Interplay]",
    "score": "95"
  },
  {
    "id": "96d3f9d0-6ad5-4d64-9f44-59c72c147d6a",
    "title": "Portal 2",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/8/8ebc9aa5758d569f33e543d9fb629545-98.jpg",
    "platform": "PC",
    "date": "April 18, 2011",
    "description": "Valve is working on a full-length sequel to its award-winning, mind-bending puzzle action game for the Xbox 360 and PC.",
    "score": "95"
  },
  {
    "id": "f385f4a6-6149-45e1-a23b-4736e1380268",
    "title": "The Elder Scrolls V: Skyrim",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/7/5988ee04196a686e107b46174f94a3ae-98.jpg",
    "platform": "PC",
    "date": "November 10, 2011",
    "description": "The next chapter in the Elder Scrolls saga arrives from the Bethesda Game Studios. Skyrim reimagines the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose. Play any type of character you can imagine, and do whatever you want; the legendary freedom of choice, storytelling, and adventure of The Elder Scrolls is realized like never before. Skyrim's new game engine brings to life a complete virtual world with rolling clouds, rugged mountains, bustling cities, lush fields, and ancient dungeons. Choose from hundreds of weapons, spells, and abilities. The new character system allows you to play any way you want and define yourself through your actions. Battle ancient dragons like you've never seen. As Dragonborn, learn their secrets and harness their power for yourself.",
    "score": "94"
  },
  {
    "id": "e7582716-c4fc-4036-b4f1-b43247ef896f",
    "title": "Mass Effect 2",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/1/e2a90286a8a5a8d39aede79430f56575-98.jpg",
    "platform": "PC",
    "date": "January 26, 2010",
    "description": "The Mass Effect trilogy is a science fiction adventure set in a vast universe filled with dangerous alien life forms and mysterious uncharted planets. In this dark second chapter, Saren’s evil army of Geth soldiers has just been defeated, and humans, who are still struggling to make their mark on the galactic stage, are now faced with an even greater peril. [BioWare]",
    "score": "94"
  },
  {
    "id": "277399be-1854-4451-a1ef-d310a9d8e33e",
    "title": "Grand Theft Auto: Vice City",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/4/a11e316b5dce587c8664323b4fd3230e-98.jpg",
    "platform": "PC",
    "date": "May 12, 2003",
    "description": "[Metacritic's 2003 PC Game of the Year] The PC version has enhanced features including improved graphics and sound, additional PC controls, as well as several options for players to customize the game. \"Welcome to Vice City. Welcome to the 1980s.\" Having just made it back onto the streets of Liberty City after a long stretch in maximum security, Tommy Vercetti is sent to Vice City by his old boss, Sonny Forelli. They were understandably nervous about his re-appearance in Liberty City, so a trip down south seemed like a good idea. But all does not go smoothly upon his arrival in the glamorous, hedonistic metropolis of Vice City. He's set up and is left with no money and no merchandise. Sonny wants his money back, but the biker gangs, Cuban gangsters, and corrupt politicians stand in his way. Most of Vice City seems to want Tommy dead. His only answer is to fight back and take over the city himself. Vice City offers vehicular pleasures to suit every taste. For the speed enthusiast, there's high-performance cars and motorbikes. For the sportsman, a powerboat or a golf buggy lets you enjoy the great outdoors. For those that need that sense of freedom and escape, why not charter a helicopter and see the beauty of Vice City from the air? [Rockstar]",
    "score": "94"
  },
  {
    "id": "7dccc547-63e1-4338-8062-11dc1957594a",
    "title": "Sid Meier's Civilization II",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/2/a316dd672da65f4bec1495e9078467e7-98.jpg",
    "platform": "PC",
    "date": "February 29, 1996",
    "description": "An empire-building turn-based strategy game. The game starts at the Old Stone Age in 4000 BC. Your tribe begins with a Settlers unit and has no knowledge about the surrounding area. As you found new cities and explore the surroundings, you may find hostile barbarians, villages, and other competing cultures. [Civ Fantatics' Center]",
    "score": "94"
  },
  {
    "id": "32fc619d-d9bc-46be-98c1-7c39ef9d3370",
    "title": "Quake",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/3/019b99bac78077f18f055b1c4019c0c7-98.jpg",
    "platform": "PC",
    "date": "June 22, 1996",
    "description": "Rage through 32 single player levels and 6 deathmatch levels of sheer terror and fully immersive sound and lighting. Arm yourself against the cannibalistic Ogre, fiendish Vore and indestructible Schambler using letal nails, fierce Thunderbolts and abominable Rocket and Grenade Launchers. [id Software]",
    "score": "94"
  },
  {
    "id": "95ca9baa-a0af-47e7-b74c-8ab6f7005f53",
    "title": "BioShock Infinite",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/8/d6db22b96a880fa7fb6d577591e181e2-98.jpg",
    "platform": "PC",
    "date": "March 25, 2013",
    "description": "Initially conceived as a floating symbol of American ideals at a time when the United States was emerging as a world power, Columbia is sent to distant shores with great fanfare by a captivated public.  What begins as a fresh new endeavor of hope turns drastically wrong as the city soon disappears into the clouds to whereabouts unknown. The player takes on the role of former Pinkerton agent Booker DeWitt, sent to the lost city to rescue Elizabeth, a young lady imprisoned there since her childhood. He develops a relationship with Elizabeth, enhancing his abilities with hers so the pair may escape from a city that is literally falling from the sky. DeWitt has to learn to fight foes in high-speed Sky-Line battles, engage in combat both indoors and amongst the clouds, and harness the power of a myriad of new weapons and abilities.",
    "score": "94"
  },
  {
    "id": "35c64cfc-d5be-4c16-99d0-07948dc76813",
    "title": "The Elder Scrolls IV: Oblivion",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/9/eff7141d6f5211ebdc3872217388fc55-98.jpg",
    "platform": "PC",
    "date": "March 20, 2006",
    "description": "Oblivion is a single-player game that takes place in Tamriel's capital province, Cyrodiil. You are given the task of finding the hidden heir to a throne that sits empty, the previous emperor having been killed by an unknown assassin. With no true Emperor, the gates to Oblivion (the equivalent of hell in the world of Tamriel) open, and demons begin to invade Cyrodiil and attack its people and towns. It's up to you to find the lost heir to the throne and unravel the sinister plot that threatens to destroy all of Tamriel. In keeping with the Elder Scrolls tradition, players have the option to experience the main quest at their own pace, and there are plenty of opportunities to explore the vast world and make your own way. Numerous factions can be joined, such as the thieves or mages guilds, and each contains its own complete storyline and the chance to rise to the head of the faction and reap further rewards. Oblivion features a groundbreaking new AI system, called Radiant AI, which gives non-player characters (NPCs) the ability to make their own choices based on the world around them. They decide where to eat or who to talk to and what they say. They sleep, go to church, and even steal items, all based on their individual characteristics. Full facial animations and lip-synching, combined with full speech for all dialog, allows NPCs to come to life like never before. [Bethesda]",
    "score": "94"
  },
  {
    "id": "14fe1e35-f43f-4cb6-b0e6-d66f84380d84",
    "title": "Grim Fandango",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/2/c3ac5d8edcc4d201cb9e92ad8903d9a5-98.jpg",
    "platform": "PC",
    "date": "October 14, 1998",
    "description": "Something's rotten in the Land of Dead and you're being played for a sucker.  Meet Manny Calavera, travel agent at the Department of Death. He sells luxury packages to souls on their four-year journey to eternal rest. But there's trouble in paradise.  Help Manny untangle himself from a conspiracy that threatens his very salvation. [LucasArts]",
    "score": "94"
  },
  {
    "id": "4d96b337-008c-4708-9392-97c2eb33b3ed",
    "title": "Diablo",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/2/3d23d53559172dfdb3b3d910f9923547-98.jpg",
    "platform": "PC",
    "date": "December 31, 1996",
    "description": "The kingdom of Khandaras has fallen into chaos. An unknown force of evil has swept across the land. Plunging it nto civil war and terrorizing the populace. A mad king, his missing son, and a mysterious archbishop are all pieces to the puzzle that faces you. You have journeyed to the source of the evil. The town of Tristram. Now inhabited by only a handful of survivors. The catherdal there is buildt over the ruins of an ancient monastary, and now eerie lights and sounds are heard echoing through its abandoned halls. Perhaps the answer lies withing the remains of a forgotten past... Diablo invites you to enter a world of dark gothic fantasy. Play as a brave warrior, cunning rogue or mysterious sorceror. As you venture deeper into the labyrinth, you'll discover weapons, armor, and magical treasures, and develop your character's skills and abilities. [Blizzard]",
    "score": "94"
  },
  {
    "id": "8ef19675-6d4d-47fb-815b-bb771ac0f9b6",
    "title": "Sid Meier's Civilization IV",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/7/caaeaf62fb67e1eac34a4acfbaa54052-98.jpg",
    "platform": "PC",
    "date": "October 25, 2005",
    "description": "Faster-Paced Fun - Gameplay has been streamlined for a tighter, faster, and more compelling experience.Greater Accessibility and Ease of Play - An easy-to-use interface will be immediately familiar to RTS and action game players, and newcomers to the series will be able to jump in and play. Tech Tree - Flexible Tech tree allows players more strategic choices for developing their civilizations along unique paths. More Civs, Units, and Improvements to enhance and grow your empire. Multiplayer -LAN, Internet, PBEM, and Persistent Turn-Based Server (PTBS) offer players all-new strategies and ways to play when competing or cooperating with live opponents. Team Play - Whether playing multiplayer or single player, team play offers a new way of setting locked alliances that result in shared wonder effects, visibility, unit trading, and shared territory that delivers a plethora of new strategic and tactical options. Civ IV comes to life! - Beautiful 3D world with dozens of fully animated units (including culturally unique units), and totally customizable armies. Cities and wonders will appear on the map. Wonder movies are back! [2K Games]",
    "score": "94"
  },
  {
    "id": "aa6aca33-d29d-4431-8d4d-7457719dff32",
    "title": "The Witcher 3: Wild Hunt",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/9/562c989431810e6aac45b6164ae0bfca-98.jpg",
    "platform": "PC",
    "date": "May 18, 2015",
    "description": "With the Empire attacking the Kingdoms of the North and the Wild Hunt, a cavalcade of ghastly riders,  breathing down your neck, the only way to survive is to fight back. As Geralt of Rivia, a master swordsman and monster hunter, leave none of your enemies standing. Explore a gigantic open world, slay beasts and decide the fates of whole communities with your actions, all in a genuine next generation format.",
    "score": "93"
  },
  {
    "id": "f9377791-79df-44d6-9611-c5a4a4ecceb5",
    "title": "Company of Heroes",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/4/8d178665cd9b57f9965453cc1a8fedc7-98.jpg",
    "platform": "PC",
    "date": "September 13, 2006",
    "description": "A real-time strategy game set in World War II, Company of Heroes brings to life, in full cinematic detail, the greatest war mankind has ever known. Company of Heroes is built on Relic's next-generation Essence Engine and also utilizes the Havok Physics engine, delivering cinematic visual detail in a world completely driven by realistic physics. Gamers will experience the journey of the brave men of Able Company in a deep single-player campaign that begins with the invasion of Normandy through their fight across Europe, all set against the most dynamic battlefield ever seen in a game. Company of Heroes' completely destructable environment means no two battles ever play out in the same way. Advanced squad AI delivers startling new realism and responsiveness, bringing soldiers to life as they interact with the environment and execute advanced squad tactics to eliminate the opposition forces. [THQ]",
    "score": "93"
  },
  {
    "id": "61762bef-e09f-4347-9d54-7faa442d8ba7",
    "title": "Half-Life: Alyx",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/4/559d5752e81e5bd977817d9de26bfe4b-98.jpg",
    "platform": "PC",
    "date": "March 23, 2020",
    "description": "Half-Life: Alyx is Valve's VR return to the Half-Life series. It's the story of an impossible fight against a vicious alien race known as the Combine, set between the events of Half-Life and Half-Life 2. Playing as Alyx Vance, you are humanity's only chance for survival. The Combine's control of the planet since the Black Mesa incident has only strengthened as they corral the remaining population in cities. Among them are some of Earth's greatest scientists: you and your father, Dr. Eli Vance. As founders of a fledgling resistance, you've continued your clandestine scientific activityperforming critical research, and building invaluable tools for the few humans brave enough to defy the Combine. Every day, you learn more about your enemy, and every day you work toward finding a weakness.\n\nABOUT GAMEPLAY IN VR:\n\nValve's return to the Half-Life universe that started it all was built from the ground up for virtual reality. VR was built to enable the gameplay that sits at the heart of Half-Life.\n\nImmerse yourself in deep environmental interactions, puzzle solving, world exploration, and visceral combat.\n\nLean to aim around a broken wall and under a Barnacle to make an impossible shot. Rummage through shelves to find a healing syringe and some shotgun shells. Manipulate tools to hack alien interfaces. Toss a bottle through a window to distract an enemy. Rip a Headcrab off your face and throw it at a Combine soldier.\n\nExtra content for Index owners\nCustomers who have purchased Valve Index hardware by the end of 2019 will have access to unique bonuses starting early next year:\n\n* Explore environments from Half-Life: Alyx in your SteamVR Home space\n* Alternate gun skins to embellish Alyx's arsenal\n* Special Half-Life: Alyx-themed content for Counter-Strike: Global Offensive and Dota 2\n\nCommunity-built environments\n\n* A set of Source 2 tools for building new environments will ship with the game, enabling any player to build and contribute new environments for the community to enjoy. Hammer, Valve's level authoring tool, has been updated with all of the game's virtual reality gameplay tools and components.",
    "score": "93"
  },
  {
    "id": "c74816a8-249c-46d4-b627-538aa6db5428",
    "title": "Divinity: Original Sin II",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/1/e7ec0efeb2d6f01d15c2254a395a3065-98.jpg",
    "platform": "PC",
    "date": "September 14, 2017",
    "description": "Master deep, tactical combat. Join up to 3 other players - but know that only one of you will have the chance to become a God.",
    "score": "93"
  },
  {
    "id": "e820ca55-ac74-419b-8760-b3bac778edf9",
    "title": "Unreal Tournament 2004",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/8/a6922b55f29ce22382e871976a6920f1-98.jpg",
    "platform": "PC",
    "date": "March 16, 2004",
    "description": "Reload, rev up and ride out. The new Tournament is faster, higher and meaner. Land and air based vehicles take combat to a new level; while an arsenal of new weaponry, daunting arenas and battlefields and the challenge of the Assault and Onslaught modes make the gladiator blood sport of the future a brand new experience. Buckle up; it?s gonna be one hell of a ride!  [Atari]",
    "score": "93"
  },
  {
    "id": "e90de0c8-51b6-4b90-9d31-384a36af8088",
    "title": "Starcraft II: Wings of Liberty",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/4/e3c315f435e55f897c4761d4fefc432e-98.jpg",
    "platform": "PC",
    "date": "July 27, 2010",
    "description": "StarCraft II continues the epic saga of the Protoss, Terran, and Zerg. These three distinct and powerful races clash once again in the fast-paced real-time strategy sequel to the legendary original, StarCraft. Legions of veteran, upgraded, and brand-new unit types do battle across the galaxy, as each faction struggles for survival. Featuring a unique single-player campaign that picks up where StarCraft: Brood War left off, StarCraft II presents a cast of new heroes and familiar faces in an edgy sci-fi story filled with adventure and intrigue. In addition, Blizzard again offers unparalleled online play through Battle.net, the company's world-renowned gaming service, with several enhancements and new features to make StarCraft II the ultimate competitive real-time strategy game. Features fast-paced, hard-hitting, tightly balanced competitive real-time strategy gameplay that recaptures and improves on the magic of the original game. New units and gameplay mechanics further distinguish each race. Vibrant new 3D-graphics engine with support for dazzling visual effects and massive unit and army sizes. Full map-making and scripting tools to give players incredible freedom in customizing and personalizing their gameplay experience. [Blizzard]",
    "score": "93"
  },
  {
    "id": "88b17370-98f7-4354-8644-529cdff5a507",
    "title": "Minecraft",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/2/0ec49754f864a372073dcc684094385d-98.jpg",
    "platform": "PC",
    "date": "November 18, 2011",
    "description": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes.",
    "score": "93"
  },
  {
    "id": "1b9b4783-df57-49d1-a893-42843202bdaa",
    "title": "Red Dead Redemption 2",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/6/ed4c1829d640cd58b8a6b9a82da58eaf-98.jpg",
    "platform": "PC",
    "date": "November 5, 2019",
    "description": "America, 1899. The end of the wild west era has begun as lawmen hunt down the last remaining outlaw gangs. Those who will not surrender or succumb are killed.\n\nAfter a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee. With federal agents and the best bounty hunters in the nation massing on their heels, the gang must rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal divisions threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang who raised him.\n\nFrom the creators of Grand Theft Auto V and Red Dead Redemption, Red Dead Redemption 2 is an epic tale of life in America at the dawn of the modern age.",
    "score": "93"
  },
  {
    "id": "899cda98-b015-455b-977d-8aeddf606f9b",
    "title": "Grand Theft Auto III",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/7/b0cddbca8fec88e94ec9269379a0d379-98.jpg",
    "platform": "PC",
    "date": "May 20, 2002",
    "description": "The PC version features enhanced 3D audio. Environmentally scaled and referenced from the player's perspective. Create your own customizable Liberty City radio station, using the built-in mp3 player. State-of-the art visuals utilizing the latest PC hardware render the city more beautifully than ever in 32 bit color. The skinnable player character enables fans to create and upload their own skin textures and to use a scanned-in photo to play as themselves. [Rockstar]",
    "score": "93"
  },
  {
    "id": "2079a678-b496-44c8-83ca-87ad7b62aff8",
    "title": "Homeworld",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/4/a005b637a637d3628b66c5b23e7c2573-98.jpg",
    "platform": "PC",
    "date": "August 31, 1999",
    "description": "Deported to a harsh desert world, exiles have struggled for three thousand years to regain the stars. Now it's up to you to guide them home through a brutal empire bent on annihilation. Homeworld boasts amazing ship graphics and gorgeous deep-space vistas, a unique command and navigation interface and white-knuckle real-time strategy. [Sierra]",
    "score": "93"
  },
  {
    "id": "010b7c4e-1f13-4433-b87e-a6150984fda4",
    "title": "Star Wars: Knights of the Old Republic",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/9/fa5c67e8ea63a4c14cdacc9555accc60-98.jpg",
    "platform": "PC",
    "date": "November 18, 2003",
    "description": "Engage in this saga set in the Golden Age of the Republic - over 4,000 years before the first Star Wars film, when both Jedi and Sith number in the thousands. With the Galaxy reeling from a recent conflict with the Dark Lords, the ongoing battle between the Jedi and the Sith rages on. Your actions determine the outcome of this colossal galactic war - and your destiny as a Jedi. [LucasArts]",
    "score": "93"
  },
  {
    "id": "64ef8e70-7e4b-4f07-ab26-0aa1739a1b80",
    "title": "World of Warcraft",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/3/c3383580eb989c3596326f861f063786-98.jpg",
    "platform": "PC",
    "date": "November 23, 2004",
    "description": "Four years have passed since the aftermath of Warcraft III: Reign of Chaos, and a great tension now smolders throughout the ravaged world of Azeroth. As the battle-worn races begin to rebuild their shattered kingdoms, new threats, both ancient and ominous, arise to plague the world once again. World of Warcraft is an online role-playing experience set in the award-winning Warcraft universe. Players assume the roles of Warcraft heroes as they explore, adventure, and quest across a vast world. Being \"Massively Multiplayer,\" World of Warcraft allows thousands of players to interact within the same world. Whether adventuring together or fighting against each other in epic battles, players will form friendships, forge alliances, and compete with enemies for power and glory. A dedicated live team will create a constant stream of new adventures to undertake, lands to explore, and monsters to vanquish. This content ensures that the game will never be the same from month to month, and will continue to offer new challenges and adventures for years to come. [Blizzard Entertainment]",
    "score": "93"
  },
  {
    "id": "e800ba97-f3ef-4614-ba6e-c508c279690b",
    "title": "Grand Theft Auto: San Andreas",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/8/e7d44e60edd389e2916aa2bf9e5331bd-98.jpg",
    "platform": "PC",
    "date": "June 7, 2005",
    "description": "Five years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. Now, it's the early 90s. Carl's got to go home. His mother has been murdered, his family has fallen apart and his childhood friends are all heading towards disaster. On his return to the neighborhood, a couple of corrupt cops frame him for homicide. CJ is forced on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets. [Rockstar]",
    "score": "93"
  },
  {
    "id": "be83608c-f49c-45f5-8a21-d03acc6b6f1d",
    "title": "Call of Duty 4: Modern Warfare",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/5/bdbee338493df7d9024ef31a95bdeff9-98.jpg",
    "platform": "PC",
    "date": "November 5, 2007",
    "description": "As Call of Duty 4: Modern Warfare's single player campaign unfolds, the player is introduced to new gameplay at every turn – one moment you are fast-roping from your Black Hawk helicopter after storming into the war zone with an armada of choppers, the next you are a sniper, under concealment, in a Ghillie suit miles behind enemy lines, the next you are engaging hostiles from an AC-130 gunship thousands of feet above the battlefield. Mixed with explosive action, Call of Duty 4: Modern Warfare also delivers special effects, including use of depth of field, rim-lighting, character self-shadowing, real time post-processing, texture streaming as well as physics-enabled effects. Infinity Ward deployed a dedicated team from the start to deliver a new level of depth to multiplayer. Building on the hit \"Call of Duty 2\" online experience, Call of Duty 4: Modern Warfare's new multiplayer provides the community an addictive and accessible experience to gamers of all levels. [Activision]",
    "score": "92"
  },
  {
    "id": "c79a647a-d72b-42b7-8381-f96106317876",
    "title": "Microsoft Flight Simulator",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/8/f41c89f11e6eadc4b934fcd6504a0800-98.jpg",
    "platform": "PC",
    "date": "August 18, 2020",
    "description": "From light planes to wide-body jets, fly highly detailed and accurate aircraft in the next generation of Microsoft Flight Simulator. Test your piloting skills against the challenges of night flying, real-time atmospheric simulation and live weather in a dynamic and living world.",
    "score": "92"
  },
  {
    "id": "0f02bc22-a88f-4035-9b07-35ded395ef14",
    "title": "Warcraft III: Reign of Chaos",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/1/381270905624fa84865e1fe874eb8eb5-98.jpg",
    "platform": "PC",
    "date": "July 3, 2002",
    "description": "[Metacritic's 2002 PC Game of the Year] It has been nearly fifteen years since the war between the orcs and humans ended. An uneasy peace settled over the land while, for years, the drums of war were silent. Yet the kingdoms of men grew complacent in their victory - and slowly, the defeated orcish clans regrouped under the banner of a new visionary leader. Now a darker shadow has fallen over the world, threatening to extinguish all life - all hope. The drums of war play upon the winds once again - rising urgently towards the inevitable hour when the skies will rain fire - and the world will tremble before the coming of the Burning Legion. The Day of Judgment has come... [Blizzard]",
    "score": "92"
  },
  {
    "id": "6109ed99-3475-4a49-bd5c-b4535c2a14d6",
    "title": "The Sims",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/0/d5141262ae8d42c853a26d370d0398eb-98.jpg",
    "platform": "PC",
    "date": "February 4, 2000",
    "description": "In \"SimCity,\" you had the power to build and control cities ... with The Sims, you'll create and control people!",
    "score": "92"
  },
  {
    "id": "c787bf61-0c16-4257-a00d-7642803e3511",
    "title": "Sid Meier's Gettysburg!",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/2/36c9df22d3203a49b8d1f56422d701e3-98.jpg",
    "platform": "PC",
    "date": "September 30, 1997",
    "description": "Experience victory in Sid Meier's Gettysburg! It's the most engrossing and sophisticated real-time strategy game ever. In a stunning 3D battlefield, you plan the tactics, lead the troops, and take history into your own hands. Attack from the trees to protect your brigade,rally around a General for a quicker recovery, entrench your troops as your cannons blast the hillside, and much, much more with just a click of the mouse! Complete multiplayer support via internet, LAN, modem and serial link. [Firaxis]",
    "score": "92"
  },
  {
    "id": "4882b506-93ff-452f-92e6-355d217d26c3",
    "title": "World Soccer Winning Eleven 7 International",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/6/98957a2e03ecc41b18c8054e8e15193a-98.jpg",
    "platform": "PC",
    "date": "April 9, 2004",
    "description": "Winning Eleven 7 International features 100 teams, 21 stadiums, new player models and key additions to the Master League. Winning Eleven 7 also utilizes a custom designed engine that allows for great flexibility and customization. Upon entering a match, players will find incredibly masterful gameplay, beautifully rendered stadiums and picture-perfect player models. While on the field, players will experience true-to-life gameplay, with carefully tuned A.I., realistic pace and balance. [Konami]",
    "score": "92"
  },
  {
    "id": "3fdc6a82-27e5-4f07-b12c-2aba8da95eb9",
    "title": "Team Fortress 2",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/6/43275793dfcefd238b98ee2d88939192-98.jpg",
    "platform": "PC",
    "date": "October 10, 2007",
    "description": "Team Fortress 2 (TF2) is the sequel to the game that put class-based, multiplayer team warfare on the map. TF2 delivers new gametypes, a signature art style powered by Valve’s next generation animation technology, persistent player statistics, and more. Unlike other \"class-based\" games that offer a variety of combat classes only, Team Fortress 2 packs a wild variety of classes which provide a broad range of tactical abilities and personalities, and lend themselves to a variety of player skills. Play as the flame-throwing Pyro, the room clearing Heavy, or the Spy, a master of disguises. Other classes include: Scout, Sniper, Medic, Engineer, Demoman, or Soldier. TF2 features the most advanced graphics of any Source-based game released to date – and the most exciting class-based action ever created. [Valve]",
    "score": "92"
  },
  {
    "id": "2173edea-52f5-4411-a61b-19f2ecb5f880",
    "title": "System Shock 2",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/3/41829351f4d06d0cc356218ddbd8f99d-98.jpg",
    "platform": "PC",
    "date": "August 11, 1999",
    "description": "Like System Shock 1, there will be persistent levels (i.e., drop an item on one level, and you could go back later to retrieve it), gameplay elements like logs, inventory, skills, persistent world, leaning, hacking, rpg elements, multiple weapons and enemies, and a compelling storyline. Unlike most other first person shooters, the purpose of System Shock was not to kill everything in sight; nor was it a \"find the key to move onto the next level\" game. The plot was always present, but not so confining as in traditional shooters - there was almost always more than one task to accomplish. Levels were realistically designed and had logical reasons behind them. It is the principle of System Shock 2 to continue this game design. [sshock2.com]",
    "score": "92"
  },
  {
    "id": "1efe7f8e-e16c-4f69-af93-68fec45503c3",
    "title": "Tom Clancy's Splinter Cell: Chaos Theory",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/2/b775d7f8b057751ca5cf185373d69095-98.jpg",
    "platform": "PC",
    "date": "March 28, 2005",
    "description": "The year is 2008. Information Warfare has evolved into the most dangerous threat to global stability. You are Sam Fisher, Third Echelon's most skilled Splinter Cell operative. You are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks, originating in North Korea. To succeed, you will employ a host of unconventional counterintelligence activities to gather intel, disrupt enemy operations and neutralize adversary targets. As Information Warfare evolves, so must the Splinter Cell. You must penetrate deeper into hostile territory and operate undetected, closer to the enemy than ever before. At your disposal is a lethal array of tactics ranging from Combat Knife techniques, experimental prototype weapons skills, and more radical hand-to-hand techniques such as the Inverted Chokehold. Experience the thrill of acting as a lone operative fighting tomorrow's threats in the field, and of cooperating online with a partner to accomplish crucial missions. Die in action, and the free world dies with you. Never-before-seen graphics technology offers the best visuals ever to appear on any platform. Advanced physics engine allows rag doll physics, particle effects and perfect interaction with the environment. The most complete arsenal of weapons and gadgets, from the combat knife to experimental prototype combat systems. Totally open level design with multipaths and optional secondary objectives. [Ubisoft]",
    "score": "92"
  },
  {
    "id": "2d7dc0b8-92ce-4a62-907c-edeced1c208b",
    "title": "Rome: Total War",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/8/ad55d9788ea13dda7e5bb26cc91bebb5-98.jpg",
    "platform": "PC",
    "date": "September 22, 2004",
    "description": "Rome: Total War is the next generation in epic strategy gaming from the critically acclaimed and award winning Total War brand. The aim of the game is to conquer, rule and manipulate the Roman Empire with the ultimate goal of being declared as the \"Imperator\" of Rome. Set in a time when the mighty Roman Empire emerged to conquer the known world against powerful enemies; when gladiators fought to a bloody death in the Coliseum; when Spartacus defied the might of the empire; when Hannibal led his invincible army and his war elephants across the Alps to strike fear into the very heart of Rome itself; and when Julius Caesar finally smashed the Barbarian Gauls. This was a time of brutal confrontation between civilisation and barbarism, and of civil war as the ancient world's only superpower turned on itself. A completely new Total War engine uses innovative technology and groundbreaking design to bring the world of ancient Rome to life to deliver the biggest and most cinematic battles ever seen in a videogame. So the battles in Rome: Total War maintain the epic scale that fans of Total War are used to, but now use high-detailed 3D polygonal troops and allows huge cities to be displayed on the battlefields. The result is truly spectacular. [Activision]",
    "score": "92"
  },
  {
    "id": "822f4974-bb12-4e96-83e5-2e7c1e52a0a2",
    "title": "Okami HD",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/8/4840cbe31219f39af4ce81a303277449-98.jpg",
    "platform": "PC",
    "date": "December 12, 2017",
    "description": "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.",
    "score": "92"
  },
  {
    "id": "fd8ebdd6-dcd9-4268-8713-6fc97a0dd885",
    "title": "Undertale",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/3/abeb761486bf180fe9ed3ab6c6a2d793-98.jpg",
    "platform": "PC",
    "date": "September 15, 2015",
    "description": "Welcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever.",
    "score": "92"
  },
  {
    "id": "e9560ddb-6818-4346-8ca5-649a0bf7a586",
    "title": "Thief: The Dark Project",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/8/5ad714bbb546e18712d102ff186a860c-98.jpg",
    "platform": "PC",
    "date": "November 30, 1998",
    "description": "Sneak through the shadows of 12 treacherous missions including haunted cathedrals, subterranean ruins, and forbidding prisons, in a dark and sinister city. Stalk your prey on the quest for stolen goods with your blackjack, sword and an assortment of unique arrows. Steal for money and uncover the hidden agendas of your allies and enemies as you play through an unravelling story of deception and revenge. Survive in a world where shadows are your only ally, trust is not an option, and confrontation results in death! [Eidos Interactive]",
    "score": "92"
  },
  {
    "id": "c116d39f-2f66-4468-a0e0-248abe5f9be3",
    "title": "Age of Empires II: The Age of Kings",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/9/53abcfcadb6f434b568c2796266719c1-98.jpg",
    "platform": "PC",
    "date": "September 30, 1999",
    "description": "Age of Empires II: The Age of Kings is the sequel to the award-winning, best-selling real-time strategy game \"Age of Empires.\" Age of Empires II spans a thousand years, from the fall of Rome through the Middle Ages in which players lead one of 13 civilizations into greatness. The game keeps the epic scope of Age of Empires' game play while evolving the combat and economic features. [Microsoft]",
    "score": "92"
  },
  {
    "id": "9c0f82ac-69b5-40b1-bdb9-203b6e5c03a3",
    "title": "Unreal Tournament (1999)",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/7/357f319f140dffaa47e3750dda02411e-98.jpg",
    "platform": "PC",
    "date": "November 30, 1999",
    "description": "The stakes are high. On the one hand, fame, fortune, glory; on the other hand, death. Prove your skill in the arenas of the future, leading your team of computer-controlled \"bots\" to victory in the Grand Tournament, or compete with the best of the best via LAN or the Internet in seat-of-your-pants battles. While Unreal Tournament offers the finest in classic \"Deathmatch\" play, right out of the box you can compete in Team Deathmatch or Capture the Flag. Control strategic points on the map to rack up your score in Domination, or test your skills in Assault, as one team defends its base from the other. Each game type comes with its own special maps and rules, for never-ending variety and challenge. Add gameplay mutators such as Jump Match or InstaGib, and Unreal Tournament will keep your wits honed to a razor edge. [Infogrames]",
    "score": "92"
  },
  {
    "id": "0665680a-ab9f-453c-8364-be3b378e57a1",
    "title": "Sid Meier's Alpha Centauri",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/5/a03b34d6914545e009e220641c077282-98.jpg",
    "platform": "PC",
    "date": "February 12, 1999",
    "description": "Legendary designer Sid Meier presents the next evolution in strategy games, with the most addictive, compelling gameplay yet. Explore the alien planet that is your new home and uncover its myriad mysteries. Discover over 75 extraordinary technologies. Build over 60 base upgrades and large-scale secret projects for your empire. Conquer your enemies with a war machine that you design from over 32,000 possible unit types. [Firaxis]",
    "score": "92"
  },
  {
    "id": "842b44db-acfa-4a13-8c9a-3f48d0d3c54d",
    "title": "Galactic Civilizations II: Twilight of the Arnor",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/5/2237ad0c25e6f081fa3fcbd5260c101b-98.jpg",
    "platform": "PC",
    "date": "April 30, 2008",
    "description": "The galaxy is being consumed by the fires of war as we enter the final act of the Dread Lord saga. Galactic Civilizations II: Twilight of the Arnor is the second  expansion pack to the award-winning PC strategy game, Galactic Civilizations II. Galactic Civilizations II: Twilight of the Arnor expands the gameplay of Galactic Civilizations in all new ways. New campaign detailing the final chapter in the Dread Lords wars. The Terror Star arrives, capable of destroying any star. Unique technology trees for all 12 civilizations. Unique planetary improvements for each civilization. New 3D engine powered map editor. New Scenario Editor for creating highly detailed custom games. New Campaign Editor for players who want to create their own custom epic campaigns for themselves or to share with others. New Metaverse Tournaments: Specific maps & scenarios recorded to the Metaverse with prizes for top players. [Stardock]",
    "score": "92"
  },
  {
    "id": "3e72e6b4-fbd8-4b4a-9823-c27915dc8759",
    "title": "Out of the Park Baseball 17",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/9/45b933dc76a6cf61d28f6bee4e6be5cd-98.jpg",
    "platform": "PC",
    "date": "March 22, 2016",
    "description": "Step into the shoes of a team owner, GM, and/or field manager to own the future or rewrite the past of your favorite real-world club. Start a new career with 2016 Opening Day rosters of the real major or minor leagues, or span through 150 years of history and run any club from the past! Perform drafts, trades, scouting, waivers, team finances and personnel. Negotiate player contracts. Dive into the more hands-on management and set your team's lineups, pitching staffs, and in-game strategy. You can oversee your league at a high level, or play out each game, managing play by play or even pitch by pitch!",
    "score": "92"
  },
  {
    "id": "13cb92c2-f7af-4a1c-9b92-2342300d841b",
    "title": "The Witcher 3: Wild Hunt - Blood and Wine",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/9/5d5a7a9179be279cd4026f1e2e46fea5-98.jpg",
    "platform": "PC",
    "date": "May 30, 2016",
    "description": "This expansion pack is an old-school add on with 20 hours of new adventures, where players will travel to the land of Toussaint.",
    "score": "92"
  },
  {
    "id": "c6967d28-0e32-429d-880a-b3a9a3f507af",
    "title": "Tiger Woods PGA Tour 2003",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/1/57208b2108584c00b71e2e81f098d962-98.jpg",
    "platform": "PC",
    "date": "October 31, 2002",
    "description": "New course lineup: Twelve detailed courses include Pebble Beach Golf Links, TPC of Scottsdale and Torrey Pines South. New effects: Feel the sun, the wind, the fog and the grass as you walk 18. The most PGA TOUR pros: Play as or against Tiger Woods, Ty Tryon, Vijay Singh, Brad Faxon and many others. TrueSwing technology: Take full control over your swing, from straight drives to hooks and draws. Career mode: Purchase new equipment and lessons, hone your skills, and make your way to the top of the career rankings. [EA Sports]",
    "score": "92"
  },
  {
    "id": "676e2051-6430-485b-a71e-43655213f5d5",
    "title": "Dishonored",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/2/5579c6cdb4efaaab0dc07abaa4bf6644-98.jpg",
    "platform": "PC",
    "date": "October 8, 2012",
    "description": "Approach each assassination with your own unique style. Use shadow and sound to your advantage to traverse silently through levels unseen by enemies, or attack foes head-on as they react to your aggression. The malleable combat system allows you to creatively synthesize your abilities, supernatural powers and gadgets as you negotiate your way through the levels and dispatch your targets. Improvise and adapt to define your modus operandi.",
    "score": "91"
  },
  {
    "id": "a708c4e8-a17f-4173-98ca-3b2b227bcd46",
    "title": "Medal of Honor: Allied Assault",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/9/59b0a16eb0c85a314d5dcafc20cd34f7-98.jpg",
    "platform": "PC",
    "date": "January 20, 2002",
    "description": "As Lt. Mike Powell, member of the famed 1st Ranger Battalion, you'll battle through over 20 levels based on historical military campaigns of World War II. Fire period weapons and command authentic war vehicles as you silence the gun batteries at Port Arzew, survive the Omaha Beach landing, and more. [Electronic Arts]",
    "score": "91"
  },
  {
    "id": "809918d3-9dc1-4076-836a-b81e84b0f288",
    "title": "Myth: The Fallen Lords",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/0/9b2b57cbbfdff713e41d1498f6ae05e0-98.jpg",
    "platform": "PC",
    "date": "October 31, 1997",
    "description": "Myth is arguably the first real-time strategy game to put the player in a true 3D landscape, with an emphasis on tactical battlefield action rather than base construction. Myth also happens to be one of Bungie's most successful pre-Halo releases, and shows off the company's range and ability in genres outside of first-person shooters. A single player mode features an engrossing and enjoyable plot, with you battling the evil and eponymous Fallen Lords, their evil leader, Balor and all manner of undead creatures, but Myth's multiplayer is where it really stands out. Bungie.net's game-matching technology has been much-emulated since, and at Myth's release, was something truly special. Multiple game modes including King of the Hill, Steal the Bacon and even co-op added huge variety to what was an outstanding and standard-setting game - and it still is. If ever an older game deserved another visit, it's Myth, with a huge, loyal and highly motivated following. [Bungie]",
    "score": "91"
  },
  {
    "id": "827b6dcd-8052-4f3c-9d10-7ba00c49080e",
    "title": "World of Warcraft: Wrath of the Lich King",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/5/e6f4d1b934f771c4f48823d5d560c051-98.jpg",
    "platform": "PC",
    "date": "November 13, 2008",
    "description": "Players last visited Northrend in \"Warcraft III: The Frozen Throne,\" when Arthas Menethil fused with the spirit of Ner’zhul to become the Lich King, one of the most powerful beings in the Warcraft universe. He now broods atop the Frozen Throne deep in Icecrown Citadel, clutching the rune blade Frostmourne and marshaling the undead armies of the Scourge. In Wrath of the Lich King, the forces of the Alliance and the Horde venture into battle against the Scourge amid Northrend’s howling winds and fields of jagged ice. Wrath of the Lich King adds a rich variety of content to an already massive game. New features in the game’s second expansion include: Death Knight Hero Class: Create a high-level Death Knight character -- the game’s first hero class -- once certain challenges have been met. Increased Level Cap: Advance to level 80 and gain potent new talents and abilities along the way. Northrend: Explore the harsh new continent of Northrend, packed with new zones, quests, dungeons, monsters, and items -- and do battle with the undead armies of the Lich King. \"Inscription\" Profession: Learn this exciting new profession and gain unique ways to permanently enhance spells and abilities in the game. Siege Weapons and Destructible Buildings: Take the battle to another level with new player-vs.-player game mechanics and new battlefields to wage war on. New Character Customization: Change how characters look and express themselves, with different hairstyles and dance animations. [Blizzard Entertainment]",
    "score": "91"
  },
  {
    "id": "2ad17838-5cd0-4fc9-af55-4a0f2a394857",
    "title": "Overwatch",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/5/5b4b131363a4dba40e923bb8f788d56e-98.jpg",
    "platform": "PC",
    "date": "May 23, 2016",
    "description": "Overwatch is a highly stylized team-based shooter set on earth in the near future. Every match is an intense multiplayer showdown pitting a diverse cast of soldiers, mercenaries, scientists, adventurers, and oddities against each other in an epic, globe-spanning conflict.",
    "score": "91"
  },
  {
    "id": "183de118-2058-44b1-bf26-c0e62d48796a",
    "title": "F1 Challenge '99-'02",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/2/b87a595e7008b848233fa3ef6cb517b0-98.jpg",
    "platform": "PC",
    "date": "June 24, 2003",
    "description": "Cutting-edge technology brings you the most accurate representation of Formula One to date. High-resolution car models include details right down to the very last shut line. Circuits include real life structures, helicopters, airplanes, panoramic skies, animated grid girls, motion captured pit crews, and even bumps in the track surface as they exist in reality. The glossy team-themed user interface puts you in the game and tracks your performance as a real life driver competing against the likes of world champion drives such as Damon Hill, Jacques Villeneuve, Mika Hakkinen, and Michael Schumacher. [Electronic Arts]",
    "score": "91"
  },
  {
    "id": "34471c82-f397-489b-98d5-db1242b2794f",
    "title": "Baldur's Gate",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/2/89a0525888498746e946d4df9faeb383-98.jpg",
    "platform": "PC",
    "date": "December 21, 1998",
    "description": "Baldur's Gate takes you back to the Forgotten Realms on a visually dazzling role-playing adventure, one that brings to life the grand tradition of Advanced Dungeons & Dragons through cutting edge art and technology. Immerse yourself in this quintessential medieval fantasy world, where entire nations hang in the balance of your actions, dark prophecies test your resolve, and heroic dreams can be fulfilled at last. [Interplay]",
    "score": "91"
  },
  {
    "id": "802a69a8-c5f0-4dde-bd57-e38411f56120",
    "title": "IL-2 Sturmovik",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/0/9370bb068a74c8c81a364fc7a4244318-98.jpg",
    "platform": "PC",
    "date": "November 18, 2001",
    "description": "Fly 31 types of Russian, German and American planes. Engage in air-to-air and air-to-ground battles. Multiplay with up to 32 players in dogfight and 16 players in cooperative missions. Use custom paint schemes, squadron nose art, numbering on wings, and national markings for each plane. [Ubi Soft]",
    "score": "91"
  },
  {
    "id": "97e2af5c-f11c-4770-8a27-54c6c2969150",
    "title": "FreeSpace 2",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/3/28edf758857984205ae5ad2aa0edeac0-98.jpg",
    "platform": "PC",
    "date": "September 30, 1999",
    "description": "The year is 2367. Thirty-two years have passed since the Great War. As Terrans and Vasudans struggle to rebuild their civilizations, civil war erupts in the Polaris system. A rogue Terran admiral declares war against the Vasudans, threatening the stability of the Alliance. Without warning, the Shivans return, and Terrans and Vasudans face annihilation at the hands of their Great War nemesis. [Interplay]",
    "score": "91"
  },
  {
    "id": "d62aabfd-847b-436d-a2f2-8e9bf72b3244",
    "title": "Metal Gear Solid V: The Phantom Pain",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/7/d8b2de900bfedc50c2c378ffae8c0823-98.jpg",
    "platform": "PC",
    "date": "September 1, 2015",
    "description": "The Soviet invasion of Afghanistan has brought a new edge to the Cold War, and in 1984, a one-eyed man with a prosthetic arm appears in the country. Those who know him call him Snake; the legendary mercenary who was once swept from the stage of history and left in a coma by American private intelligence network Cipher. Snake is accompanied by Ocelot, an old friend who saved him from attack when he finally awoke.\n\nNow, Snake's former partner Kazuhira Miller is being held by the Soviet forces in Afghanistan. Snake must undertake a solo mission to rescue Miller and prove to the world that the legendary mercenary is not dead and gone. That first step will lead to a path of vengeance against the very Cipher that slaughtered so many of Snake's men, and to a battle that will embroil the whole world...\n\nWhat started in Ground Zeroes must finish with \"V\".",
    "score": "91"
  },
  {
    "id": "bdd25936-b9e3-4df6-924c-b640ee51085b",
    "title": "Tom Clancy's Splinter Cell",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/9/2a08ba78f40d57d58995a4eef384bbcd-98.jpg",
    "platform": "PC",
    "date": "February 19, 2003",
    "description": "Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace! You are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyber terrorism and international tensions are about to explode into WWIII. [Ubi Soft]",
    "score": "91"
  },
  {
    "id": "16760bb2-54af-42f4-9549-c21af3486580",
    "title": "Kentucky Route Zero - Act III",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/2/b868aaf076b781319567ab421b7dcea3-98.jpg",
    "platform": "PC",
    "date": "May 6, 2014",
    "description": "Kentucky Route Zero is a magical realistic adventure game about a secret highway in the caves beneath Kentucky, and the mysterious folks who travel it.",
    "score": "91"
  },
  {
    "id": "9091a75e-3d77-46c2-b466-627edb8ecc1b",
    "title": "Crysis",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/8/3c939b96b0aac4a8338e6e49e16fddcd-98.jpg",
    "platform": "PC",
    "date": "November 13, 2007",
    "description": "Crysis is a next-generation PC first-person shooter from Crytek, the award-winning developers of \"Far Cry.\" It is 2020, and global tensions have reached boiling point as the U.S. and North Korea square off in the South China Sea. At stake: a mysterious artifact uncovered by a team of U.S. archeologists. The North Korean government quickly seizes the area, prompting the U.S. to dispatch an elite team of Delta Force operatives on a rescue mission. During the siege the true nature of the artifact quickly emerges, pointing to the existence of an alien presence on Earth, and ultimately the trigger for a massive-scale alien invasion. The battle to save Earth begins as the aliens' flash freeze the tropics into a ghostly-white frozen landscape. As gamers take up arms against the aliens, they will be outfitted with customizable weapons and a high tech Nanosuit, allowing them to adapt their tactics and abilities to a hostile, ever-changing environment and a mysterious enemy. [Electronic Arts]",
    "score": "91"
  },
  {
    "id": "7c0847c6-652a-4446-a83c-671a970c5182",
    "title": "World of Warcraft: The Burning Crusade",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/0/80fe059db5aa8bca4d200f2f385e15b3-98.jpg",
    "platform": "PC",
    "date": "January 16, 2007",
    "description": "Several years have passed since the Burning Legion's defeat at Mount Hyjal and the races of Azeroth have continued to rebuild their once shattered lives. With renewed strength, the heroes of the Horde and Alliance have begun to explore new lands and broken through the Dark Portal to investigate the realms beyond the known world. Will these heroes find friends or foes? What dangers and rewards lie in wait beyond the Dark Portal? And what will they do when they discover that the demons they thought vanquished have returned to renew their terrible Burning Crusade? New Player Races: New allies will join the game, expanding the story line and allowing players to develop powerful new characters within the world. Higher Level Limit: The game's level cap is being raised to 70, and with these new levels will come meaningful spell, ability, and talent upgrades for each character class. New Lands and Battlegrounds: Explore the magical realms of the Blood Elves and Draenei, journey through the Dark Portal into untamed Outland, and visit dungeons and battlefields previously inaccessible to players. \nFlying Mounts: In Outland, players will gain access to unique airborne mounts that will allow for smoother travel over some of that region's more hazardous terrain. [Blizzard]",
    "score": "91"
  },
  {
    "id": "3f56d7dc-94ff-4f39-93db-f341ff3669f7",
    "title": "Tiger Woods PGA Tour 2005",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/0/55232607853540318e597a2ea2a38c99-98.jpg",
    "platform": "PC",
    "date": "September 20, 2004",
    "description": "TigerProofing is a revolutionary course-altering system that allows players to modify course dynamics and create the most intensely competitive course imaginable. Alter tee-box length, width and patterns on fairways and greens, the depth of a greenside bunker, and even the color of the leaves on the trees, course moisture and the season which you play. Take on the legends of golf including Arnold Palmer, Jack Nicklaus, and Ben Hogan and become a legend yourself! EA SPORTS GameFace II: The industry-leading GameFace technology just got a whole lot deeper with more control and freedom to express your creative vision from a youthful prodigy to a grizzled old veteran. Eight new licensed courses and two new fantasy courses have been added for a total of 14 courses. New licensed courses for console only include Coeur d?Alene and Colonial Country Club. New licensed courses for both console and PC include, Sherwood Country Club, Fancourt Golf Club Estate and Troon North ? Monument Course. Compete as or against 15 different PGA TOUR players including Tiger Woods, John Daly, Vijay Singh, Charles Howell III, Notah Begay III, and Jesper Parnevik, among others. Total Precision Swing: New putting and chipping systems allow for more control on the green or when you leave an approach shot short. [EA Sports]",
    "score": "91"
  },
  {
    "id": "69f0d6ce-f6d4-4313-a06c-f2bbb3ed9397",
    "title": "The Longest Journey",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/5/b44be7322174200948fe9e637f5442f0-98.jpg",
    "platform": "PC",
    "date": "November 16, 2000",
    "description": "An epic 3-D adventure spanning over 150 unique locations across two distinct and detailed worlds.  [Funcom]",
    "score": "91"
  },
  {
    "id": "6e25df45-f7d0-4253-9eb4-c33f3bc65a81",
    "title": "Tony Hawk's Pro Skater 2",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/5/dc8a89f090bd0ee5cc549dc9b88657bf-98.jpg",
    "platform": "PC",
    "date": "October 25, 2000",
    "description": "Players can choose to skate with the skills of Tony Hawk, the most legendary pro of all time, or as one of 12 pro skaters from the star-studded lineup. The game's intuitive and solid control scheme allows players to perform hundreds of tricks in a variety of realistic, obstacle-filled, real-world locations.  [Activision]",
    "score": "91"
  },
  {
    "id": "9012606c-9f88-4e35-bb55-24fac4510f51",
    "title": "Star Wars Jedi Knight: Dark Forces II",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/9/0a39b899979832d09ceb4a824d68532a-98.jpg",
    "platform": "PC",
    "date": "October 9, 1997",
    "description": "In Dark Forces, Kyle Katarn, a young mercenary successfully infiltrated the Empire. Jedi Knight continues the story of Katarn as he embarks on a quest into his past and learns the mysterious ways of the Jedi. With this knowledge, he must stop seven Dark Jedi from unlocking the powers of a hidden Jedi burial ground. This task forces Katarn to decide his destiny. If he chooses the Dark side, he will come into enormous power. If he chooses the Light side, he faces seemingly insurmountable evil. Whatever path Katarn chooses will change the face of the galaxy forever. [LucasArts]",
    "score": "91"
  },
  {
    "id": "bbf27fa9-9fcc-4125-8656-deda6cdb4dc8",
    "title": "Batman: Arkham Asylum",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/5/8c0d025f0ad5d0f625717b6806ed0afc-98.jpg",
    "platform": "PC",
    "date": "September 15, 2009",
    "description": "In Batman: Arkham Asylum, the player assumes the role of Batman as he delivers The Joker to Arkham Asylum. There, the imprisoned super-villains have set a trap and an immersive combat gaming experience unfolds. With an original script penned by Emmy Award-winning Batman writer Paul Dini, the game brings the universe of DC Comics' detective to life with stunning graphics. Batman: Arkham Asylum offers players the chance to battle Gotham's worst villains with Batman's physical and psychological strength in a graphically distinct and story-driven game. [Eidos Interactive]",
    "score": "91"
  },
  {
    "id": "556df194-d59f-4395-a072-836538c730f3",
    "title": "Galactic Civilizations II: Dark Avatar",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/9/3b8103a58f6e6d78d742145bf443e665-98.jpg",
    "platform": "PC",
    "date": "February 14, 2007",
    "description": "The year is 2226 and the Drengin Empire reigns supreme across the galaxy. But something utterly evil is devouring the Drengin Empire from within. Expand your Galactic Civilizations II experience with espionage agents, player designed opponents, new alien races, new ships, unique planetary environments, asteroid fields, improved graphics and much more. [Stardock]",
    "score": "91"
  },
  {
    "id": "5ae27cff-255f-4a5d-a8af-015a2232796f",
    "title": "The Operative: No One Lives Forever",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/2/1f7c2ccc2c4abbaba7e9d247ea9d75c2-98.jpg",
    "platform": "PC",
    "date": "November 11, 2000",
    "description": "A story-driven, first-person adventure delivering over-the-top action, tense subterfuge, outrageous villains, and wry humor in the tradition of the great 1960's spy films and TV shows. [Fox Interactive]",
    "score": "91"
  },
  {
    "id": "cf3035dd-3f9a-4a49-bba9-495c127f0fb3",
    "title": "Battlefield 2",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/1/d2f0e4e5cdb9eec66e1a8e5dcc7f9cf4-98.jpg",
    "platform": "PC",
    "date": "June 21, 2005",
    "description": "In Battlefield 2, players will choose to fight for one of three military superpowers: the United States, China, or the newly formed Middle East Coalition. Armed with the latest modern weaponry, players can take control of any of the game's 30+ vehicles to engage in major conflicts with over 100 players in some of the largest online battles on the PC. Battlefield 2 features immense, richly detailed, destructible environments, from city streets to remote forests, in some of the most notorious hot spots around the world. Each map in Battlefield 2 adjusts in scale to support the number of players in the world, providing the ideal vehicle-to-player ratio and an optimized game play experience.  Enhanced team play features allow players to enter the action on the front lines as part of a formal squad, or work behind the scenes in Commander Mode to direct the strategic assaults of their teammates.  With in-game success, players increase their rank from recruit all the way to General and unlock awards, including new weapons, vehicle decals, medals, and more. Additionally, Battlefield 2 showcases an all-new game engine and physics system to bring the modern battlefield to life like never before. The new material penetration feature measures weapons' ability to fire through barriers based on their composition and players will need to know the difference between concealment and cover in order to survive. [Electronic Arts]",
    "score": "91"
  },
  {
    "id": "79969e4e-4017-467e-9581-0b2b43d38f05",
    "title": "Street Fighter IV",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/7/320de58b94d10aaf7cd7999d2016b2a2-98.jpg",
    "platform": "PC",
    "date": "July 1, 2009",
    "description": "At the completion of the second World Warrior Tournament, the Shadaloo crime syndicate was left in ruins, its grandmasters defeated and scattered to the winds. Now, the mysterious Seth, CEO of the S.I.N. Corporation, has set up yet another tournament and invited a blend of old friends and new faces to battle again for the title of the world's strongest. With 25 characters (including the original 12 street fighters), a blend of 2D and 3D graphics, and the new focus-attack system, Street Fighter has returned with a vengeance.",
    "score": "91"
  },
  {
    "id": "3356e09e-bff4-4476-bac2-5bf7e9cec139",
    "title": "Fallout 3",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/3/238d54d1a52ed5516801b82897e4f79b-98.jpg",
    "platform": "PC",
    "date": "October 28, 2008",
    "description": "[Metacritic's 2008 PC Game of the Year] Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamic characters. Every minute is a fight for survival against the terrors of the outside world – radiation, Super Mutants, and hostile mutated creatures. From Vault-Tec, America's First Choice in Post Nuclear Simulation. Vault 101 - Jewel of the Wastes. For 200 years, Vault 101 has faithfully served the surviving residents of Washington DC and its environs, now known as the Capital Wasteland. Though the global atomic war of 2077 left the US all but destroyed, the residents of Vault 101 enjoy a life free from the constant stress of the outside world. Giant Insects, Raiders, Slavers, and yes, even Super Mutants are all no match for superior Vault-Tec engineering. Yet one fateful morning, you awake to find that your father has defied the Overseer and left the comfort and security afforded by Vault 101 for reasons unknown. Leaving the only home you've ever known, you emerge from the Vault into the harsh Wasteland sun to search for your father, and the truth. [Bethesda Softworks]",
    "score": "91"
  },
  {
    "id": "f0088137-3afb-4384-8497-dcd53330ff49",
    "title": "Batman: Arkham City",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/7/8ca786aa6ce79e3b0c30cdda2f3cb821-98.jpg",
    "platform": "PC",
    "date": "November 21, 2011",
    "description": "DC Comics' Dark Knight clashes with the Joker again in this sequel from Warner Bros. and Rocksteady Games.",
    "score": "91"
  },
  {
    "id": "f4128fab-346f-4a37-b995-5f7f0913d538",
    "title": "Fez",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/4/1bafacfc34a327a3bf464c3367c95dbc-98.jpg",
    "platform": "PC",
    "date": "May 1, 2013",
    "description": "In Fez, you play as Gomez, a 2D creature living in what he believes is a 2D world. Until a strange and powerful artifact reveals to him the existence of a mysterious third dimension!",
    "score": "91"
  },
  {
    "id": "7a857202-30e7-406b-a3a2-2e7ff38e29fe",
    "title": "Planescape: Torment",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/7/a99c16e3950e1ba1b6312a0daccac6b9-98.jpg",
    "platform": "PC",
    "date": "December 14, 1999",
    "description": "Welcome to Sigil, the \"City of Doors\", a place with gates that lead anywhere in existence, provided you have the proper key. It is a neutral ground and watering hole for races across the multiverse, all under the watchful shadow of the Lady of Pain, the enigmatic ruler of the city. It is a place where the word is mightier than the sword, where thought defines reality, where belief has the power to reshape worlds and change the laws of physics. [Interplay]",
    "score": "91"
  },
  {
    "id": "a30f4b20-e8cb-4285-9520-aa52a792973b",
    "title": "Neverwinter Nights",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/2/ae233e55748d7d015acfa5e7a2dc68df-98.jpg",
    "platform": "PC",
    "date": "June 16, 2002",
    "description": "A hideous evil has awoken in the Forgotten Realms. Now, in order to save the inhabitants of the town of Neverwinter you must uncover a sinister conspiracy, unmask your mysterious betrayer and complete an epic struggle to defeat the powerful forces that look to halt your quest and unleash an evil your people would surely never survive. [Infogrames]",
    "score": "91"
  },
  {
    "id": "809d9052-794b-45fb-9216-b3a68e12c42d",
    "title": "Crusader Kings III",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/0/bf1475c161c6857e0c52670b80486e4c-98.jpg",
    "platform": "PC",
    "date": "September 1, 2020",
    "description": "Paradox Development Studio brings you the sequel to one of the most popular strategy games ever made. Crusader Kings III is the heir to a long legacy of historical grand strategy experiences and arrives with a host of new ways to ensure the success of your royal house.",
    "score": "91"
  },
  {
    "id": "e8511f79-1d9e-4e32-b7ce-03ae3fc45c43",
    "title": "No One Lives Forever 2: A Spy in H.A.R.M.'s Way",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/7/8bfb71297900bc0fa29e25f0ddc0f102-98.jpg",
    "platform": "PC",
    "date": "September 30, 2002",
    "description": "A humorous story-driven first-person shooter featuring the beautiful but deadly UNITY operative Cate Archer. Cate must investigate a super-secret Soviet project that, if successful, could bring about a third world war. Armed with an assortment of conventional and experimental weaponry and gadgets, players will explore exotic locales, circumvent devious traps, and contend with deadly agents determined to take Cate out of the spy trade once and for all. [Sierra]",
    "score": "91"
  },
  {
    "id": "697adfe5-d92c-4dd7-a4e4-674b159660fc",
    "title": "Dragon Age: Origins",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/1/9792a1d13ac952d86ca0bf645f5d4fca-98.jpg",
    "platform": "PC",
    "date": "November 3, 2009",
    "description": "As the spiritual successor to BioWare's \"Baldur's Gate\", one of the most successful role-playing games in the industry, Dragon Age: Origins represents BioWare's return to its roots, delivering a fusion of the best elements of existing fantasy works with stunning visuals, emotionally-driven narrative, heart-pounding combat, powerful magic abilities and credible digital actors. The spirit of classic RPGs comes of age, as Dragon Age: Origins features a dark and mature story and gameplay. Epic Party-Based Combat – Dragon Age: Origins introduces an innovative, scalable combat system, as players face large-scale battles and use their party’s special abilities to destroy hoardes of enemies and massive creatures. Powerful Magic – Raining down awesome destruction on enemies is even more compelling as players apply \"spell combos,\" a way of combining together different spells to create emergent unique effects. Players develop their characters and gain powerful special abilities (spells, talents and skills) and discover ever-increasing weapons of destruction. With its emotionally compelling story, players choose with whom they wish to forge alliances or crush under their mighty fist, redefining the world with the choices they make and how they wield their power. Players select and play a unique prelude that provides the lens through which the player sees the world and how the world sees the player. The player's choice of Origin determines who they are and where they begin the adventure, as they play through a customized story opening that profoundly impacts the course of every adventure. [BioWare]",
    "score": "91"
  },
  {
    "id": "eb6c87d0-59c2-4d30-af95-2a12e9e584c6",
    "title": "Mark of the Ninja",
    "rankNumber": "82.",
    "img": "https://static.metacritic.com/images/products/games/1/d0e54c82c7b4c1fb8422b03e911a2911-98.jpg",
    "platform": "PC",
    "date": "October 16, 2012",
    "description": "\"Mark of the Ninja\" is a side-scrolling stealth action game from Klei Entertainment that combines fluid 2D animation with intense stealth gameplay. Observe your enemies from afar, manipulate them with your tools, and execute your plan with precision. But be careful - you're as fragile as you are powerful.",
    "score": "91"
  },
  {
    "id": "24d42a76-695e-4677-a3b3-d4796d38f852",
    "title": "Disco Elysium",
    "rankNumber": "83.",
    "img": "https://static.metacritic.com/images/products/games/4/259cfab379c2636758908c1812f4fcff-98.jpg",
    "platform": "PC",
    "date": "October 15, 2019",
    "description": "Disco Elysium is an open world role playing game. You’re a detective with a unique skill system at your disposal and a whole city block to carve your path across. Interrogate unforgettable characters, crack murders or take bribes. Become a hero or an absolute disaster of a human being.",
    "score": "91"
  },
  {
    "id": "42e65d6c-9e84-4af5-807e-49889dbaf013",
    "title": "Dark Souls II",
    "rankNumber": "84.",
    "img": "https://static.metacritic.com/images/products/games/4/6247a9a855916a7a58ebee939ac5a0d5-98.jpg",
    "platform": "PC",
    "date": "April 25, 2014",
    "description": "Dark Souls II brings the franchise’s renowned difficulty & gripping gameplay innovations to both single and multiplayer experiences.",
    "score": "91"
  },
  {
    "id": "99b40098-e37f-432b-a8cd-1f05b66f44b2",
    "title": "Call of Duty",
    "rankNumber": "85.",
    "img": "https://static.metacritic.com/images/products/games/5/b1fb7d0529dc6a2ef9ab48be7054ecbf-98.jpg",
    "platform": "PC",
    "date": "October 29, 2003",
    "description": "Call of Duty delivers the gritty realism and cinematic intensity of World War II's epic battlefield moments like never before - through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history. Play through the chaos of battle as part of a well-trained squad, that lays down covering fire and pulls its wounded to safety. In addition to authentic squad movements and tactics, each soldier's distinct personality and training comes out on the battlefield. No one soldier or nation single-handedly won the war. For the first time, Call of Duty captures the war from multiple perspectives, through the eyes of American, British and Russian soldiers. Battle through 24 missions spanning 4 interconnected historical campaigns. Take on mission objectives ranging from sabotage and all-out assault to stealth, vehicle combat and rescue. Authentic weapons, locations, vehicles and sounds of war all contribute to the realism. [Activision]",
    "score": "91"
  },
  {
    "id": "97650e34-b0e8-448a-87fb-0385aa487ef3",
    "title": "Madden NFL 2004",
    "rankNumber": "86.",
    "img": "https://static.metacritic.com/images/products/games/1/518832e35051f33645df490ba36d1fa5-98.jpg",
    "platform": "PC",
    "date": "August 12, 2003",
    "description": "Key Features for 2004 include New Playmaker Control - Make pre-snap adjustments to your receiver routes, direct receiver routes during a scramble, direct blocking down field during a run, or read and react to the offense to deliver a crushing tackle; New Owner Mode - Hire your own staff, set your team's ticket prices, build your own stadium, reward key players with signing bonuses and boost player attributes in Mini-Camp drills; Most Realistic NFL Playbooks Ever -  Tons of new trick plays, multiple formation variations, and the deepest NFL playbooks from all 32 officially licensed Coaches Club Head Coaches; New Animations and Enhancements - New QB scramble transitions to improve throwing on the run, stumbles, open field blocks, whirlwind defensive reaction moves, sideline wrap tackles, and out of bound pushes. [Electronic Arts]",
    "score": "91"
  },
  {
    "id": "2fc7acdd-bb16-4a88-90cb-6a661ca7392e",
    "title": "The Sims 2",
    "rankNumber": "87.",
    "img": "https://static.metacritic.com/images/products/games/3/9cd43b7e4504758adc435b40d27f1e80-98.jpg",
    "platform": "PC",
    "date": "September 14, 2004",
    "description": "The Sims 2 is the first entirely-new generation of The Sims, the ground-breaking game that allowed players to create and control people. The Sims 2 challenges you to direct the journey of your Sims' lives as they grow from infancy through childhood, teenage life and adulthood. Starting with a personality that you give them (or that they inherit from their parents), your Sims will develop in unique ways based on your choices and influence. As they progress through life, your Sims will collect memories which shape who they are, what options they have and how they behave. These experiences can have a short or long-term effect on relationships between family members and friends. Experiences between Sims when they are children can affect their relationships as teens and adults. Your Sims can have casual friendships or make life-long enemies. [Electronic Arts]",
    "score": "90"
  },
  {
    "id": "1517d05b-3ee1-452f-9ac5-ff06b1da6455",
    "title": "Final Fantasy XIV: Shadowbringers",
    "rankNumber": "88.",
    "img": "https://static.metacritic.com/images/products/games/7/8830ae69544b05764fe2d5bc4d5a8d6a-98.jpg",
    "platform": "PC",
    "date": "July 2, 2019",
    "description": "Take part in the next saga of FINAL FANTASY® XIV Online with the next legendary expansion pack—SHADOWBRINGERS.\n\nNew jobs: Gunbreaker and Dancer\nNew races: Viera and Hrothgar\nLevel cap increased: 70 to 80\nNew cities: The Crystarium and Eulmore\nJourney through expansive new areas, such as the Rak’tika Greatwood, Amh Araeng, Il Mheg and Lakeland.\nNew trails, including harrowing encounters with Titania and Innocence.\nNew beast tribes: pixies, Nu Mou, and dwarves\nNew 8-player raid: Eden\nAn exciting new series of alliance raids YoRHa:Dark Apocalypse\nThe Restoration of the Holy See of Ishgard - In the aftermath of the Dragonsong War, Disciples of the Hand and Land work together to rebuild Ishgard",
    "score": "90"
  },
  {
    "id": "9f968279-e9e6-42a2-842c-b2d947bb6c0e",
    "title": "World of Warcraft: Cataclysm",
    "rankNumber": "89.",
    "img": "https://static.metacritic.com/images/products/games/5/5b3de8802c0744cba2d423a9696e478a-98.jpg",
    "platform": "PC",
    "date": "December 7, 2010",
    "description": "In Cataclysm, players witness the face of Azeroth being altered forever, as the corrupted Dragon Aspect Deathwing awakens from his subterranean slumber and erupts onto the surface, leaving ruin and destruction in his wake. As the Horde and Alliance race to the epicenter of the cataclysm, the kingdoms of Azeroth will witness seismic shifts in power, the kindling of a war of the elements, and the emergence of unlikely heroes who will rise up to protect their scarred and broken world from utter devastation. New features in the game's third expansion include: Two New Playable Races: Adventure as the cursed worgen with the Alliance or the resourceful goblins with the Horde. Increased Level Cap: Advance to level 85 and earn new abilities, tap into new talents, and progress through the path system, a new way for players to customize characters. Classic Zones Remade: Quest to level 60 as you never have before. Familiar zones across the original continents of Kalimdor and the Eastern Kingdoms have been reforged by the cataclysm and updated with new quests and content. Flying Mounts in Azeroth: Explore Kalimdor and the Eastern Kingdoms from a whole new perspective. Guild Advancement: Progress as a guild to earn guild levels and guild achievements. New High-Level Content: Explore newly opened parts of the world, including Uldum, Grim Batol, and the great sunken city of Vashj'ir beneath the sea, and enjoy even more high-level raid content than in previous expansions. New PvP Zone & Rated Battlegrounds: Take on PvP objectives and daily quests on Tol Barad Island, a new Wintergrasp-like zone, and wage war in all-new rated Battlegrounds. Archaeology: Master a new secondary profession to unearth valuable artifacts and earn unique rewards. New Race and Class Combinations: Explore Azeroth as a gnome priest, blood elf warrior, or one of the other never-before-available race and class combinations. [Blizzard Entertainment]",
    "score": "90"
  },
  {
    "id": "b14a9e3e-7c88-4391-aa47-900cff8dbeef",
    "title": "World of Goo",
    "rankNumber": "90.",
    "img": "https://static.metacritic.com/images/products/games/5/a9e5ec3ba895d2dff7823ec82318f989-98.jpg",
    "platform": "PC",
    "date": "October 12, 2008",
    "description": "World of Goo is a physics based puzzle / construction game. The millions of Goo Balls that live in the beautiful World of Goo don't know that they are in a game, or that they are extremely delicious. [2D Boy]",
    "score": "90"
  },
  {
    "id": "e6c77481-cd78-4390-8981-5c88a43010e7",
    "title": "Spelunky",
    "rankNumber": "91.",
    "img": "https://static.metacritic.com/images/products/games/0/85cfe3e90f0a32237c7943a561e9f7fc-98.jpg",
    "platform": "PC",
    "date": "August 8, 2013",
    "description": "Spelunky is a unique platformer with randomized levels that offer a new and challenging experience each time you play.",
    "score": "90"
  },
  {
    "id": "da7c0ddc-58b7-4d4c-b15b-d5a893287dc0",
    "title": "Black & White",
    "rankNumber": "92.",
    "img": "https://static.metacritic.com/images/products/games/1/da4c1ac972d39e99d7d718a16835a555-98.jpg",
    "platform": "PC",
    "date": "March 26, 2001",
    "description": "Peter Molyneux's highly anticipated \"god game,\" a blend of the genres including strategy, sim, RPG, and puzzle, features the player as a new god in the lands of Eden who must reign with the help of uniquely evolving animals in either a benign or evil fashion.",
    "score": "90"
  },
  {
    "id": "6db65904-3df0-47ec-8e23-5d78ef58eff1",
    "title": "Portal",
    "rankNumber": "93.",
    "img": "https://static.metacritic.com/images/products/games/7/ed6cef600ce7386aeb5734178cae0e16-98.jpg",
    "platform": "PC",
    "date": "October 10, 2007",
    "description": "Portal is a new single player game from Valve. Set in the mysterious Aperture Science Laboratories, Portal has been called one of the most innovative new games on the horizon and offers gamers hours of unique gameplay. The game is designed to change the way players approach, manipulate, and surmise the possibilities in a given environment; similar to how Half-Life 2's Gravity Gun innovated new ways to leverage an object in any given situation. Players must solve physical puzzles and challenges by opening portals to maneuvering objects, and themselves, through space. [Valve]",
    "score": "90"
  },
  {
    "id": "9c38ab2d-5941-469e-9106-7221bed7ad40",
    "title": "Tetris Effect",
    "rankNumber": "94.",
    "img": "https://static.metacritic.com/images/products/games/3/5b852f59b23ce53bd24839d9c78e6649-98.jpg",
    "platform": "PC",
    "date": "July 23, 2019",
    "description": "Named after a real-world phenomenon where players' brains are so engrossed that images of the iconic falling Tetrimino blocks (i.e. the Tetris playing pieces) linger in their vision, thoughts, and even dreams, Tetris Effect amplifies this magical feeling of total immersion by surrounding you with fantastic, fully three-dimensional worlds that react and evolve based on how you play. Music, backgrounds, sounds, special effects -- everything, down to the Tetris pieces themselves, pulse, dance, shimmer, and explode in perfect sync with how you're playing.\n\nFrom deep beneath the ocean to the furthest reaches of outer space and everywhere between, Tetris Effect's 30-plus stages take players on a wondrous, emotional journey through the universe. The core of the game is still Tetris -- one of the most popular puzzle games of all time -- but like you've never seen it, or heard it, or felt it before.",
    "score": "90"
  },
  {
    "id": "638dce47-1cbd-47dd-b0af-cdf85c99adc9",
    "title": "NHL 2001",
    "rankNumber": "95.",
    "img": "https://static.metacritic.com/images/products/games/0/5f2eafa43055019a5bbabac3b5be0af7-98.jpg",
    "platform": "PC",
    "date": "September 28, 2000",
    "description": "High-flyin', hard hittin', intense powerplay hockey is back with EA Sports' NHL 2001, bringing gamers out of the stands and onto the ice. Lace up the skates and play with or against all 30 National Hockey League teams, including the expansion Columbus Blue Jackets and Minnesota Wild.  [Electronic Arts]",
    "score": "90"
  },
  {
    "id": "6bd9d818-7ccf-4be4-a9e4-9033e01db06c",
    "title": "Stephen's Sausage Roll",
    "rankNumber": "96.",
    "img": "https://static.metacritic.com/images/products/games/8/f28bf9b7dd8fc14321b104cc64fc664c-98.jpg",
    "platform": "PC",
    "date": "April 18, 2016",
    "description": "The focus of Stephen's Sausage Roll involves nudging sausages around to fully cook them.",
    "score": "90"
  },
  {
    "id": "168838d6-b7d0-4a06-80b1-641665ce0cb3",
    "title": "Tony Hawk's Pro Skater 3",
    "rankNumber": "97.",
    "img": "https://static.metacritic.com/images/products/games/6/ffbc36110bc702b20df31eb5fd2bfc26-98.jpg",
    "platform": "PC",
    "date": "March 28, 2002",
    "description": "Featuring eight massive levels filled with people, traffic, and other interactive elements, the game's environments are brought to life with richer graphics and advanced special effects optimized for today's PC video cards.  Smoother life-like animations and significantly improved tricks capture the style of the world's best skateboarding pros. Further improving on the franchise's intuitive control scheme, the game allows players to perform tricks and combos in some of the world's most popular skate locations including Los Angeles, Canada and Tokyo. The enhanced skate park editor allows gamers to create the ultimate park up to twice the size of parks in Tony Hawk's Pro Skater 2.  The Create-A-Skater features a new female skater model, and the ability to modify almost every aspect of their appearance, from accessories to clothing to hair color. [Activision]",
    "score": "90"
  },
  {
    "id": "8db60353-6338-45c1-8595-6584f93eb93b",
    "title": "Deus Ex",
    "rankNumber": "98.",
    "img": "https://static.metacritic.com/images/products/games/6/0b0d347832eccdd1de8d5f65ccf9ee46-98.jpg",
    "platform": "PC",
    "date": "June 23, 2000",
    "description": "The game that incorporates RPG, action, adventure, and 1st-person shooter genres into a chaotic blend of real-world conspiracies, cliffhangers, and plot twists. A richly simulated world of unparalleled interactivity, engineered to react logically to your every action. The decisions and consequences are yours. [Eidos Interactive]",
    "score": "90"
  },
  {
    "id": "f58c99f2-c467-4029-9218-a38bb9dc4bb1",
    "title": "Half-Life 2: Episode Two",
    "rankNumber": "99.",
    "img": "https://static.metacritic.com/images/products/games/3/fd2b17399f3f3f9d0c4e3609c5a050b1-98.jpg",
    "platform": "PC",
    "date": "October 10, 2007",
    "description": "Half-Life 2: Episode Two is the second in a trilogy of new games created by Valve that extends the award-winning and best-selling Half-Life adventure. As Dr. Gordon Freeman, you were last seen exiting City 17 with Alyx Vance as the Citadel erupted amidst a storm of unknown proportions. In Episode Two, you must battle and race against Combine forces as you traverse the White Forest to deliver a crucial information packet stolen from the Citadel to an enclave of fellow resistance scientists. Episode Two extends the award-winning Half-Life gameplay with unique weapons, vehicles, and newly-spawned creatures. [Valve]",
    "score": "90"
  },
  {
    "id": "d866f42e-495e-443e-b554-961d59b1b51b",
    "title": "Braid",
    "rankNumber": "100.",
    "img": "https://static.metacritic.com/images/products/games/2/4c434948b157b6eb36a58fff456be011-98.jpg",
    "platform": "PC",
    "date": "April 10, 2009",
    "description": "Braid is a puzzle-platformer, drawn in a painterly style, where the player manipulates the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess. In each world, you have a different power to affect the way time behaves, and it is time's strangeness that creates the puzzles. The time behaviors include: the ability to rewind, objects that are immune to being rewound, time that is tied to space, parallel realities, time dilation, and perhaps more. Braid treats your time and attention as precious; there is no filler in this game. Every puzzle shows you something new and interesting about the game world. Braid is a 2-D platform game where you can never die and never lose.",
    "score": "90"
  }
]