[
  {
    "id": "dcf38600-3b4d-4a32-b2c7-22d5837d65c1",
    "title": "Animal Crossing: New Horizons",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/5/3a9359329fd2b8b0022bc57246aca1c8-98.jpg",
    "platform": "Switch",
    "date": "March 20, 2020",
    "description": "If the hustle and bustle of modern life’s got you down, Tom Nook has a new business venture up his sleeve that he knows you’ll adore: the Nook Inc. Deserted Island Getaway Package. Sure, you’ve crossed paths with colorful characters near and far. Had a grand time as one of the city folk. May’ve even turned over a new leaf and dedicated yourself to public service. But deep down, isn’t there a part of you that longs for…freedom? Then perhaps a long walk on the beach of a deserted island, where a rich wealth of untouched nature awaits, is just what the doctor ordered. Peaceful creativity and charm await as you roll up your sleeves and make your new life whatever you want it to be. Collect resources and craft everything from creature comforts to handy tools. Embrace your green thumb as you interact with flowers and trees in new ways. Set up a homestead where the rules of what goes indoors and out no longer apply. Make friends with new arrivals, enjoy the seasons, pole-vault across rivers as you explore, and more.",
    "score": "90"
  },
  {
    "id": "ce6c4f7c-bdf7-4094-9c52-e8f3c449dbf2",
    "title": "Xenoblade Chronicles: Definitive Edition",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/4/d44b7f8ad0f84de2d0694370170661a8-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2020",
    "description": "Join the fight between man and machine in the definitive edition of this critically-acclaimed RPG. Discover the origins of Shulk as he and his companions clash against a seemingly-unstoppable mechanical menace. Wield a future-seeing blade, chain together attacks, and carefully position your party members in strategic, real-time combat as you journey across a massive world. During an attack from the mechanical invaders known as the Mechon, Shulk discovers that he can tap into the full power of a mysterious blade known as the Monado. With the mighty Monado in hand, Shulk sets out to defeat the Mechon once and for all. In addition to the Mechon, you’ll run into wildlife that ranges from docile to deadly. Keep an eye on what attracts monsters’ attention to avoid unwanted conflict…or try your hand at bringing down an ultra-powerful Unique Monster. Upgrade your party as you progress through the adventure by selecting equipment, enhancing weapon skills, and using benefit-granting gems. Put your dependable companions to work by filling the party gauge to trigger a Chain Attack and attack enemies in quick succession.",
    "score": "89"
  },
  {
    "id": "85db55a2-e91d-4503-8f23-cbbdfff555a4",
    "title": "Spiritfarer",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/6/708b1e0546ef7bee71d14fd61c115656-98.jpg",
    "platform": "Switch",
    "date": "August 18, 2020",
    "description": "A cozy management game about dying. \n\nWhat will you leave behind?\nPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \n\nA unique, endlessly varied adventure!\nFarm, mine, fish, harvest, cook, and craft your way across mystical seas. Unwind for hours into cozy and relaxing gameplay. Join the adventure as Daffodil the cat, in two-player cooperative play.\n\nLearn how to say goodbye.\nExperience moving, emotional stories filled with unforgettable moments. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?",
    "score": "88"
  },
  {
    "id": "b1ebfade-8a02-4aa1-b741-691218ae10a1",
    "title": "A Short Hike",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/9/2bce32debd624728e4ac46e1e6c75ff7-98.jpg",
    "platform": "Switch",
    "date": "August 18, 2020",
    "description": "Follow the marked trails or explore the backcountry as you make your way to the summit. Along the way, meet other hikers, discover hidden treasures, and take in the world around you. Explore the island any way you like. Choose your own path to follow and see where it leads you. You never know what you might stumble into!\n    Hike at your own pace - there's no need to rush to the summit! Take your time fishing along the river banks or swimming by the lakeshore.\n    Collect hidden treasures to reach new heights. Try taking a dive off the mountain peaks to soar above the forests.\n    Chat with the other hikers you meet along your route. You might be able to help each other out!\n    Listen to a lush original soundtrack by Mark Sparling that progresses dynamically as you explore the wilderness.",
    "score": "88"
  },
  {
    "id": "d0d3ef10-aaf5-4a75-9c56-06bef1f438ad",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/6/c9fbfb8b99c42e59a92c44c0ff2d82e0-98.jpg",
    "platform": "Switch",
    "date": "January 28, 2020",
    "description": "Kentucky Route Zero is a magical realist adventure game about a secret highway in the caves beneath Kentucky. An antique furniture delivery man trying to make his small shop's last delivery gets lost along the way and meets a haunted TV repairwoman, a young boy and his giant eagle brother, a pair of robot musicians, and dozens of other characters. Together, they explore the nocturnal highways and country roads of Kentucky, the storied Echo River by ferry, and the mysterious Route Zero, the secret highway that runs through Mammoth Cave.",
    "score": "87"
  },
  {
    "id": "674063b0-8571-4ddf-8923-c478b40748ee",
    "title": "Super Mega Baseball 3",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/2/f72fb2c81962daefabcdcfd2c6fe9102-98.jpg",
    "platform": "Switch",
    "date": "May 13, 2020",
    "description": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. Super Mega Baseball 3 features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits.",
    "score": "87"
  },
  {
    "id": "1d5a620a-3393-4962-9052-c639f227938c",
    "title": "Huntdown",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/9/9800846ccbb7d92c64a6840b5432e938-98.jpg",
    "platform": "Switch",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "86"
  },
  {
    "id": "2e63b993-45f6-459f-9ca4-6add444ccd16",
    "title": "Streets of Rage 4",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/4/a35a4da391146e66621f989f7ec02074-98.jpg",
    "platform": "Switch",
    "date": "April 30, 2020",
    "description": "Amongst the best beat’em up series ever created, jammin’ ‘90s beats and over the top street beating, the iconic series Streets of Rage comes back with a masterful tribute to and revitalization of the classic action fans adore.\n\nThe all-time classic Streets of Rage, known as Bare Knuckle (ベア・ナックル Bea Nakkuru) in Japan, is a beat ‘em up series known for this timeless gameplay and electronic dance influenced music. Streets of Rage 4 builds upon the classic trilogy’s gameplay with new mechanics, beautiful hand-drawn visuals and a God tier soundtrack.\n\nTeam up with iconic and brand-new characters\n\nStreets of Rage 4 got its iconic characters back: Axel, Blaze, and Adam teaming up with new brother and sister in arms Floyd Iraia and Cherry Hunter. With some brand-new moves and kickass tracks to take a listen, our heroes are ready to dish out beatdowns to a fledgling group of ill-advised criminals in full force.",
    "score": "86"
  },
  {
    "id": "1afc5cf5-c5ac-42df-a001-2cca417e67de",
    "title": "Bug Fables: The Everlasting Sapling",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/0/e70478ab294a54673276ad113a64d73e-98.jpg",
    "platform": "Switch",
    "date": "May 28, 2020",
    "description": "Bug Fables is an adventure RPG following three heroes, Vi, Kabbu, and Leif, as they embark on an epic quest in Bugaria in search of treasure and immortality! The game combines colorful platforming with the heroes' unique abilities as they explore a wide variety of areas in the kingdom. Battles are turn-based and make use of action commands that can enhance attacks.",
    "score": "85"
  },
  {
    "id": "072332f9-fc60-472b-897e-bcb19cb3dae3",
    "title": "Two Point Hospital",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/1/1b296ff702f24597029bdb0984d96def-98.jpg",
    "platform": "Switch",
    "date": "February 25, 2020",
    "description": "Build up a hospital from nothing to a masterpiece as you design the most beautiful - or functional - healthcare operation in the whole of Two Point County. Optimize your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact specifications. Expand your hospital to multiple buildings as you look to get as many patients through the door as possible. Place decorative and functional items around your hospital to improve its prestige, lower patient boredom, increase happiness and keep those end of year awards flowing in.",
    "score": "85"
  },
  {
    "id": "841d6e23-2375-4d7e-8a0f-328a5a2d1b75",
    "title": "Lonely Mountains: Downhill",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/4/c05abefb028295d3540cfeb9e6d2fb10-98.jpg",
    "platform": "Switch",
    "date": "May 7, 2020",
    "description": "Just you and your bike — take it on a thrilling ride down an unspoiled mountain landscape. Make your way through thick forests, narrow trails and wild rivers. Race, jump, slide and try not to crash — all the way from the peak to the valley.",
    "score": "85"
  },
  {
    "id": "0c0db4a2-ed59-47be-a346-90ffe3a76a8d",
    "title": "Thronebreaker: The Witcher Tales",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/0/b3950d40a50edd2a639879ad334139f3-98.jpg",
    "platform": "Switch",
    "date": "January 28, 2020",
    "description": "Thronebreaker is a single player role-playing game set in the world of The Witcher that combines narrative-driven exploration with unique puzzles and card battle mechanics.\n\nCrafted by the developers responsible for some of the most iconic moments in The Witcher 3: Wild Hunt, the game spins a truly regal tale of Meve, a war-veteran and queen of two Northern Realms Lyria and Rivia. Facing an imminent Nilfgaardian invasion, Meve is forced to once again enter the warpath and set out on a dark journey of destruction and revenge.\n\nKEY FEATURES\n\nAN ALL NEW EPIC TALE\n* Experience an all-new 30-hour Witcher world tale with 20 possible world end-states.\n* Embark on a grand adventure full of thought-provoking quests.\n* Influence the state of the world around you by making difficult choices and face their consequences.\n* Meet a cast of rich, multidimensional characters some of them will join you on your quest, others you'll have to face on the battlefield.\n\nTRAVEL TO NEVER-BEFORE-SEEN KINGDOMS\n* Explore new and mysterious regions of the monster-infested world of The Witcher.\n* Traverse vast lands and unique locations, all with their distinct theme from vibrant countrysides and war-torn landscapes, to grand castles and snow-capped mountains.\n* Save villages from hordes of monsters, look for treasures hidden among ancient ruins, scour the land for resources, and more the world of Thronebreaker is teeming with things to do.\n\nPREPARE FOR WAR\n* Develop and customize your very own battle camp.\n* Train and recruit units, unlock new skills and work on your tactics.\n* Manage resources you find and trade them with local merchants.\n* Learn more about your companions and increase their strength in battle.\n\nLEAD YOUR ARMY IN EPIC BATTLES\n* Build an army from characters you meet and interact with during your journey.\n* Fight in epic story battles and solve unique puzzles and challenges.\n* Use unique skills and abilities of your army and lead it to victory.",
    "score": "84"
  },
  {
    "id": "ae0b198b-f9f5-4214-a3af-16750515d206",
    "title": "WHAT THE GOLF?",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/8/07bba4965651a717a5de48856783df24-98.jpg",
    "platform": "Switch",
    "date": "May 21, 2020",
    "description": "The golf game for people who hate golf!\n\nA silly physics-based golf parody where every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd they will make you go: WHAT THE GOLF?\n\nGolf a house, a horse or car!\n\nFeatures:\n- More surprising new golf mechanics than you can imagine\n- Epic golf boss fights\n- Made by people who know nothing about golf\n- First (and hopefully the last) game that let you golf a horse\n- Will NOT make you a better golf player\n- Surprises!",
    "score": "84"
  },
  {
    "id": "dd57d5b2-5fb9-4d81-a36c-cb7b3735b0f5",
    "title": "BioShock: The Collection",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/6/7a00ff92f538b4f28ef195fbe3db52e1-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2020",
    "description": "Return to the cities of Rapture and Columbia and experience the award-winning BioShock franchise like never before, beautifully remastered in 1080p. BioShock: The Collection contains all single-player content from BioShock, BioShock 2, and BioShock Infinite, all single-player add-on content, the Columbias Finest pack, and Directors Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson.\n\nBioShock is a shooter unlike any you've ever played, loaded with weapons and tactics never seen. You'll have a complete arsenal at your disposal from simple revolvers to grenade launchers and chemical throwers, but you'll also be forced to genetically modify your DNA to create an even more deadly weapon: you. \n*Museum of Orphaned Concepts\n*Challenge Rooms\n\nBioShock 2\nSet approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. Players step into the boots of the most iconic denizen of Rapture, the Big Daddy, as they travel through the decrepit and beautiful fallen city, chasing an unseen foe in search of answers and their own survival.\n*Minervas Den\n*Protector Trials\n\nBioShock Infinite\nBring us the girl, wipe away the debt. The year is 1912. Deep in debt, Booker DeWitt has only one opportunity for a clean slate: rescue Elizabeth, a mysterious girl imprisoned since childhood in the flying city of Columbia. \n*Clash in the Clouds\n*Burial at Sea 1&2\n*Columbias Finest Pack\n\nFeatures\n\n*Remastered in 1080p.\n*BioShock main game and all single player DLC.\n*BioShock 2 main game and all single player DLC.\n*BioShock Infinite main game and all single player DLC.\n*Directors Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson",
    "score": "84"
  },
  {
    "id": "f6ee27a5-56e7-4aed-946e-faf343fed9bf",
    "title": "Sega Ages: Fantasy Zone",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/0/697650ded5005f55fac19dd0175ed99c-98.jpg",
    "platform": "Switch",
    "date": "January 23, 2020",
    "description": "Take command of the spaceship Opa-Opa and blast your way through various fantastical levels as you try to take out all the enemy bases in each stage. Once you've destroyed the bases, you'll have to beat the stage boss in order to move on to the next level. By using your guns and bombs wisely, you'll be able to take down your enemies and explore each of the crazy environments in this side-scroller. You can also buy upgraded weapons for your ship by accessing the shop.",
    "score": "84"
  },
  {
    "id": "40a55e98-ff8c-4fcf-b3c7-4a2918e0f539",
    "title": "To the Moon",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/8/650195023288a1c8f6f617ffeabe514f-98.jpg",
    "platform": "Switch",
    "date": "January 16, 2020",
    "description": "Dr. Rosalene and Dr. Watts have peculiar jobs: They give people another chance to live, all the way from the very beginning... but only in their patients' heads.\n\nDue to the severity of the operation, the new life becomes the last thing the patients remember before drawing their last breath. Thus, the operation is only done to people on their deathbeds, to fulfill what they wish they had done with their lives, but didnt.\n\nThis particular story follows their attempt to fulfill the dream of an elderly man, Johnny. With each step back in time, a new fragment of Johnny's past is revealed. As the two doctors piece together the puzzled events that spanned a life time, they seek to find out just why the frail old man chose his dying wish to be what it is.\n\nAnd Johnny's last wish is, of course... to go to the moon.\n\n\n* A unique story-driven experience\n* Innovative mix between adventure game elements and classic RPG aesthetics\n* Acclaimed original soundtrack that closely ties to the story\n* An espresso execution with zero filler and no time drains",
    "score": "84"
  },
  {
    "id": "d03a720a-547a-4eea-a768-4ad4154f1ba6",
    "title": "The Legend of Heroes: Trails of Cold Steel III",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/4/f6ee6feaca5d24dccd7f67fd2b3faaf4-98.jpg",
    "platform": "Switch",
    "date": "June 30, 2020",
    "description": "The end of the civil war led to the turning point of a new era for the Erebonian Empire. Centering on Rean Schwarzer as the Ashen Chevalier, the young man who came to be seen as a hero within the country, a new story of young heroes will unfold.",
    "score": "84"
  },
  {
    "id": "34894f58-81dd-4934-8c74-10db257c2d20",
    "title": "Knights and Bikes",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/1/1dd8fab7067e49fe7d63cd5e49496e84-98.jpg",
    "platform": "Switch",
    "date": "February 6, 2020",
    "description": "Knights And Bikes is a hand-painted action-adventure for 1 or 2 players, set on a British island in the 1980s. It's a coming-of-age story starring Nessa & Demelza, exploring the coasts of Penfurzy on their trusty bikes, looking for a legendary lost treasure in a Goonies-inspired tale of excitement, danger, fun and friendship.\n\nThe two new friends, along with their pet-goose and the pickled-head of an undead knight, form the Penfurzy Rebel Bicycle Club, and are ready for anything this adventure throws at them. They pedal into danger to face threats head-on with frisbees, water-balloons, video game controllers and the powerful beats of an amplified boom-box.\n\nAlong the way they'll stuff their pockets with trinkets and barter for bike upgrades, spurring them onward down the island's country lanes, windswept beaches, deep forests, modern attractions and ancient ruins. Together their friendship will create an adventure as big as their imaginations.",
    "score": "83"
  },
  {
    "id": "8518ee5b-26f9-43f5-a44e-d28f437330c2",
    "title": "Mega Man Zero / ZX Legacy Collection",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/8/ccb756098c89c608d272a220b7b46090-98.jpg",
    "platform": "Switch",
    "date": "February 25, 2020",
    "description": "Mega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent. In addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual Scenario Mode and a Save-Assist feature are available for those who would like to enjoy the story at their own pace. Players can also try their hand at the new leaderboard-based Z Chaser Mode, an exclusive new mode created just for this set of games.",
    "score": "83"
  },
  {
    "id": "9233c093-a6e2-4d52-b993-bba6bbd76384",
    "title": "Sega Ages: Sonic the Hedgehog 2",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/4/e01dd90b9b86fda11824eb53a0c0dad8-98.jpg",
    "platform": "Switch",
    "date": "February 20, 2020",
    "description": "Super Speed! Sonic's back and better than ever. He's a blur in blue! A blaze of action! With his new Super Spin Dash. And a new, fabulous friend, \"Tails\" the Fox. You won't believe it 'til you see it. And when you play, you won't stop. Super Play! Defy gravity in hair-raising loop-de-loops. Grab Power Sneakers and race like lightning through the mazes. All at break-neck speed! Super Power! Sonic's attitude is can-do. The mad scientist Dr. Robotnik is planning a world takeover. Sonic gets tough in the fight to save his friends and squash Robotnik for good!",
    "score": "83"
  },
  {
    "id": "80e80ea0-93c5-456e-9087-20a3d236ab1b",
    "title": "Code:Realize - Guardian of Rebirth",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/8/05dd2832c284977212df6b30d7df4502-98.jpg",
    "platform": "Switch",
    "date": "February 6, 2020",
    "description": "This all happened many, many years ago.\nThe girl searched. Grass withered.\nThe girl searched even harder. Flowers were the next to die.\nEven so, the girl continued her search. Eventually, the whole land rotted.\nThe girl was a monster -- a lonely monster.\n\nThis all happened many, many years ago.\n\nThe poisonous girl who destroyed nature and man alike only sought one thing -- love.",
    "score": "83"
  },
  {
    "id": "75db7f1c-2993-4e9e-95fd-45785e47612f",
    "title": "Ruiner",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/1/c4c399142ae9ff690bd80a180e5060de-98.jpg",
    "platform": "Switch",
    "date": "June 18, 2020",
    "description": "In the year 2091 pervasive advancements in technology and computerization haven't changed human nature. Playing with people's lives has never been more fun.",
    "score": "82"
  },
  {
    "id": "f78624aa-bc52-4370-854d-7a2c89894f76",
    "title": "Under Night In-Birth Exe:Late[cl-r]",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/2/9b8ae8e28d5215d358337310b6ed2809-98.jpg",
    "platform": "Switch",
    "date": "February 20, 2020",
    "description": "Cold friends & New under night In-Birth exe: late[cl-r] introduces a brand new character-icyy Fighter londrekia and his frosty new set of moves. Balancing act the new game features new moves and balance adjustments to every character-totalingg roughly 1, 000 improvements.\nShow your true colors each character will receive five new Color schemes (for a total of 40 new Color schemes), so players can customize their fighters to suit their every Mood.",
    "score": "82"
  },
  {
    "id": "12a4c596-fe53-49e8-85e5-504de048b671",
    "title": "CrossCode",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/6/dca175d4309b3ca06c1147b44bb70cd1-98.jpg",
    "platform": "Switch",
    "date": "July 9, 2020",
    "description": "This retro-inspired 2D Action RPG might outright surprise you. CrossCode combines 16-bit SNES-style graphics with butter-smooth physics, a fast-paced combat system, and engaging puzzle mechanics, served with a gripping sci-fi story.\n\nCrossCode is all about how it plays! Take the best out of two popular genres, find a good balance between them and make a great game. That’s what CrossCode does. You get the puzzles of Zelda-esque dungeons and are rewarded with the great variety of equipment you know and love from RPGs. During the fast-paced battles you will use the tools you find on your journey to reveal and exploit the enemies' weaknesses and at the same time will be able to choose equipment and skills for a more in-depth approach in fighting your enemies.",
    "score": "82"
  },
  {
    "id": "b2e95f09-17e9-4c30-8202-06d78e5d14b7",
    "title": "Borderlands Legendary Collection",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/8/9f61bad844829d8315230966f94df1a2-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2020",
    "description": "Get three times the mayhem, three times the loot, and three times the action with the Borderlands Legendary Collection! Kill bandits and beasts, collect powerful weaponry, and maybe even save the universe in Borderlands: Game of the Year Edition, Borderlands 2, and Borderlands: The Pre-Sequel, along with piles of bonus add-on content for each game, adding 100+ hours of gameplay at an incredible value.\n\n* Enjoy all three games solo or cooperatively with local two-player split-screen or four-player online play\n\n* Borderlands: Game of the Year Edition - Discover the co-op shooter-looter that started it all, crammed with content and enhancements! Equip bazillions of guns as one of four trigger-happy mercenaries, each with unique RPG skills. Take on the lawless desolate planet Pandora in pursuit of powerful alien technology rumored to be inside an ancient Vault.\n\n* Borderlands 2 - Play as one of six vault hunters attempting to liberate Pandora from evil mastermind and corporate CEO Handsome Jack. Make new friends, arm them with a bazillion weapons and fight alongside them in a relentless quest for revenge and redemption.\n\n* Borderlands: The Pre-Sequel - Discover the story behind Borderlands 2 villain, Handsome Jack, and his rise to power. Set between the events of Borderlands and Borderlands 2, The Pre-Sequel gives you a whole lotta new gameplay and features the genre-blending fusion of shooter and RPG mechanics that players have come to love. \n\nThe Borderlands Legendary Collection versions of Borderlands: Game of the Year Edition, Borderlands 2, and Borderlands: The Pre-Sequel come complete with loads of extra content, including the following major add-ons:\n\nBorderlands: Game of the Year Edition\n- The Zombie Island of Dr. Ned\n- Mad Moxxi's Underdome Riot\n- The Secret Armory of General Knoxx\n- Claptrap's New Robot Revolution\n\nBorderlands 2\n- Captain Scarlett and Her Pirate's Booty\n- Mr. Torgue's Campaign of Carnage\n- Sir Hammerlock's Big Game Hunt\n- Tiny Tina's Assault on Dragon Keep\n- Mechromancer Pack (play as Gaige)\n- Psycho Pack (play as Krieg)\n\nBorderlands: The Pre-Sequel\n- Claptastic Voyage\n- The Holodome Onslaught\n- Baroness Pack (play as Aurelia)\n- Handsome Jack Doppelganger Pack (play as \"Jack\")",
    "score": "82"
  },
  {
    "id": "b0fe86c0-7a21-4f09-982b-fb98441a1693",
    "title": "Devil May Cry 3: Special Edition",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/4/9a29f6103cca84b92fedaf3f3557cf65-98.jpg",
    "platform": "Switch",
    "date": "February 20, 2020",
    "description": "Set before the original Devil May Cry, Devil May Cry 3: Special Edition follows Dante's journey as he battles his evil twin brother in a final confrontation. Along the way, you'll encounter both formidable foes and unusual characters. When attacking, you can choose to use short-range, long-range, defensive, or evasive play styles. Each system has its own set of gameplay features, and you can choose to power up your favorite style for increased special attack abilities. The Special Edition adds the ability to play as Dante's nemesis Virgil and a survival game mode.",
    "score": "82"
  },
  {
    "id": "4a41bdbb-6d9f-4107-a552-9b2e196b44b1",
    "title": "Clubhouse Games: 51 Worldwide Classics",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/5/e15b342486b29baa4d553150b86f399f-98.jpg",
    "platform": "Switch",
    "date": "June 5, 2020",
    "description": "Play and discover 51 board games, tabletop games, and more all in one package -- Clubhouse Games: 51 Worldwide Classics. This diverse collection includes games from all over the world across multiple genres, from familiar favorites like Chess to international hits like Mancala that have been around for 100s of years!\n\nEnjoy familiar favorites and learn hidden gems from around the world in this collection of 51 board games, tabletop games and more! Whether you like to sit and strategize or rely on reflexes, Clubhouse Games: 51 Worldwide Classics contains games from across an array of genres for you to play and discover. Each game is presented with stunning detail as dice clack and marbles glimmer.\n\nStrategic players will feel right at home with games like Four-in-a-row and Renegade, while those who prefer to use their reflexes can enjoy games like Slot Cars and Toy Boxing!\n\nWith board games, card games, sports, solitaires and more, Clubhouse Games: 51 Worldwide Classics is an eclectic collection of games to play and discover on your Nintendo Switch.",
    "score": "82"
  },
  {
    "id": "53a0bfef-9828-475c-95b2-4157f2804ca4",
    "title": "Tokyo Mirage Sessions #FE Encore",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/4/38832341328bc9b0046973fa22b53ffd-98.jpg",
    "platform": "Switch",
    "date": "January 17, 2020",
    "description": "The worlds of the Fire Emblem series and Atlus games have crossed paths again and the result is coming to the Nintendo Switch system. An interdimensional evil has invaded modern-day Tokyo, resulting in this fantastical barrage of music, style, and yes, danger. So, fight back! Battle through dungeons to pump up your strategy and creatively decimate your foesbefore all hope fades to black. You and the rising stars you call friends will need to call on your own creative powermanifested as iconic Fire Emblem characters -- to wage a secret war on rogue spirits that feed on creativity. Each encounter will immerse you in deep, turn-based battles that blend the combat of the Fire Emblem and Shin Megami Tensei series into one brutal harmony. Fuse items to craft weaponry; then play to your strengths and crush your foes. Around every corner you'll find fun nods to multiple fandoms, including Fire Emblem references, dungeons themed to the entertainment industry, and stunning musical performances.",
    "score": "81"
  },
  {
    "id": "c5e4f3d2-890d-4d89-a0f7-0f1393268e9f",
    "title": "Jet Lancer",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/2/2c7eb07bd678a89be27ec0e89d73313b-98.jpg",
    "platform": "Switch",
    "date": "May 12, 2020",
    "description": "Jet Lancer is a high-velocity aerial combat shooter where you duel enemy aviators, hunt giant robots, and defy death at supersonic speeds. You are Ash Leguinn: badass pilot, highly paid mercenary, and flight-school drop out. Your day job is fine - the daily grind of dealing with Sky Pirates pays the bills - but nothing compares to the rush of demolishing a ninety-ton mechanical monstrosity at the speed of sound. And you’ll have your chance. As mechanized weapons converge on Root City, you’ll have to be at the top of your game to survive, and you’ll have to surpass your limits if you want to save the world.",
    "score": "81"
  },
  {
    "id": "db42ffa0-9e26-4b64-9339-fb51c8a5fdc2",
    "title": "Aviary Attorney: Definitive Edition",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/4/ab95a179c1faa1b5f1f85121ed8e3b90-98.jpg",
    "platform": "Switch",
    "date": "January 30, 2020",
    "description": "Take yourself back to 1848 in Aviary Attorney: Definitive Edition. Paris is on the brink of yet another revolution, and the prisons are overflowing with guilty and innocent alike.",
    "score": "81"
  },
  {
    "id": "98909c67-dc0a-4d85-8103-987d8c290714",
    "title": "Operencia: The Stolen Sun",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/8/e928b92cd5a5be3afb1459b0e7f3b380-98.jpg",
    "platform": "Switch",
    "date": "March 31, 2020",
    "description": "Operencia: The Stolen Sun embraces everything you love about classic first-person dungeon-crawlers, enhancing the old-school turn-based RPG experience with modern sensibilities. Gather your team of memorable characters and guide them through a world inspired by Central European mythology, where history meets legend. Unreal Engine 4 powers breathtaking environments, from traditional tombs and dungeons to enchanted castles and a forest made of copper.",
    "score": "81"
  },
  {
    "id": "253d7314-ac3e-4d8d-8e3a-b48bcd8ee828",
    "title": "Wunderling",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/2/856fe187fda508eb8adf5f86d4e4d336-98.jpg",
    "platform": "Switch",
    "date": "March 5, 2020",
    "description": "Take control of the Wunderling, a low-level video game goon who has just unlocked the power to jump. Unable to stop or change direction at will, you will need to plan ahead and master the Wunderlings’ abilities to navigate treacherous scrolling levels and chase down that pesky Hero.",
    "score": "81"
  },
  {
    "id": "c244f31c-1a2f-4cea-b214-758a053193ac",
    "title": "Rune Factory 4 Special",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/0/ee3d6b9e056faf04d61440eed3c0dc83-98.jpg",
    "platform": "Switch",
    "date": "February 25, 2020",
    "description": "Rune Factory 4 marks the return of the popular Harvest Moon spinoff that combines farming with dungeon adventuring. For the first time in the series, the player can select to play as a male or female hero, and potential suitors of either gender are also available in order to pursue love, marriage, and possibly a child. As the newly-appointed prince or princess, you can fulfill your royal duties of protecting the town from invaders, or take a more rural approach to governing by raising your own fruits and vegetables and helping townsfolk. Should some dungeon adventuring be on the days itinerary, you can select from the castles vast armament of swords, spears, and staffs along with magic for battle against dangerous foes, or even bring along a companion or friendly monster to aid you during your travels.",
    "score": "81"
  },
  {
    "id": "0779ff92-8128-4fbf-83a6-8fbdc68e284f",
    "title": "Bloodstained: Curse of the Moon 2",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/9/1d638b1762b087597acd698f3e82ae62-98.jpg",
    "platform": "Switch",
    "date": "July 10, 2020",
    "description": "Koji Igarashi and Inti Creates are back with more retro sword-and-whip action!\n\nCurse of the Moon 2 brings classic 2D action and a dark, 8-Bit aesthetic together with modern playability. The multi-scenario structure of the previous title returns with an epic new story supervised by IGA (Koji Igarashi) himself. \n\nPlayers take control of Zangetsu, a swordsman from the far east who bears a deep grudge against demonkind and the alchemists who summoned them. Zangetsu must battle his way to the demonic stronghold, but he doesn't have to do it alone! Zangetsu can ally himself with a brand new cast of characters he meets along the way and add them to the playable roster. Each new character adds a variety of gameplay options, abilities, and ways to complete the game's many stages. \n\nGame Flow\nBattle through stages filled with fearsome enemies and dangerous traps, each with a massive boss waiting at the end. A chance encounter with a potential ally awaits you after defeating a boss. Will they serve as a trustworthy partner on your perilous journey?\n\nIncrease Combat Abilities\nYou can instantaneously switch between allies you have recruited at any time! Allies have their own life bars, so with each ally you recruit, you're survivability is greatly increased! \n\nShortcuts that Only Allies Can Access\nAllies have special, unique abilities which allow them to use shortcuts to skip parts of stages or access new areas! There are no special items obtainable by taking the long way around, so take every shortcut you can find! If your allies are out of commission, you'll have to take longer routes, where stronger enemies await! When your life gets low, be sure to switch then out so they'll be available when you need them.\n\nMultiple Episodes\nThe story is told over the course of multiple episodes. Only the first episode is accessible at the beginning, but more episodes will unlock as you progress through the game. The events that unfold in each episode continue into the next one, so be sure to unlock all the episodes to see the true ending. \n\nCurse of the Moon 2 had two play styles, \"Veteran\" and \"Casual\". \n\nVeteran Style\nChoose \"Veteran\" style to experiment a difficulty reminiscent of older games. An enemy's sttack knocks the player to their death...something very familiar to retro game fans. \n\nCasual Style\nEven if you're a fan of challenging games, sometimes you just want to take it easy! Casual mode is perfect for times like that. On Casual Style, things are more forgiving. Attacks don't knock the player back and lives are unlimited, alongside other changes. \n\nChanging Style\nStyle can be changed when starting a game, loading a save file, or on the Game Over screen.",
    "score": "81"
  },
  {
    "id": "690ce3a3-a2ee-49ad-8213-1351d53f53c0",
    "title": "The Last Campfire",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/6/795926e15f58893ac437da8e4d31d65c-98.jpg",
    "platform": "Switch",
    "date": "August 27, 2020",
    "description": "DISCOVER A PURPOSE\n\nThe Last Campfire is an adventure, a story of a lost ember trapped in a puzzling place, searching for meaning and a way home.\n\nON A JOURNEY\nTravel deeper into the lands beyond the dark forest and overcome the adversities before you.\n\nUNCOVER A WORLD\nDiscover beautiful wilderness filled with lost folk, strange creatures and mysterious ruins.\n\nLIGHT THE LAST CAMPFIRE\nFind hope and carry it with you on your Journey to light The Last Campfire.\n\nFROM A SMALL STUDIO\nA unique tale from Hello Games and the creative minds behind LostWinds.",
    "score": "81"
  },
  {
    "id": "54cd8c0a-dfe1-4707-b1c0-d6ec6fadad39",
    "title": "Nowhere Prophet",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/2/33707053a60fbde079d69584a3ab922b-98.jpg",
    "platform": "Switch",
    "date": "July 30, 2020",
    "description": "Prepare your decks and go on a pilgrimage through the wasteland! Travel across randomly generated maps and lead your followers in deep tactical combat. Build a loyal band of followers and survive the journey across a broken world. Barely. Take on the role of a powerful leader and mystic. Empowered with the gifts of technopathy, the ability to sense and affect electrical currents. You are the last hope to a band of outcastes and refugees. Lead them across the randomly generated wastelands. Pick fights with greedy slavers and crazy machines using the turn-based card combat. Can you survive long enough to reach the mysterious Crypt?",
    "score": "81"
  },
  {
    "id": "35ef02cc-bb45-470d-8fa1-7b00f0f18bdb",
    "title": "Metro Redux",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/2/c022c768a70a5f35ccbc4f3592b96ca8-98.jpg",
    "platform": "Switch",
    "date": "February 28, 2020",
    "description": "In 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the earth’s surface into a poisonous wasteland. A handful of survivors took refuge in the depths of the Moscow underground, and human civilization entered a new Dark Age.\n\nThe year is 2033. An entire generation has been born and raised underground, and their besieged Metro Station-Cities struggle for survival, with each other, and the mutant horrors that await outside.\n\nYou are Artyom, born in the last days before the fire, but raised underground. Having never ventured beyond the city limits, one fateful event sparks a desperate mission to the heart of the Metro system, to warn the remnants of mankind of a terrible impending threat.\n\nBut will they even listen? Rather than stand united, the factions of the Metro are locked in a struggle for the ultimate power, a doomsday device from the military vaults of D6. A civil war is stirring that could wipe humanity from the face of the earth forever.\n\nIncluding the epic single-player campaigns of both Metro 2033 and Metro: Last Light, Metro Redux takes you on a journey from the forgotten catacombs beneath the subway to the desolate wastelands above, where your actions will determine the fate of mankind.\n\nMetro Redux is the ultimate double game collection, including the definitive versions of both Metro 2033 and Metro: Last Light, now available on Nintendo Switch™\n\nNewcomers to the series will get the chance to experience two of the finest story-driven shooters of all time in one vast package; an epic adventure combining gripping survival horror, exploration and tactical combat and stealth.\n\nThose who favoured the more survival-horror oriented gameplay of ‘Metro 2033’ can play both campaigns in the ‘Survival’ Play-Style, a fraught, slow burn fight for survival. Those who enjoyed the more action-oriented gameplay of ‘Metro: Last Light’ can try the ‘Spartan’ Play-Style, providing Artyom with a powerful set of combat skills.\n\nWith the legendary Ranger Mode  included to offer an extra layer of challenge and immersion, and all previous released DLC, Metro Redux offers 50+ hours of AAA FPS gameplay for an incredible price.",
    "score": "80"
  },
  {
    "id": "b852c1c3-6f64-4ff5-9a73-56b5bbc3b055",
    "title": "Vitamin Connection",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/1/bd9976827d05be08922079d7ba97b126-98.jpg",
    "platform": "Switch",
    "date": "January 17, 2020",
    "description": "By blasting subatomic foes with your Vitamin Beam, utilizing a special claw tool, and navigating maze-like stages, you'll save the members of the Sable family - including the dog! - from a variety of hazardous and increasingly wacky predicaments. Each level also includes sub-games featuring rhythm challenges, Pong-like reflex tests, and more.",
    "score": "80"
  },
  {
    "id": "846775f6-dccd-405f-b9ad-eb45ac7883bc",
    "title": "Catherine: Full Body",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/2/25ca7c76da123ec3886096da1cceb764-98.jpg",
    "platform": "Switch",
    "date": "July 7, 2020",
    "description": "Dark. Intense. Intoxicating. Our indecisive protagonist, Vincent, has been with his long-time girlfriend, Katherine, for five years. But instead of taking the next step into marriage, Vincent finds himself in an affair with the provocative blonde bombshell, Catherine! Thrown into discord by his own infidelity, he finds solace in the innocent Rin – further complicating matters. Adding to Vincent’s dilemma, he begins having nightmares that force him to climb for his life... Will he survive the trials and tribulations of love, or fall to temptations?",
    "score": "80"
  },
  {
    "id": "3dd92abc-82d9-4dd6-9df8-bbc18ffc61db",
    "title": "Sega Ages: Thunder Force AC",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/5/2cf08e397c4f729a8319e1eb0e3b8fa4-98.jpg",
    "platform": "Switch",
    "date": "May 28, 2020",
    "description": "Fasten your seatbelts! It's gonna be an eye popping, pulse pounding, mind blowing ride! Your super-powered starship is under attack on land, air and sea in this Action/Arcade thriller. But you're prepared to go out with a bang. Zap! Blast your way through a fire storm. Splash! Use the wave weapon to pulverize an enemy. It's an 8-stage intergalactic fight to the finish. And even the multi-level scrolling and haunting sound effects are out of this world. Boss characters with the most chillingly realistic graphics try to show you who's the boss. But if you're quick enough and smart enough, you can prevail.",
    "score": "80"
  },
  {
    "id": "8697403f-ac02-4430-8046-f2a1b68f1b4b",
    "title": "Mr. Driller: Drill Land",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/9/435e3b489046a1920acee95eef50d068-98.jpg",
    "platform": "Switch",
    "date": "June 25, 2020",
    "description": "The popular action puzzle game “Mr. DRILLER DrillLand” makes its Western debut on the Nintendo Switch™! You’re invited to a secret amusement park known as “DrillLand” – 500 meters underground! Explore and conquer the five “attractions” with simple, yet exciting, gameplay that guests of all ages can enjoy!\n\n    Mr. DRILLER returns! – The first Mr. DRILLER game for the Nintendo Switch™ featuring updated graphics and HD cutscenes! \n    Dig your way to victory! – Each of the five attractions in DrillLand features their own set of unique gameplay rules. Can you dig your way through each attraction and defeat the final boss?!\n    Competitive multiplayer modes! – Play with up to 4 players on one console—race to the finish or battle it out in “Free-for-All” or “Pairs”! \n    Take it easy! – All new “Casual Mode” for those who want to enjoy digging through DrillLand at a leisurely pace!",
    "score": "80"
  },
  {
    "id": "bb864435-c005-4171-b1f6-089ff8edae6d",
    "title": "Faeria",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/8/5c362707d684e626e179398725656292-98.jpg",
    "platform": "Switch",
    "date": "August 13, 2020",
    "description": "With its unique living board, Faeria will challenge you with truly strategic card battles. Craft your deck, shape the battlefield, and fight for victory!\n\nA strategy game like no other. Build exciting decks and shape the battlefield as you fight epic battles. Raise mountains, build forests, fill lakes, or harness the sands of the deserts. You choose your own path to victory.\n\nEnjoy 100+ hours of solo content, co-operative missions, and puzzles! Explore a vast array of challenges that reward you in return. Journey through the Oversky and defeat devious World Bosses - or even play enemy AI in draft mode!\n\nEnter Pandora, Faeria's unique draft mode that where your deck-building skills are put to the ultimate test. Choose to play against the AI or put your deck to the ultimate test in PVP. Earn rewards based on how well you do. It’s the perfect way to increase your collection, or just have fun!",
    "score": "80"
  },
  {
    "id": "4ccf058d-25a2-4fd5-ae2e-a94a5ead86da",
    "title": "Telling Lies",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/2/00dd70ddedd965f9a72dfb991c34c1ec-98.jpg",
    "platform": "Switch",
    "date": "April 28, 2020",
    "description": "An investigative thriller game with non-linear storytelling, Telling Lies revolves around a cache of secretly recorded video conversations. Starring Logan Marshall-Green, Alexandra Shipp, Kerry Bishé, Angela Sarafyan and directed by Sam Barlow, creator of Her Story and Silent Hill: Shattered Memories.",
    "score": "80"
  },
  {
    "id": "44d02f46-5e67-419a-92fb-1c82bec62d6a",
    "title": "Neon Abyss",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/7/83cc9cf536eb47b3a37bbf3909a9134d-98.jpg",
    "platform": "Switch",
    "date": "July 14, 2020",
    "description": "Neon Abyss is a frantic, roguelike action-platformer where you run ‘n’ gun your way into the Abyss as part of the Hades formed ‘Grim Squad’.\n\nFeaturing unlimited item synergies and a unique dungeon evolution system, each run diversifies the experience and makes it so every choice alters the ruleset.\n\nAs you explore the underworld and face the modern gods of Neon Abyss you will craft your own upgrade path but also change multiple aspects of the game’s experience including bosses, rulesets, items, and even access new endings.",
    "score": "80"
  },
  {
    "id": "bf5987cd-f64d-4029-b0c3-e2774bb0cfa9",
    "title": "Wide Ocean Big Jacket",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/6/9dc4d690b6b9b443b27c562d707b2eef-98.jpg",
    "platform": "Switch",
    "date": "February 4, 2020",
    "description": "Take part in a classic camping trip: Roast hot dogs on the fire, go birdwatching, tell ghost stories, grab a beverage from the cooler and do cartwheels on the beach.\n\nWOBJ is a short story game including 20 chapters, 4 playable characters, 10,000 words of dialog and 8 explorable areas, all rendered in a beautiful 2D/3D art style.",
    "score": "79"
  },
  {
    "id": "dfde76f7-1eb6-4bd1-98d2-568ff2a3315a",
    "title": "Indivisible",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/5/53ace379c7300cc0a0c4ba82e092b212-98.jpg",
    "platform": "Switch",
    "date": "April 28, 2020",
    "description": "INDIVISIBLE is inspired by classics like Valkyrie Profile and Metroid, and has the unique character, world, and gameplay depth Lab Zero is known for.\n\nMeet Ajna, Indivisible protagonist.\n\nAjna is a headstrong girl raised in a remote village. Her father, the town's guardian, has trained her to be strong in mind and body to prepare her for things to come. Ajna discovers a mysterious power in herself, and sets off on a world-spanning journey. Along the way, a number of unique heroes will join her on her quest.",
    "score": "79"
  },
  {
    "id": "6fda479b-8b96-4fa9-b4e0-0b18e69e651d",
    "title": "Shantae and the Seven Sirens",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/5/8e8bced9767fa1136e92c9d85c485fd3-98.jpg",
    "platform": "Switch",
    "date": "May 28, 2020",
    "description": "New locations, abilities, and friends await in Shantae's biggest adventure yet!\n\nShantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble in paradise. As Shantae gets caught up in the island's sinister secrets, she'll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she'll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae's powers to suit their own style of play. \n\nKey Features:\n\n* Explore an interconnected world using new Fusion Magic creature transformations, including a newt and other aquatic forms!\n* 4K-resolution hand-painted visuals (on 4K devices only)!\n* All-new characters and returning favorites like Rottytops, Sky, Bolo, and the nefarious Risky Boots!\n* Collect and power up with monster cards!\n* Enjoy minigames, acquire magic and items, and uncover secrets!\n* Gorgeously animated TV-style cutscenes!",
    "score": "79"
  },
  {
    "id": "1417ed6a-bf13-483a-b693-1699f70db9aa",
    "title": "Naruto Shippuden: Ultimate Ninja Storm 4 - Road to Boruto",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/0/ee262769a6f5d37f2c359d32580c7cdd-98.jpg",
    "platform": "Switch",
    "date": "April 24, 2020",
    "description": "The latest game in the Ultimate Ninja Storm series is finally here for Nintendo Switch. It features all DLC, including the latest \"NEXT GENERATIONS\" DLC Update Pack. Relive the Fourth Great Ninja War that unfolded in Naruto Shippuden, and experience the story of Boruto: Naruto the Movie featuring Naruto's son, Boruto Uzumaki. Plus, choose from 124 ninja—the most in the series! Join in action-packed battles, whenever and wherever you want.",
    "score": "79"
  },
  {
    "id": "2566d9b8-fad9-4cd0-af3b-6fccbb5583eb",
    "title": "Stories Untold",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/8/9f2f763d496f7a469540a9b609051ab2-98.jpg",
    "platform": "Switch",
    "date": "January 16, 2020",
    "description": "Stories Untold is a compilation tape of four experimental text adventures, including a remaster of the original episode The House Abandon.",
    "score": "79"
  },
  {
    "id": "eacdcea1-1625-4562-b879-4c6db3c3c856",
    "title": "Paper Mario: The Origami King",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/6/7a879a7f9cd698fe012c5dd4858f85d8-98.jpg",
    "platform": "Switch",
    "date": "July 17, 2020",
    "description": "Featuring a new ring-based battle system that mixes puzzle-solving skills with traditional turn-based combat, Paper Mario: The Origami King aims to put new twists in the series' established formula.",
    "score": "79"
  },
  {
    "id": "2125ffa2-f01a-4dee-95cb-72ce5f189e7c",
    "title": "Hatsune Miku: Project Diva MegaMix",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/1/2ab51c1fc487257a4d845dcaf5f59b60-98.jpg",
    "platform": "Switch",
    "date": "May 15, 2020",
    "description": "[Also known as \"Hatsune Miku Project Diva Mega39\"] Based on the popular Hatsune Miku: Project DIVA Future Tone, Hatsune Miku: Project DIVA Mega Mix takes the series to a new dimension on the Nintendo Switch, giving both new fans and Project DIVA veterans ways to play at home or on the go. Rhythm game modes features both traditional button controls, as well as a new game mode exclusive to the unique functions of the Nintendo Switch.",
    "score": "79"
  },
  {
    "id": "cb330393-f9e4-4586-9520-779f8342b7a9",
    "title": "Sega Ages: Puyo Puyo 2",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/5/01adcde2c90406a048d781b3b8d00e54-98.jpg",
    "platform": "Switch",
    "date": "February 20, 2020",
    "description": "The object of this head-to-head puzzle game is to clear your grid of falling patterns called puyos by forming chains of four or more same-colored puyos in a straight line or one of several geometric patterns. What makes this a challenging two-player contest is the fact that when you clear a chain of puyos from your grid, it drops a random piece of filler onto your opponent's grid. The more puyos you clear, the more you fill your opponent's grid, and if you can clutter up his grid enough to fill it to the top, you've won the game.",
    "score": "78"
  },
  {
    "id": "ef9fd8da-ed62-4219-8c1b-f058a3b7158d",
    "title": "Ibb & Obb",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/7/15917629cf6fc0098dfb0e8c1f758442-98.jpg",
    "platform": "Switch",
    "date": "March 5, 2020",
    "description": "ibb & obb is a two player cooperative game set in a puzzle filled world where gravity goes both up and down. You can only succeed by working closely together.\n\nFind a friend for some true local cooperative couch fun or match up online.\n\nFall up and jump down through 15 levels filled with double gravity puzzles and discover 8 hidden worlds that will test your new non-Newtonian skills to the maximum.",
    "score": "78"
  },
  {
    "id": "4a09a31d-a109-4659-a626-6b00d8086e5b",
    "title": "Double Dragon & Kunio-kun Retro Brawler Bundle",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/5/ca5400ba1a9a5315ba3618aaac19fe25-98.jpg",
    "platform": "Switch",
    "date": "February 20, 2020",
    "description": "DOUBLE DRAGON & Kunio-kun Retro Brawler Bundle, consists of 18 titles including 7 DOUBLE DRAGON and Kunio-kun vintage games from the 80’s and 90’s, and all 11 Kunio-kun classic titles from the Family Computer Disk System that have been localized into English for the first time ever. Game genres vary from side-scrolling action, beat-’em-up, sports, and action RPG. Online play mode is available for all titles, and a total of 55 in-game missions are waiting for you to obtain nicknames and avatars to show off to your friends! Can you complete all the games?",
    "score": "78"
  },
  {
    "id": "fc6f5879-2de7-41af-9d7d-b8a04713f024",
    "title": "In Other Waters",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/9/4272c027ef987527e19ba10b79502151-98.jpg",
    "platform": "Switch",
    "date": "April 3, 2020",
    "description": "Play as an Artificial Intelligence guiding a stranded xenobiologist through a beautiful and mysterious alien ocean. A non-violent sci-fi story, enter a world of wonder, fear and vulnerability, unraveling the history and ecology of an impossible planet. What will you discover together?\n\nEXPLORE AN ALIEN OCEAN: Freely dive into an expansive section of seafloor, from shimmering reefs to inky depths. Unlock upgrades and make discoveries that allow you to open up new paths, uncovering strange creatures and environments as you do.\n\nSEE THE WORLD THROUGH AN AI LENS: Navigate an elegant, intuitive UI via touch or mouse controls. Interpret signals, set headings, and map the ocean through experimentation and intuition.\n\nBECOME AN XENOBIOLOGIST: Discover and catalogue species through observation, scanning, taking samples, and interacting with alien life. Read Ellery’s notes, look at her sketches, and help her classify an entirely new ecosystem.\n\nPLAN YOUR DIVES: Choose whether to study creatures, investigate secrets or dive new areas, then come back to your base to study samples in the lab, chat to Ellery or read her journals to understand more about this world.",
    "score": "78"
  },
  {
    "id": "3cd75a73-f1da-4cd2-a230-f4d2efd2668e",
    "title": "Burnout Paradise Remastered",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/8/8522f81d2eccb0e6b3bc2c21d983426c-98.jpg",
    "platform": "Switch",
    "date": "June 19, 2020",
    "description": "Welcome back to Paradise City! Make action your middle name as you rule the streets in Burnout Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever!\n\nBurnout Paradise Remastered provides the ultimate driving playground for you and your friends to play online. This remaster includes all DLC from the Year of Paradise, including the Big Surf Island update, meticulously recreated and ready to wreck in 4K on the PlayStation 4 Pro and Xbox One X.",
    "score": "78"
  },
  {
    "id": "c2929e71-a78b-43a5-88aa-113bad139b9e",
    "title": "Not Tonight: Take Back Control Edition",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/6/d3ee7e536a9e8fe0bd20872e659f516a-98.jpg",
    "platform": "Switch",
    "date": "January 31, 2020",
    "description": "Not Tonight is a post-Brexit management game, fusing a time-pressure RPG with a politically charged story where every decision matters. Will you join the resistance and fight the regime -- or keep your head down and hope that one day this will all be a distant memory? \n\nNot Tonight: One Love is a full, extra chapter that follows on from the main Not Tonight storyline. King's Head Dave has had just about enough of everything happening in Britain, and has decided to pack up and move to France, in the hope of finding true love.\n\nIn an alternative Britain where Brexit talks have collapsed, an extreme far-right government has taken power. Citizens of European heritage have been rounded up and exiled. Forced out of your previous life, you find yourself in the midst of a booming gig economy, fighting to scrape by and return to the city you call home.",
    "score": "78"
  },
  {
    "id": "beb86510-a475-4615-967f-0d233486205f",
    "title": "Murder by Numbers",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/9/7e077ab08a4bac453ffd723a1d056165-98.jpg",
    "platform": "Switch",
    "date": "March 5, 2020",
    "description": "Los Angeles, 1996. Honor Mizrahi was just an actress on a hit TV detective show. But when her boss ends up dead just minutes after he fires her,she finds herself starring in her own murder mystery. Teaming up with SCOUT, a reconnaissance robot thrown away after a mysterious incident, she sets out to clear her name - and a new detective duo is born!\n\nInvestigate a range of murders across TV studios, glitzy award shows, drag clubs, and more - all set to an energetic soundtrack from famed composer Masakazu Sugimori (Phoenix Wright: Ace Attorney, Ghost Trick and Viewtiful Joe).\n\nUncover a dark conspiracy by interrogating a wild range of weird and wonderful characters, designed by the incomparable Hato Moa, creator of Hatoful Boyfriend.",
    "score": "78"
  },
  {
    "id": "87680b48-4134-4955-ae1b-f6e3b4d95cf9",
    "title": "Sega Ages: Shinobi",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/9/3b68c25f2fb6b6470fece0931ce01472-98.jpg",
    "platform": "Switch",
    "date": "January 23, 2020",
    "description": "Shinobi. It's Japanese for stealth, the perfect description of a Master Ninja. And that's exactly what you are! Armed with throwing stars and finely-honed battle skills, you must defeat the Ring of Five. Fight your way past mercenaries and karate thugs. Take out the meanest martial artists and rescue hostages. But these dangers pale in comparison to your ultimate challenge: A fight to the death against five evil Ninja Assassins whose mastery of the deadly ancient arts may well surpass your own!",
    "score": "78"
  },
  {
    "id": "0a7692c3-fddc-45fd-ba2c-6a2d67d6fa30",
    "title": "Good Job!",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/1/02cc7b328a59845a2c13497e796f7ed9-98.jpg",
    "platform": "Switch",
    "date": "March 26, 2020",
    "description": "As the clumsy child of a CEO, you must climb the corporate ladder one office-themed puzzle at a time! Complete puzzles in multiple ways as you experiment with the interactive environments—a projector can be wheeled gently through an electric door…or catapulted through the wall. So toil (or tumble) your way to the top and make your father proud.",
    "score": "78"
  },
  {
    "id": "939dca67-a9e4-465b-8481-92413367d972",
    "title": "Depixtion",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/5/d9fa6f85a38668f301e7499609722de7-98.jpg",
    "platform": "Switch",
    "date": "February 28, 2020",
    "description": "Based on the popular Picross series, Depixtion blends color mixing mechanics with the rules of nonograms to create a uniquely colorful experience.",
    "score": "78"
  },
  {
    "id": "15739ab6-ad8c-4b4c-848f-b93b013cdc75",
    "title": "Shinsekai: Into the Depths",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/9/3dcf66686a500a0a92671ce9c4f33808-98.jpg",
    "platform": "Switch",
    "date": "March 26, 2020",
    "description": "Capcom presents a fresh and original undersea exploration game, filled with unique visual and audio experiences for you to discover. The land has slowly but steadily been covered with ice, forcing mankind to take refuge in the ocean. Even the sea cannot protect them forever. The ice overtakes the undersea home of a lone aquanaut, forcing an unplanned journey of exploration and discovery. Take control and follow a mysterious mechanical creature ever deeper... Could there be others still living on so far beneath the surface?",
    "score": "77"
  },
  {
    "id": "9b5eecad-c2c8-42da-969a-d7828bd5c0d5",
    "title": "Story of Seasons: Friends of Mineral Town",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/4/95c02f86ecfaa3d2dc44e3c48428c0f9-98.jpg",
    "platform": "Switch",
    "date": "July 14, 2020",
    "description": "Originally released for the Nintendo Game Boy Advance in 2003, STORY OF SEASONS: Friends of Mineral Town is a complete remake that will let series fans revisit the charming world of Mineral Town, while also introducing it to a new generation of farmers. In this peaceful setting, players will grow crops, take care of animals, and build relationships with villagers.  * Rediscover one of STORY OF SEASONS' most beloved entries: This Nintendo Switch remake of the classic game preserves the compelling gameplay, colourful characters and rustic charm of the original 2003 Game Boy Advance release. With buttery-smooth HD visuals and a heartwarming reimagining of the iconic locale, series veterans and newcomers will soon find themselves welcomed by the gentle rhythms of Mineral Town.\n\n* Live the simple life in Mineral Town: Tap into the power of nature as you breathe life back into your grandfather's farm, tending crops and raising livestock to earn your keep. With more than 20 varieties of crops to grow, and animals ranging from alpacas to angora bunnies, no day is the same as seasons cycle and new skills await.\n\n* Forge friendships with the townsfolk and win their hearts: Mineral Town is full of friendly faces willing to help you find your feet in your new hometown. Get to know the locals and learn their stories as you go about your daily life, and you might even find love along the way!\n\n* Activities galore for days off from the farm: Whether it's high-tailing in horseraces, catching a champion trout or showcasing your culinary creativity, the busy calendar full of festivals means that there's never a dull day in Mineral Town. If you're looking for a quieter time, take yourself away to the local hot spring, delve deep into the mines, or seek out the seasonal secrets of the town.",
    "score": "77"
  },
  {
    "id": "74ba1713-7e44-43d1-aeaf-40469b9d030c",
    "title": "Super Crush K.O.",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/3/704d3e90097f83facb0dfd65586b3012-98.jpg",
    "platform": "Switch",
    "date": "January 16, 2020",
    "description": "Super Crush KO is a fast-paced brawler set in a vibrant, near-future city. Zip up your favorite neon jacket and combo your way through swarms of deadly robots to save your kidnapped kitten and, while you’re at it, save humanity from an AI apocalypse.",
    "score": "77"
  },
  {
    "id": "f891ed92-26d8-45e2-ab1a-8f435622df49",
    "title": "The Turing Test",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/5/6dfcd14b38bc684cce516c15ea3faae6-98.jpg",
    "platform": "Switch",
    "date": "February 7, 2020",
    "description": "The Turing Test is a first person puzzler from the developers of ‘Pneuma: Breath of Life’ that explores the phenomena of consciousness and challenges the meaning of human intuition. Take control of Ava Turing, an engineer for the International Space Agency (ISA), and progress through a narrated story of introspection and morality whilst uncovering the hidden mysteries of Europa. Delve into The Turing Test’s human interaction puzzles and arm yourself with logical and methodical thinking. Take on tests designed in such a way that only a human could solve them. In an evolving story based on mankind’s inherent need to explore, protect and survive; players search deeper into Europa’s ice crusted core and transcend the line between man and machine. Investigate the truth behind the ISA research base on Jupiter’s moon Europa. Solve puzzles using your Energy Manipulation Tool (EMT) to transfer power out from one object and into another. Power up and take control of artificially intelligent machines, manipulate giant structures and solve complex tasks; all woven into a multi-layered story based on the human struggle for control. The Turing Test can only be experienced through the interactive medium of video games. The Turing Test sparks your synapses into action in this electrifying new first person puzzler, as players learn the true cost of retaining human morality.",
    "score": "77"
  },
  {
    "id": "0517e013-e3b7-40b3-b9e3-30469e310a01",
    "title": "Panzer Paladin",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/7/b576d177a7b69f9687fa793303778357-98.jpg",
    "platform": "Switch",
    "date": "July 21, 2020",
    "description": "The sight of giant swords blazing through the night sky might be hair-raising, but stand your ground! The sinister Ravenous and his legions of brutal demons are poised for battle. Even all the armies of the world can’t stop them, but humanity has one final ace in the hole: a cutting edge power armor called Paladin.\n\nIt’s now up to the strong-willed android named Flame to become a Squire, take control of the Paladin and track down all Weapon Keepers and their diabolical leader. The showdown between mankind’s highest technological prowesses and the powerful forces of the occult has begun!\n\nSeize weapons from the denizens of the Netherworld and dish out a taste of their own medicine! Show them the power of cutting edge technology combined with swordsmanship. Slash, bash and thrust your way through a series of mind-blowing levels located around the world, all of it rendered in glorious 8-bit graphics! Hop in your Panzer Paladin and take up arms!",
    "score": "77"
  },
  {
    "id": "f6a38560-3792-458c-9a93-ed622a492df6",
    "title": "Ion Fury",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/8/1304ebb94cd7b85dff36b9d7faa9033d-98.jpg",
    "platform": "Switch",
    "date": "May 14, 2020",
    "description": "Tear through cyborg infantry, giant robots and even wendigos with eight retro-inspired weapons. Dual-wield Penetrator SMGs with incendiary ammunition to scorch foes, wreak havoc with the Disperser with either shotgun shells or swap in grenade rounds, or chuck a Clusterpuck into a room and delete everyone. Utilizing the same Build engine behind the original Duke Nukem 3D, Ion Fury offers the beloved feel of ‘90s shooters. Seamlessly integrated modern features include headshots, environmental interaction, improved physics, auto-saves, and widescreen functionality. Ion Fury’s marriage of both styles provides both a genuine introduction to classic FPS games and a worthy addition to the genre as a whole, as evidenced by winning IndieDB’s game of the year award.",
    "score": "77"
  },
  {
    "id": "94bd9dad-31ba-4fd0-88db-8d03299d5b8f",
    "title": "DOOM 64",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/8/24a928b827e1a36877b3f7ccca2db73f-98.jpg",
    "platform": "Switch",
    "date": "March 20, 2020",
    "description": "You killed the Demons once, they were all dead. Or so you thought... A single Demon Entity escaped detection. Systematically it altered decaying, dead carnage back into grotesque living tissue. The Demons have returned - stronger and more vicious than ever before. You mission is clear, there are no options: kill or be killed!",
    "score": "77"
  },
  {
    "id": "fe20c877-ea2d-46f1-99ff-2632374c9fc3",
    "title": "Do Not Feed the Monkeys",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/2/c507fe8313280e88d697eb0455b63215-98.jpg",
    "platform": "Switch",
    "date": "June 1, 2020",
    "description": "You are invited to join “The Primate Observation Club”, where you will observe the lives of caged monkeys and carefully analyze the information obtained.\n\nGLOSSARY OF TERMS:\n\nTHE PRIMATE OBSERVATION CLUB: a shadowy group that observes other people through surveillance cameras and compromised webcams.\nYOU: the newest member of the CLUB, tired of your run-down apartment, dull existence, and boring job.\nMONKEYS: dozens of strangers who have fallen prey to your surveillance.\nPRIVACY: Something that the monkeys think they have.\nPC (PERSONAL COMPUTER): Yep, we put a PC in your game that’s on your Nintendo Switch™ so that you can work on a PC while you’re playing the game that’s on your Nintendo Switch™ console!\nFEEDING THE MONKEYS: Interacting or interfering with the subjects in any way. Feeding the monkeys is strictly prohibited.\n\nOddly enough, club members keep feeding the monkeys as though they just can’t abide by this very simple rule! How about you? Will you help those you’re spying on, extort them, expose them and sabotage their dreams, or will you follow your instructions and sit twiddling your thumbs while the world burns?",
    "score": "77"
  },
  {
    "id": "d368630e-9381-432b-9ba9-dc68b03f9d83",
    "title": "XCOM 2 Collection",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/7/4ef523571b6d2c71733aea594e153ce3-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2020",
    "description": "Ignite a global resistance and reclaim Earth from alien occupation in XCOM 2 on Nintendo Switch. The XCOM® 2 Collection includes the award-winning strategy game XCOM 2, four DLC packs (Resistance Warrior Pack, Anarchy’s Children, Alien Hunters, Shen’s Last Gift) and the War of the Chosen expansion all in one package. Activate any of the additional content (DLCs and the Expansion) or just play the base game. \n\nXCOM® 2:\n\nAliens rule Earth, promising a brilliant future for mankind while secretly hiding a sinister agenda. As the leader of a guerrilla force facing impossible odds, you must ignite a global resistance to eliminate the alien threat and save the hum race from extinction. \n\nXCOM® 2: War of the Chosen:\n\nThis expansion adds extensive new content in the fight against ADVENT including new Hero classes, powerful new enemies, as well as new missions, environments and increased depth in strategic gameplay.\n\nFOUR DLC PACKS: \n\n    Resistance Warrior Pack: Customize your squad of resistance fighters with a set of bonus outfits and head gear, as well as custom armor and face camo. \n    Anarchy’s Children: This rebellion-themed content pack introduces more than 100 new exotic customizations for the entire arsenal of armors available to your XCOM soldiers. These options are purely cosmetic and do not alter the stats of a soldier.\n    Alien Hunters: Transform the soldiers of XCOM into an elite alien hunting squad with impressive new weapons and armor to face off against new alien Rulers that will pursue your squad across an entire campaign. Additional cosmetic upgrades to soldiers and the Avenger are included, as well as a new epic mission where Central Officer Bradford leads a squad with the guidance of an old friend.\n    Shen’s Last Gift: Investigate ADVENT’s “Lost Towers” facility where Chief Engineer Lily Shen accompanies your squad in search of her late father’s secretive final project. Discover a unique new soldier class complete with powerful new combat abilities, strategy mechanics, and customization options.",
    "score": "77"
  },
  {
    "id": "ca169eba-47fd-4bfd-9bd8-3b3114392092",
    "title": "Aokana - Four Rhythms Across the Blue",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/3/7b7e47bbd9cdf2c2c2b1b6094b64b9fe-98.jpg",
    "platform": "Switch",
    "date": "August 21, 2020",
    "description": "Welcome to a world where people fly freely through the power of anti-gravity shoes. Become a coach for players who race in the sky and make the acquaintance of four charismatic girls. Follow their adventures as you all grow closer in this emotional story of hope, love and sportsmanship.",
    "score": "77"
  },
  {
    "id": "89f66cfe-65a2-454d-8b6f-4be396b8c08a",
    "title": "Moving Out",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/7/9f2ea1c77efc6b98ea405ad26779cf30-98.jpg",
    "platform": "Switch",
    "date": "April 28, 2020",
    "description": "Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!\n\nAre you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there's no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!",
    "score": "77"
  },
  {
    "id": "a3b0e31e-77b0-4905-ad3a-d1db2caba562",
    "title": "ITTA",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/4/5368b05a84f34c4ea8ef748ea2e8f1a8-98.jpg",
    "platform": "Switch",
    "date": "April 22, 2020",
    "description": "Test your limits in ITTA, a bullet-hell, boss-rush style adventure where you play as a young girl armed with her father’s revolver and guided by a strange ghostly cat. ITTA is a bullet-hell adventure set in a world filled with monstrous bosses. When Itta wakes up and finds herself surrounded by her dead family, her only guide is a strange spirit that takes the form of the family cat who gifts her a glowing revolver for protection.\n\nAs Itta, players must seek out the powerful beings locked away beneath this seemingly peaceful world and go toe-to-toe against them in harrowing battles. From hulking ancient golems to toothy horrors, Itta’s journey will push both you and her past their limits. Luckily, you can change up your combat style by finding weapons with unique attack styles, and if the going gets too tough, toggle on invincibility or player damage multipliers at any time.",
    "score": "76"
  },
  {
    "id": "1e9bf15d-7ad4-4c6a-b3de-d4af3211ba19",
    "title": "Brigandine: The Legend of Runersia",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/5/5d86c6ea3c1fc4a2a68b99f93fccd683-98.jpg",
    "platform": "Switch",
    "date": "June 25, 2020",
    "description": "An Endless Fantasy WarGrand Strategy Simulation. Conquer the continent in this grand strategy simulation game\nThe continent of Runersia is home to six major powers with more than 40 bases, 100 knights, and 50 types of monsters.\nSelect a ruler, compose your platoons of knights and monsters, and march to claim enemy bases.\nThe player chooses how they will battle, so devise the best strategy to lead your nation toward continental conquest. How will your legend unfold?\n\n\nSimple yet deep war simulation game with unit growth and map-based platoon battles\nTime passes on Runersia in seasons, each one consisting of an Organization Phase and an Attack phase.\nDuring the Organization Phase, knights and monsters with various classes and skills are organized into platoons in preparation for the upcoming battles.\n\nDuring the Attack Phase, turn-based platoon battles take place on a map made up of hexagonal spaces. Make use of unit skills, elements, enclosure effects, terrain advantages, and other battle tactics to lead your side to victory!\nAll nations, knights, and monsters in the game will continue to battle and grow as you do.\nThe game is also packed with other ways to grow your armies such as class changes, equipment, and various items.",
    "score": "76"
  },
  {
    "id": "592b45c4-c476-4ad8-81e6-0455ef3b2aa2",
    "title": "Carrion",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/8/d3c58964f43f4cb72b4a3cbfa1046698-98.jpg",
    "platform": "Switch",
    "date": "July 23, 2020",
    "description": "In Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities on the path to retribution that include a web-like ranged attack, the ability to bend light to become temporarily invisible, and even possess humans for maximum terror.",
    "score": "76"
  },
  {
    "id": "324023f9-4017-4392-939a-378cb6a108fe",
    "title": "Inmost",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/0/639a9b778c05c3c2643189510d6cfe0e-98.jpg",
    "platform": "Switch",
    "date": "August 21, 2020",
    "description": "Inmost is an atmospheric, story-driven puzzle platformer, following three playable characters within one dark, interconnecting story. In an old abandoned castle, you’ll need to explore every nook and cranny, avoid detection, slice your way through enemies and spring deadly traps in order to escape the evil that lurks within…",
    "score": "76"
  },
  {
    "id": "370039c3-7854-47e8-b63e-bb4ce6ce84a1",
    "title": "The Eternal Castle Remastered",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/9/3372b844b003d8ed0a96fa07a65fc5e0-98.jpg",
    "platform": "Switch",
    "date": "May 15, 2020",
    "description": "The Eternal Castle [REMASTERED] is an ambitious attempt to modernize an old classic in order to keep its memory alive. Through detailed research and hard work, the production team tried to expand the experience while keeping the same 'feel' and emotional flow of the original masterpiece from 1987.",
    "score": "76"
  },
  {
    "id": "5944f143-4561-4c8a-bb44-751a3a0fdc38",
    "title": "Darius Cozmic Collection: Arcade",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/4/205b6d3053bb261677eda1ed7fed8dcb-98.jpg",
    "platform": "Switch",
    "date": "June 16, 2020",
    "description": "The Darius Cozmic Collection Arcade contains 4 legendary console titles in a total of 7 versions:\n\n    DARIUS (old version)\n    DARIUS (new version)\n    DARIUS (extra version)\n    DARIUS II (dual screen version)\n    SAGAIA (Ver. 1)\n    SAGAIA (Ver. 2)\n    DARIUS GAIDEN",
    "score": "76"
  },
  {
    "id": "f5128ae7-e3ee-4089-a000-db1686089201",
    "title": "Langrisser I & II",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/9/141ecd04557f0a9e3e88733d2aff49b0-98.jpg",
    "platform": "Switch",
    "date": "March 10, 2020",
    "description": "Both Langrisser I & II have returned with their classic stories of good and evil now remade in beautiful high-definition visuals, reorchestrated music, and quality-of-life improvements to the gameplay and user experience.",
    "score": "76"
  },
  {
    "id": "cf3d3283-2dbd-4726-a808-292a00e12bfd",
    "title": "Fury Unleashed",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/8/d5fd05565e1fe4cadfd441631b0de948-98.jpg",
    "platform": "Switch",
    "date": "May 8, 2020",
    "description": "Fury Unleashed is an action platformer where you shoot your way through the pages of an ever-changing comic book. Take advantage of unique combo system to unleash your fury and become a whirling tornado of destruction. Discover why your creator doubted in you and prove him wrong.",
    "score": "76"
  },
  {
    "id": "31d8b64c-6b54-49d3-9d99-0c781e182928",
    "title": "Samurai Shodown",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/9/cb08f7acc37dce610716bdec0e2b8831-98.jpg",
    "platform": "Switch",
    "date": "February 25, 2020",
    "description": "SAMURAI SHODOWN has enjoyed worldwide success as a blade-wielding fighting game series since its first release in 1993. 11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay! Faithfully reproducing the game mechanics and atmosphere that contributed to the success of the series, SAMURAI SHODOWN includes a revolutionary feature that learns from players game actions and patterns in order to create CPU-controlled \"ghost\" characters. With a story set one year before the very first installment, a diverse cast of returning and new characters cross paths in order to fulfill their destinies!\n\n* SAMURAI SHODOWN is faithful to the series' roots by delivering the same tense and exhilarating battles that it has always been known for. \n\n* Using the power of UNREAL® ENGINE 4 the series is able to achieve a level of detail and graphical quality like never before. \n\n* Using revolutionary Deep Learning AI, the game will learn from player tactics and create Ghost characters which players around the globe can share and fight against.",
    "score": "75"
  },
  {
    "id": "91fab9d8-99a4-4c31-9ea0-7d2016b42657",
    "title": "Superliminal",
    "rankNumber": "82.",
    "img": "https://static.metacritic.com/images/products/games/6/ecf9838412c248378638db43bb134a5e-98.jpg",
    "platform": "Switch",
    "date": "July 7, 2020",
    "description": "Perception is reality. Escape from a mind-bending dream where everything is exactly as it seems.\n\nAs you fall asleep with the TV on at 3AM, you remember catching a glimpse of the commercial from Dr.Pierce’s Somnasculpt dream therapy program. By the time you open your eyes, you’re already dreaming - beginning the first stages of this experimental program. Welcome to Superliminal.\n\nSuperliminal is a first-person puzzle game based on forced perspective and optical illusions. Puzzles in this game give you a sense of the unexpected. Players need to change their perspective and think outside the box to wake up from the dream.",
    "score": "75"
  },
  {
    "id": "b2610286-db80-45e4-bdc5-f0837b573a71",
    "title": "Willy Jetman: Astromonkey's Revenge",
    "rankNumber": "83.",
    "img": "https://static.metacritic.com/images/products/games/2/d913f1313c3fa65de82a8079e731f582-98.jpg",
    "platform": "Switch",
    "date": "January 31, 2020",
    "description": "Willy Jetman: Astromonkey's Revenge is an arcade shooter full to the brim with action and shooting, inspired by the console classics of the 90s. In the orbit of the planet Gravos there has been a terrible accident that has caused an environmental disaster, filling the planet with space garbage. Willy is a street sweeper whose mission will be to collect the garbage and take it to the recycling centres while facing countless enemies, but he will soon find out that his destiny is preparing more surprises than he could have imagined. Enjoy this exciting adventure that will transport you to a faraway world. Explore, fight, earn experience, purchase weapons... don't let your guard down even for a second and save your friends to become the biggest intergalatic hero of all time... or not.",
    "score": "75"
  },
  {
    "id": "2535e0f2-f517-4b9d-b606-ed0aab830b93",
    "title": "Fire Emblem: Three Houses - Side Story: Cindered Shadows",
    "rankNumber": "84.",
    "img": "https://static.metacritic.com/images/products/games/3/556c9d5da81b1ca199d54173b8348ca4-98.jpg",
    "platform": "Switch",
    "date": "February 13, 2020",
    "description": "Work with a group called the Ashen Wolves, a forgotten group of students who inhabit the underground facility called Abyss. Yuri, Hapi, Balthus, and Constance are the four members of the Ashen Wolves.",
    "score": "75"
  },
  {
    "id": "10fbcd57-b7b0-4f25-97c9-39728e759b13",
    "title": "Bloodroots",
    "rankNumber": "85.",
    "img": "https://static.metacritic.com/images/products/games/4/076dc315c0925c1e96890cddc970c503-98.jpg",
    "platform": "Switch",
    "date": "February 28, 2020",
    "description": "Betrayed and left for dead, Mr. Wolf is hell-bent on finding his killer and enacting revenge - alone, and vastly outnumbered. Thankfully for Mr. Wolf, the world is your weapon in Bloodroots - a relentless action game that unfolds across the sprawling Weird West. You’ll choreograph spectacular, ultra-violent combos by making use of everything around you, from hatchets, to ladders, to...carrots? It’s improvise or die, as Mr. Wolf fights his way to the center of the mystery: why was he betrayed?",
    "score": "75"
  },
  {
    "id": "0b4ec595-0069-4f4f-beeb-2fa0a8ee8f9f",
    "title": "inbento",
    "rankNumber": "86.",
    "img": "https://static.metacritic.com/images/products/games/0/3f7c728a96fe8449cef41835bad4b8b5-98.jpg",
    "platform": "Switch",
    "date": "March 12, 2020",
    "description": "Complete over 100 levels with unique pattern-matching gameplay;\n- Experience a soothing, silent tale about cats and parenthood;\n- Enjoy a charming design inspired by Japanese aesthetics and bento cuisine;\n- Beat every stage steadily thanks to a gradually increasing difficulty;\n- Challenge yourself with advanced bonus stages;\n- Listen to a chill, original soundtrack;\n- Have more fun thanks to HD Rumble support.",
    "score": "75"
  },
  {
    "id": "ed08011b-2279-4476-a799-0168702d77f9",
    "title": "Resolutiion",
    "rankNumber": "87.",
    "img": "https://static.metacritic.com/images/products/games/5/b7fc573da0a82b69ba84eba9f1a2bd1f-98.jpg",
    "platform": "Switch",
    "date": "May 28, 2020",
    "description": "An old killer escorts a curious AI through chaotic combat, puzzling secrets, and unsettling calm in a dreamscape of madmen and sane animals. Resolutiion is a fast-paced action-adventure created by two angry German brothers leading a band of vagrants who loaded it with lovely pixels, dirty jokes, deep ideas and badassemotional tunes for 20 hours of punishing combat, rewarding exploration, and layered storytelling. Will you be the player or will you be played? In the Infinite Empire nothing is as it seems. Explore a fractured future, gathering weird weapons and stories, to piece together the past: a friend betrayed, a family broken, worlds at war. To solve the mystery of the Cradles take on a multi-cultural-mashup of cynical gods, emotional machines, zealots, luddites, and furry critters in a world that doesn’t care if it confuses or kills you — oh hey, a kitty!",
    "score": "75"
  },
  {
    "id": "3a86edb0-47e4-4cf4-90ff-f7ad37be10bd",
    "title": "Death Come True",
    "rankNumber": "88.",
    "img": "https://static.metacritic.com/images/products/games/7/91caffaf32ff2509e2f381250608885a-98.jpg",
    "platform": "Switch",
    "date": "June 24, 2020",
    "description": "A new wave interactive movie game where your actions, and the ending of the story, are determined by your choices.\n\nA completely new science fiction mystery, in full-length live-action movie format, from genius creator of the \"Danganronpa\" series, Kazutaka Kodaka.\n\nPlayer controls are simple and straightforward: just swipe to look around and tap to make a selection. Even if you are a beginner, you can enjoy the game as if you were watching a movie.\n\nThe protagonist acts as you make choices in each scene, moving the story forward.\nWhat ending awaits you after you've made your choices?",
    "score": "74"
  },
  {
    "id": "eeb49960-b571-411d-b82c-c363173c2a24",
    "title": "Arcade Spirits",
    "rankNumber": "89.",
    "img": "https://static.metacritic.com/images/products/games/4/5c44ffb3840511e9adc64b837969422f-98.jpg",
    "platform": "Switch",
    "date": "May 1, 2020",
    "description": "What if the 1983 video game market crash never happened? Set in 20XX, Arcade Spirits is a visual novel romantic comedy with an alternative history, where arcades still reign supreme as the ultimate place to play. After a period of turbulent employment, your character starts an exciting new job at the Funplex: a popular local arcade with a team of staff that are as eccentric as the customers. But where will this new-found employment opportunity take you? Who will you meet along the way? And will you finally find the romance you’ve been seeking?",
    "score": "74"
  },
  {
    "id": "c395fa0f-6898-464c-a522-8d5d20fb9134",
    "title": "Darksiders Genesis",
    "rankNumber": "90.",
    "img": "https://static.metacritic.com/images/products/games/6/aefae684811ba0fa467f9fa2e4b1c5ec-98.jpg",
    "platform": "Switch",
    "date": "February 14, 2020",
    "description": "From the dawn of creation, the council has maintained the Balance across existence. Carrying out their orders are the Horsemen, Nephilim (powerful beings spawned from the unnatural union of angels and demons) who have pledged themselves to the Council and been granted immense power.\n\nHowever, this power came at a tragic cost: the Horsemen were ordered to use their newfound strength to wipe out the rest of their kind. What followed was a bloody battle on Eden where the Horsemen, obeying the will of the Council, annihilated the Nephilim.\n\nDarksiders: Genesis is an action/adventure that tears its way through hordes of demons, angels, and everything in-between on its way to Hell and back with guns blazing and swords swinging. Genesis gives players their first look at the world of Darksiders before the events of the original game, as well as introduces the horseman Strife.",
    "score": "74"
  },
  {
    "id": "5e300ac1-b3d8-45c4-84a4-8a4b7b659c07",
    "title": "Alder's Blood",
    "rankNumber": "91.",
    "img": "https://static.metacritic.com/images/products/games/7/ed5e98db357ebf89bfba96cf620fe3b2-98.jpg",
    "platform": "Switch",
    "date": "March 13, 2020",
    "description": "Alder's Blood is a stealth, tactical turn-based game set in a grim world, where nature stood against humanity and repelled the civilization. Use a wide variety of weapons, stay in shadows and prepare deadly traps to survive in combat.",
    "score": "74"
  },
  {
    "id": "b9deea62-48de-4938-b31d-467190ef5006",
    "title": "Trials of Mana",
    "rankNumber": "92.",
    "img": "https://static.metacritic.com/images/products/games/9/0e5333d86504cd74c172f85222aff95f-98.jpg",
    "platform": "Switch",
    "date": "April 24, 2020",
    "description": "When the world was shrouded in darkness, the Goddess of Mana drew forth the Sword of Mana to smite the eight Benevodons, monsters of destruction. She sealed the horrors inside the eight Mana Stones, bringing the realm back from the brink. Weakened from rebuilding the world, the Goddess changed herself into a tree and fell into a deep sleep for many years. However, the forces of evil soon sought to free the Benevodons to gain control of the world. They started a terrible war to further their plot and destabilize the kingdoms. Peace was at an end. Mana itself began to disappear from the world and the Mana Tree started to wither...",
    "score": "74"
  },
  {
    "id": "15f4eba2-493c-4831-b309-fb0dfd39150a",
    "title": "void tRrLM(); //Void Terrarium",
    "rankNumber": "93.",
    "img": "https://static.metacritic.com/images/products/games/4/9dd33f40da31fd3de1a74f3a5a991029-98.jpg",
    "platform": "Switch",
    "date": "July 14, 2020",
    "description": "In a world contaminated with toxic fungi, a discarded maintenance robot finds a girl named Toriko on the brink of death among the discarded junk in a scrapyard. To reinforce the terrarium as well as Toriko’s poor health, the lone robot must venture into the wasteland to gather resources while battling the vagrant machines and mutated creatures that roam there. From the creator of A Rose in the Twilight and htoL#NiQ: The Firefly Diary, this harrowing roguelike adventure combines cute visuals with a somber yet whimsical post-apocalyptic story. Install various equipment, skills, Knacks, and parts you find on your expeditions to improve your ability to explore the wasteland and fight enemies, while preventing threats to Toriko’s health. Choose your loadout wisely as you fight through procedurally generated levels in turn-based combat. No two adventures are alike when braving the toxic wastes.",
    "score": "74"
  },
  {
    "id": "6531299c-80fd-4e8d-a858-d3960cd62563",
    "title": "Project Warlock",
    "rankNumber": "94.",
    "img": "https://static.metacritic.com/images/products/games/1/25bde156f0183f3d49b9c4ea273d02b2-98.jpg",
    "platform": "Switch",
    "date": "June 11, 2020",
    "description": "One man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hours of super fun carnage. Let’s rock and roll!",
    "score": "74"
  },
  {
    "id": "3f0c70f5-9322-41e2-a564-033c8dd6be52",
    "title": "One Step From Eden",
    "rankNumber": "95.",
    "img": "https://static.metacritic.com/images/products/games/4/87b55f8bd7e7a528bf273ba2aeeb5c54-98.jpg",
    "platform": "Switch",
    "date": "March 26, 2020",
    "description": "Build a powerful deck, cast spells on the fly, battle evolving enemies, find game-changing artifacts, make friends or make enemies, just make it to Eden.",
    "score": "74"
  },
  {
    "id": "906d90ae-a162-499f-9b11-30aa031be962",
    "title": "Coffee Talk",
    "rankNumber": "96.",
    "img": "https://static.metacritic.com/images/products/games/5/dfe5c41cc6201eb54be1a9d4721bfa74-98.jpg",
    "platform": "Switch",
    "date": "January 29, 2020",
    "description": "Coffee Talk is a coffee brewing and heart-to-heart talking simulator about listening to fantasy-inspired modern peoples’ problems, and helping them by serving up a warm drink or two.",
    "score": "74"
  },
  {
    "id": "e63c8387-d714-4d66-ad8c-96a95c2d92e4",
    "title": "Monster Prom: XXL",
    "rankNumber": "97.",
    "img": "https://static.metacritic.com/images/products/games/2/29d81f6de61cbe9e87a6803b35508c78-98.jpg",
    "platform": "Switch",
    "date": "May 21, 2020",
    "description": "Be Your Worst Self\n\nThere’s only 3 weeks left until prom and you haven’t got a date yet..and you’re a monster. But that’s okay ‘cause at your high-school everyone else is too! These are the stepping stones into the world of Monster Prom: XXL - the bundled up, content filled edition of Monster Prom, a one-to-four player competitive dating sim that will have you thinking: I never knew I was into that!\n\nContent Complete\nMonster Prom: XXL contains both the Second Term DLC, as well as all seasonal content released throughout the game’s lifespan. Check out brand new characters, new events, secret endings and countless other ways to explore the (after)life of a love-struck high school monster!\n\nCompetitive dating sim\nNothing makes the heart grow fonder than a little competition. Set your gaze on one of the sweethearts, but if you share your romantic tastes with your friends, be ready for some stiff competition.",
    "score": "74"
  },
  {
    "id": "08d19946-5fcd-484f-8385-ae29fa0f6ecb",
    "title": "HYPERCHARGE: Unboxed",
    "rankNumber": "98.",
    "img": "https://static.metacritic.com/images/products/games/7/f437957914729827cf08d09a2ddec097-98.jpg",
    "platform": "Switch",
    "date": "January 31, 2020",
    "description": "HYPERCHARGE Unboxed tells the story of Sgt. Max Ammo and his epic mission to defend the HYPER-CORE. Your task is to fulfill his mission and prevent the HYPER-CORE from being destroyed. If it’s destroyed, you can bid farewell to your human friends. They’ll forget about you. It’ll be like you never existed. Do not let that happen. Work together and win, for the future of toys everywhere.",
    "score": "74"
  },
  {
    "id": "85b983e8-fbcb-4648-8ad2-1d8ed67fb505",
    "title": "Afterparty",
    "rankNumber": "99.",
    "img": "https://static.metacritic.com/images/products/games/4/b921e4b6c74b8953f11fadbedf16a555-98.jpg",
    "platform": "Switch",
    "date": "March 6, 2020",
    "description": "In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you. Time to go on the best bender ever, uncover the mystery of why you’ve been damned, and drink the big guy under the table. [Night School]",
    "score": "74"
  },
  {
    "id": "92d749d6-db5c-478e-857d-204ea4638e70",
    "title": "Yes, Your Grace",
    "rankNumber": "100.",
    "img": "https://static.metacritic.com/images/products/games/4/ffdc7d57421b14cae2da27032c34240d-98.jpg",
    "platform": "Switch",
    "date": "June 26, 2020",
    "description": "These are troubling times, Your Grace. The petitioners’ petty matters exceed our limited resources, to say nothing of the war. A careful balance must be struck. Your throne awaits.\n\nIn this kingdom management RPG, petitioners will arrive in the throne room each turn to ask for your advice and assistance. Decide whether to help them with their problems, or to conserve resources for more important matters. Remember: supplies are limited, and not everyone has the kingdom’s best interests at heart...",
    "score": "74"
  }
]