[
  {
    "id": "47714241-3f5b-429f-91b2-1682f4765f04",
    "title": "Persona 5 Royal",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/2/1d340c792338fa16de96bd8b60d3cab5-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 31, 2020",
    "description": "Prepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. Persona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.",
    "score": "95"
  },
  {
    "id": "99d14f68-eb72-46b3-b461-c6ece907c921",
    "title": "The Last of Us Part II",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/3/976dc172a149f212d4b059e6eede1900-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 19, 2020",
    "description": "Five years after their dangerous journey across the post-pandemic United States, Ellie and Joel have settled down in Jackson, Wyoming. Living amongst a thriving community of survivors has allowed them peace and stability, despite the constant threat of the infected and other, more desperate survivors. When a violent event disrupts that peace, Ellie embarks on a relentless journey to carry out justice and find closure. As she hunts those responsible one by one, she is confronted with the devastating physical and emotional repercussions of her actions.",
    "score": "93"
  },
  {
    "id": "7494b81d-6edf-42d3-81e8-6178f91e34fc",
    "title": "Half-Life: Alyx",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/4/559d5752e81e5bd977817d9de26bfe4b-98.jpg",
    "platform": "PC",
    "date": "March 23, 2020",
    "description": "Half-Life: Alyx is Valve's VR return to the Half-Life series. It's the story of an impossible fight against a vicious alien race known as the Combine, set between the events of Half-Life and Half-Life 2. Playing as Alyx Vance, you are humanity's only chance for survival. The Combine's control of the planet since the Black Mesa incident has only strengthened as they corral the remaining population in cities. Among them are some of Earth's greatest scientists: you and your father, Dr. Eli Vance. As founders of a fledgling resistance, you've continued your clandestine scientific activityperforming critical research, and building invaluable tools for the few humans brave enough to defy the Combine. Every day, you learn more about your enemy, and every day you work toward finding a weakness.\n\nABOUT GAMEPLAY IN VR:\n\nValve's return to the Half-Life universe that started it all was built from the ground up for virtual reality. VR was built to enable the gameplay that sits at the heart of Half-Life.\n\nImmerse yourself in deep environmental interactions, puzzle solving, world exploration, and visceral combat.\n\nLean to aim around a broken wall and under a Barnacle to make an impossible shot. Rummage through shelves to find a healing syringe and some shotgun shells. Manipulate tools to hack alien interfaces. Toss a bottle through a window to distract an enemy. Rip a Headcrab off your face and throw it at a Combine soldier.\n\nExtra content for Index owners\nCustomers who have purchased Valve Index hardware by the end of 2019 will have access to unique bonuses starting early next year:\n\n* Explore environments from Half-Life: Alyx in your SteamVR Home space\n* Alternate gun skins to embellish Alyx's arsenal\n* Special Half-Life: Alyx-themed content for Counter-Strike: Global Offensive and Dota 2\n\nCommunity-built environments\n\n* A set of Source 2 tools for building new environments will ship with the game, enabling any player to build and contribute new environments for the community to enjoy. Hammer, Valve's level authoring tool, has been updated with all of the game's virtual reality gameplay tools and components.",
    "score": "93"
  },
  {
    "id": "cca94276-d1ac-4561-b921-d157265e4d46",
    "title": "Microsoft Flight Simulator",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/8/f41c89f11e6eadc4b934fcd6504a0800-98.jpg",
    "platform": "PC",
    "date": "August 18, 2020",
    "description": "From light planes to wide-body jets, fly highly detailed and accurate aircraft in the next generation of Microsoft Flight Simulator. Test your piloting skills against the challenges of night flying, real-time atmospheric simulation and live weather in a dynamic and living world.",
    "score": "92"
  },
  {
    "id": "fd64637a-e88f-45e9-a416-ccac2da0b07c",
    "title": "Crusader Kings III",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/0/bf1475c161c6857e0c52670b80486e4c-98.jpg",
    "platform": "PC",
    "date": "September 1, 2020",
    "description": "Paradox Development Studio brings you the sequel to one of the most popular strategy games ever made. Crusader Kings III is the heir to a long legacy of historical grand strategy experiences and arrives with a host of new ways to ensure the success of your royal house.",
    "score": "91"
  },
  {
    "id": "4897777a-0c03-4df7-a616-194bce29767b",
    "title": "F1 2020",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/1/c623b8eafe8fe931793e7f004b663b86-98.jpg",
    "platform": "Xbox One",
    "date": "July 10, 2020",
    "description": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.",
    "score": "91"
  },
  {
    "id": "e24a633c-1ff2-4068-b32f-81672f48b95a",
    "title": "Animal Crossing: New Horizons",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/5/3a9359329fd2b8b0022bc57246aca1c8-98.jpg",
    "platform": "Switch",
    "date": "March 20, 2020",
    "description": "If the hustle and bustle of modern life’s got you down, Tom Nook has a new business venture up his sleeve that he knows you’ll adore: the Nook Inc. Deserted Island Getaway Package. Sure, you’ve crossed paths with colorful characters near and far. Had a grand time as one of the city folk. May’ve even turned over a new leaf and dedicated yourself to public service. But deep down, isn’t there a part of you that longs for…freedom? Then perhaps a long walk on the beach of a deserted island, where a rich wealth of untouched nature awaits, is just what the doctor ordered. Peaceful creativity and charm await as you roll up your sleeves and make your new life whatever you want it to be. Collect resources and craft everything from creature comforts to handy tools. Embrace your green thumb as you interact with flowers and trees in new ways. Set up a homestead where the rules of what goes indoors and out no longer apply. Make friends with new arrivals, enjoy the seasons, pole-vault across rivers as you explore, and more.",
    "score": "90"
  },
  {
    "id": "fa038f53-4a01-4110-aff2-52b5590031ba",
    "title": "Ori and the Will of the Wisps",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/9/219ace008faa25de2f1fa5c37a0d6486-98.jpg",
    "platform": "Xbox One",
    "date": "March 11, 2020",
    "description": "The little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and the Blind Forest comes the highly anticipated sequel. Embark on an all-new adventure in a vast world filled with new friends and foes that come to life in stunning, hand-painted artwork. Set to a fully orchestrated original score, Ori and the Will of the Wisps continues the Moon Studios tradition of tightly crafted platforming action and deeply emotional storytelling.",
    "score": "90"
  },
  {
    "id": "09b07538-fe9e-475a-9a9d-64d3710f0081",
    "title": "Yakuza 0",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/6/1b26b8df9dcfdf60c6f51c4f8216404d-98.jpg",
    "platform": "Xbox One",
    "date": "February 26, 2020",
    "description": "Tokyo 1988. Getting rich is easy, the women are beautiful, and everyone wants in on the action. It's time to become Yakuza.\n\nThe glitz, glamour, and unbridled decadence of the 80s are back in Yakuza 0!\n \nFight like hell through Tokyo and Osaka with protagonist Kazuma Kiryu and series regular Goro Majima. Play as Kazuma Kiryu and discover how he finds himself in a world of trouble when a simple debt collection goes wrong and his mark winds up murdered. Then, step into the silver-toed shoes of Goro Majima and explore his \"normal\" life as the proprietor of a cabaret club.\n\nSwitch between three different fighting styles instantaneously and beat up all manner of goons, thugs, hoodlums, and lowlifes. Take combat up a notch by using environmental objects such as bicycles, sign posts, and car doors for bone-crunching combos and savage take-downs.\n\nFighting is not the only way to kill time in 1988's Japan: from discos and hostess clubs to classic SEGA arcades, there are tons of distractions to pursue in the richly detailed, neon-lit world.\n\nInteract with the colourful denizens the red light district: help a budding S&M dominatrix learn her profession, or ensure a street performer can make it to the bathroom in time there are 100 incredible stories to discover.",
    "score": "90"
  },
  {
    "id": "bce45020-ae5f-4a77-8e67-5c128862a311",
    "title": "Xenoblade Chronicles: Definitive Edition",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/4/d44b7f8ad0f84de2d0694370170661a8-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2020",
    "description": "Join the fight between man and machine in the definitive edition of this critically-acclaimed RPG. Discover the origins of Shulk as he and his companions clash against a seemingly-unstoppable mechanical menace. Wield a future-seeing blade, chain together attacks, and carefully position your party members in strategic, real-time combat as you journey across a massive world. During an attack from the mechanical invaders known as the Mechon, Shulk discovers that he can tap into the full power of a mysterious blade known as the Monado. With the mighty Monado in hand, Shulk sets out to defeat the Mechon once and for all. In addition to the Mechon, you’ll run into wildlife that ranges from docile to deadly. Keep an eye on what attracts monsters’ attention to avoid unwanted conflict…or try your hand at bringing down an ultra-powerful Unique Monster. Upgrade your party as you progress through the adventure by selecting equipment, enhancing weapon skills, and using benefit-granting gems. Put your dependable companions to work by filling the party gauge to trigger a Chain Attack and attack enemies in quick succession.",
    "score": "89"
  },
  {
    "id": "dc658406-3f24-4fb9-8438-246a0f606c83",
    "title": "Pistol Whip",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/0/4bfabdfe73117cf5d4a10e5702190156-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 30, 2020",
    "description": "Pistol Whip is an unstoppable action-rhythm FPS. Journey through a cinematic bullet hell powered by a breakneck soundtrack to become the ultimate action hero legend.",
    "score": "89"
  },
  {
    "id": "7381ea12-e5b9-46ff-9c50-7c93b2975bb9",
    "title": "Dreams",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/7/414587fc71d02964cacd4d79c89e9226-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 14, 2020",
    "description": "Dreams is the space you go to where you go to play and experience the dreams of Media Molecule and its community. It’s also a space in which to create your own dreams, whether they’re games, art, films, music or anything in-between and beyond. [Media Molecule]",
    "score": "89"
  },
  {
    "id": "9ca287e4-812c-4e17-9fda-237812d078cc",
    "title": "Tony Hawk's Pro Skater 1 + 2",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/0/64dd7ba47face08621c57c84726bc0e2-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 4, 2020",
    "description": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.",
    "score": "88"
  },
  {
    "id": "cefc6c02-9c7f-4372-8720-b955de0af1c4",
    "title": "Ori and the Will of the Wisps",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/2/fb071eb430c986bc8f42f07da0a7339e-98.jpg",
    "platform": "PC",
    "date": "March 11, 2020",
    "description": "The little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and the Blind Forest comes the highly anticipated sequel. Embark on an all-new adventure in a vast world filled with new friends and foes that come to life in stunning, hand-painted artwork. Set to a fully orchestrated original score, Ori and the Will of the Wisps continues the Moon Studios tradition of tightly crafted platforming action and deeply emotional storytelling.",
    "score": "88"
  },
  {
    "id": "bddac079-b850-4cb9-b85c-066d181d1721",
    "title": "DOOM Eternal",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/5/e2edd6022f418bf951ba01b19458eb65-98.jpg",
    "platform": "Xbox One",
    "date": "March 19, 2020",
    "description": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]",
    "score": "88"
  },
  {
    "id": "d801ab1f-2686-4dbd-9515-c93ee600376b",
    "title": "F1 2020",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/6/59d09549297ae575f9672f5b3f478f00-98.jpg",
    "platform": "PC",
    "date": "July 9, 2020",
    "description": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.",
    "score": "88"
  },
  {
    "id": "fdf2f5b9-90d5-41f1-a7df-f89529ac69cf",
    "title": "Halo: The Master Chief Collection - Halo 3",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/3/ff3651444ad8e1758d365dad8ed306d3-98.jpg",
    "platform": "PC",
    "date": "July 14, 2020",
    "description": "Halo 3 is the third game in the Halo Trilogy and provides the thrilling conclusion to the events begun in \"Halo: Combat Evolved.\" Halo 3 will pick up where \"Halo 2\" left off. The Master Chief is returning to Earth to finish the fight. The Covenant occupation of Earth has uncovered a massive and ancient object beneath the African sands - an object who's secrets have yet to be revealed. Earth's forces are battered and beaten. The Master Chief's AI companion Cortana is still trapped in the clutches of the Gravemind - a horrifying Flood intelligence, and a civil war is raging in the heart of the Covenant. This is how the world ends...",
    "score": "88"
  },
  {
    "id": "0c6a9061-f81d-4a5d-9366-16ccb8195d98",
    "title": "DOOM Eternal",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/7/69971550f3485629bc00981fd50465ca-98.jpg",
    "platform": "PC",
    "date": "March 20, 2020",
    "description": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]",
    "score": "88"
  },
  {
    "id": "effb37d4-0b00-40bf-bbfb-a818b893e1b1",
    "title": "Spiritfarer",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/6/708b1e0546ef7bee71d14fd61c115656-98.jpg",
    "platform": "Switch",
    "date": "August 18, 2020",
    "description": "A cozy management game about dying. \n\nWhat will you leave behind?\nPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \n\nA unique, endlessly varied adventure!\nFarm, mine, fish, harvest, cook, and craft your way across mystical seas. Unwind for hours into cozy and relaxing gameplay. Join the adventure as Daffodil the cat, in two-player cooperative play.\n\nLearn how to say goodbye.\nExperience moving, emotional stories filled with unforgettable moments. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?",
    "score": "88"
  },
  {
    "id": "5ce39c80-0a80-4ac4-8e49-fbe52ae1ca9f",
    "title": "A Short Hike",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/9/2bce32debd624728e4ac46e1e6c75ff7-98.jpg",
    "platform": "Switch",
    "date": "August 18, 2020",
    "description": "Follow the marked trails or explore the backcountry as you make your way to the summit. Along the way, meet other hikers, discover hidden treasures, and take in the world around you. Explore the island any way you like. Choose your own path to follow and see where it leads you. You never know what you might stumble into!\n    Hike at your own pace - there's no need to rush to the summit! Take your time fishing along the river banks or swimming by the lakeshore.\n    Collect hidden treasures to reach new heights. Try taking a dive off the mountain peaks to soar above the forests.\n    Chat with the other hikers you meet along your route. You might be able to help each other out!\n    Listen to a lush original soundtrack by Mark Sparling that progresses dynamically as you explore the wilderness.",
    "score": "88"
  },
  {
    "id": "0c1a4dcd-14ad-4022-8431-3d5fd2d30194",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/9/1914df655227da69db0eca3865737861-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 28, 2020",
    "description": "KENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.",
    "score": "88"
  },
  {
    "id": "6907af5d-1eca-4dc2-9d48-602d7e71b7e6",
    "title": "Monster Hunter: World - Iceborne",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/2/ea4380a9dcf9d5d6b2c185c575bf0adc-98.jpg",
    "platform": "PC",
    "date": "January 9, 2020",
    "description": "Monster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivals the gameplay volume from the original release and features a new icy setting, storyline, monsters, gameplay options, and more.\n\nThe game's all-new story picks up after Monster Hunter: World and whisks hunters away to the newly discovered chilly locale that, once fully explored, becomes the largest region in World so far. The new locale is home to several new and returning monsters ready to challenge hunters throughout their expeditions and raises the stakes with the added higher difficulty Master Rank. Iceborne continues the skill-based progression and robust crafting system found in World and expands that with several new gameplay features that broaden the player's combat repertoire. All this leads to the ultimate hunter test against the mysterious new flagship monster, Velkhana.",
    "score": "87"
  },
  {
    "id": "ecb030bc-1b27-40fa-87b0-376f5dc7bed7",
    "title": "Final Fantasy VII Remake",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/5/40531eb3a9013197e4bf63dbfb866719-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 10, 2020",
    "description": "Long ago, we looked upon a foreboding sky. The memory of the star that threatened all burns eternal in our hearts. In its wake came an age of silence. Yet with each fond remembrance, we knew those encountered were not forgotten, that some day we would see them again. Perhaps it was no more than wishful thinking. But after the long calm, there are the beginnings of a stir. The reunion at hand may bring joy, it may bring fear, but let us embrace whatever it brings. For they are coming back. At last the promise has been made.",
    "score": "87"
  },
  {
    "id": "020a3ced-1aae-4d4d-818a-4cd197cf084e",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/6/c9fbfb8b99c42e59a92c44c0ff2d82e0-98.jpg",
    "platform": "Switch",
    "date": "January 28, 2020",
    "description": "Kentucky Route Zero is a magical realist adventure game about a secret highway in the caves beneath Kentucky. An antique furniture delivery man trying to make his small shop's last delivery gets lost along the way and meets a haunted TV repairwoman, a young boy and his giant eagle brother, a pair of robot musicians, and dozens of other characters. Together, they explore the nocturnal highways and country roads of Kentucky, the storied Echo River by ferry, and the mysterious Route Zero, the secret highway that runs through Mammoth Cave.",
    "score": "87"
  },
  {
    "id": "85a6d03f-d571-4f25-ad2e-59ba5cee7a5d",
    "title": "Death Stranding",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/5/f7c26bdfac0a09e02863c0d3a9e34df7-98.jpg",
    "platform": "PC",
    "date": "July 14, 2020",
    "description": "Besieged by death's tide at every turn. Sam Bridges must brave a world utterly transformed by the Death Stranding. Carrying the stranded remnants of the future in his hands, Sam embarks on a journey to reunite the shattered world one step at a time. What is the mystery of the Death Stranding? What will Sam discover on the road ahead? A genre defining gameplay experience holds these answers and more.",
    "score": "87"
  },
  {
    "id": "32948cf8-f56d-4cb8-a2b5-bec06313f378",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/8/6af7ce78618dba784269787232b74e1c-98.jpg",
    "platform": "Xbox One",
    "date": "January 28, 2020",
    "description": "KENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.",
    "score": "87"
  },
  {
    "id": "3d7944d2-b75d-415c-bfc3-019371a39f6a",
    "title": "DOOM Eternal",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/6/3a99440dc8efd4b087dc5c2f08a97ee0-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 20, 2020",
    "description": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]",
    "score": "87"
  },
  {
    "id": "430ea041-84cf-44cf-90e6-6b65e0f95725",
    "title": "Super Mega Baseball 3",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/2/f72fb2c81962daefabcdcfd2c6fe9102-98.jpg",
    "platform": "Switch",
    "date": "May 13, 2020",
    "description": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. Super Mega Baseball 3 features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits.",
    "score": "87"
  },
  {
    "id": "13912851-bfb8-43f8-b31c-d463790a71cf",
    "title": "Huntdown",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/8/83ffaa5681c54e95e7bdd9fcb2bad430-98.jpg",
    "platform": "Xbox One",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "87"
  },
  {
    "id": "0b11d25f-c2f4-4c7e-839f-c1e5c644145e",
    "title": "Legends of Runeterra",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/4/835a0ce6263f44bd8f12f23c661c64b0-98.jpg",
    "platform": "PC",
    "date": "April 29, 2020",
    "description": "Face off in dynamic, alternating combat full of opportunities to adapt and outplay. Make your move, but be ready to react, because your opponent has a plan of their own. It all comes down to this—can you outwit them and win?",
    "score": "87"
  },
  {
    "id": "1bbf867b-045f-4614-8d31-092defc1a91f",
    "title": "Tony Hawk's Pro Skater 1 + 2",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/1/eaaf3c57ebb0d6806ffa77379578738d-98.jpg",
    "platform": "Xbox One",
    "date": "September 4, 2020",
    "description": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.",
    "score": "87"
  },
  {
    "id": "de0037f1-6774-407d-8228-2e1abe54f022",
    "title": "Persona 4 Golden",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/4/5ceddf3a476d417f4e2aac5e7aa1b4da-98.jpg",
    "platform": "PC",
    "date": "June 13, 2020",
    "description": "Inaba—a quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden. A coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one’s self. Persona 4 Golden promises meaningful bonds and experiences shared together with friends. With an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.",
    "score": "87"
  },
  {
    "id": "b4d8a339-f915-4be2-9b02-a6e52386ef7c",
    "title": "Tony Hawk's Pro Skater 1 + 2",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/2/95320ec34e27307699d952ddcb2f0ea1-98.jpg",
    "platform": "PC",
    "date": "September 4, 2020",
    "description": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.",
    "score": "87"
  },
  {
    "id": "9139a2af-a539-4fcb-a9ac-78a765aeb35d",
    "title": "F1 2020",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/0/a6b5c97bd1982a9bf6de744278b973fe-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 6, 2020",
    "description": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.",
    "score": "86"
  },
  {
    "id": "e578bb82-81f9-4a0b-9dac-f07d550c5c06",
    "title": "Huntdown",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/9/9800846ccbb7d92c64a6840b5432e938-98.jpg",
    "platform": "Switch",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "86"
  },
  {
    "id": "426fcf5f-d82a-4c10-9eae-ee7ae838d1e0",
    "title": "Streets of Rage 4",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/4/a35a4da391146e66621f989f7ec02074-98.jpg",
    "platform": "Switch",
    "date": "April 30, 2020",
    "description": "Amongst the best beat’em up series ever created, jammin’ ‘90s beats and over the top street beating, the iconic series Streets of Rage comes back with a masterful tribute to and revitalization of the classic action fans adore.\n\nThe all-time classic Streets of Rage, known as Bare Knuckle (ベア・ナックル Bea Nakkuru) in Japan, is a beat ‘em up series known for this timeless gameplay and electronic dance influenced music. Streets of Rage 4 builds upon the classic trilogy’s gameplay with new mechanics, beautiful hand-drawn visuals and a God tier soundtrack.\n\nTeam up with iconic and brand-new characters\n\nStreets of Rage 4 got its iconic characters back: Axel, Blaze, and Adam teaming up with new brother and sister in arms Floyd Iraia and Cherry Hunter. With some brand-new moves and kickass tracks to take a listen, our heroes are ready to dish out beatdowns to a fledgling group of ill-advised criminals in full force.",
    "score": "86"
  },
  {
    "id": "de02f707-d550-422c-8382-c53ac1e27208",
    "title": "Panzer Corps 2",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/0/1988ef6fcd10c3f0d1b806625f3a288e-98.jpg",
    "platform": "PC",
    "date": "March 19, 2020",
    "description": "Panzer Corps 2 is the ultimate Second World War strategy game! Enjoy the time-proven gameplay formula which has been appreciated by millions of players over the years, brought to a whole new level of refinement up to the latest technical standards.",
    "score": "86"
  },
  {
    "id": "4be4d085-2fe0-4f69-b108-b88e1b96850c",
    "title": "Cuphead",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/7/dc89cde24094307bd112ef06f4feb6cd-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 28, 2020",
    "description": "Cuphead is a classic run and gun action game heavily focused on boss battles. Inspired by cartoons of the 1930s, the visuals and audio are painstakingly created with the same techniques of the era, i.e. traditional hand drawn cel animation, watercolor backgrounds, and original jazz recordings.\nPlay as Cuphead or Mugman (in single player or local co-op) as you traverse strange worlds, acquire new weapons, learn powerful super moves, and discover hidden secrets while you try and pay your debt back to the devil!",
    "score": "86"
  },
  {
    "id": "ab615bd0-8f8b-4e5f-b7f1-b96dd3dab252",
    "title": "Spiritfarer",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/5/4bbba54d5255a3a87d7bdfc7f269c56a-98.jpg",
    "platform": "PC",
    "date": "August 18, 2020",
    "description": "A cozy management game about dying.  What will you leave behind?\nPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \n\nA unique, endlessly varied adventure!\nFarm, mine, fish, harvest, cook, and craft your way across mystical seas. Unwind for hours into cozy and relaxing gameplay. Join the adventure as Daffodil the cat, in two-player cooperative play.\n\nLearn how to say goodbye.\nExperience moving, emotional stories filled with unforgettable moments. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?",
    "score": "86"
  },
  {
    "id": "031cffa8-1315-43cc-9dbf-831409d84137",
    "title": "Desperados III",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/2/0bae8084d91279c1af753ce3b914717c-98.jpg",
    "platform": "PC",
    "date": "June 16, 2020",
    "description": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.\n\nYou take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.\n\nCombine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.",
    "score": "86"
  },
  {
    "id": "9913b62d-76be-4713-92ed-4c318e5fc625",
    "title": "Wasteland 3",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/4/9c0a717da60a61d575adca6eed1803b0-98.jpg",
    "platform": "PC",
    "date": "August 28, 2020",
    "description": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies.",
    "score": "86"
  },
  {
    "id": "faf8c370-7dcb-4af6-a1ae-0e9bc3296ad1",
    "title": "Huntdown",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/0/34a90a6774e6587849e61f1b6ea6a3b9-98.jpg",
    "platform": "PC",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "86"
  },
  {
    "id": "6b43a98c-b104-40ed-a0af-3d7c3def9486",
    "title": "Wasteland 3",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/6/6004f2faa52881dbc4a97820e271d6a2-98.jpg",
    "platform": "Xbox One",
    "date": "August 28, 2020",
    "description": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies.",
    "score": "85"
  },
  {
    "id": "4816d5ad-e308-4935-85da-09e5df37536f",
    "title": "Risk of Rain 2",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/8/21881a02c21e07ae01ed0db045e2c0d8-98.jpg",
    "platform": "PC",
    "date": "August 11, 2020",
    "description": "The classic multiplayer roguelike, Risk of Rain, returns with an extra dimension and more challenging action. Play solo, or team up with up to three friends to fight your way through hordes of monsters, unlock new loot, and find a way to escape the planet.",
    "score": "85"
  },
  {
    "id": "07bfccc2-ca0c-463f-9043-b6ebff44d339",
    "title": "Bug Fables: The Everlasting Sapling",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/0/e70478ab294a54673276ad113a64d73e-98.jpg",
    "platform": "Switch",
    "date": "May 28, 2020",
    "description": "Bug Fables is an adventure RPG following three heroes, Vi, Kabbu, and Leif, as they embark on an epic quest in Bugaria in search of treasure and immortality! The game combines colorful platforming with the heroes' unique abilities as they explore a wide variety of areas in the kingdom. Battles are turn-based and make use of action commands that can enhance attacks.",
    "score": "85"
  },
  {
    "id": "5060182e-02b7-49fd-ba16-cc38e20782c6",
    "title": "Monster Train",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/3/33a531bc057f7d6073bdf7bd4b39c908-98.jpg",
    "platform": "PC",
    "date": "May 21, 2020",
    "description": "Monster Train is a strategic roguelike deck building game with a twist. Set on a train to hell, you’ll use tactical decision making to defend multiple vertical battlegrounds. With real time competitive multiplayer and endless replayability, Monster Train is always on time.",
    "score": "85"
  },
  {
    "id": "cad68132-5243-4647-a35a-839201fd215c",
    "title": "Deep Rock Galactic",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/9/2ab67a04814817434fc8d88f979c2719-98.jpg",
    "platform": "PC",
    "date": "May 13, 2020",
    "description": "Deep Rock Galactic is a 1-4 player co-op FPS featuring badass space Dwarves, 100% destructible environments, procedurally-generated caves, and endless hordes of alien monsters.",
    "score": "85"
  },
  {
    "id": "f0e9405e-5927-4d9d-a5e3-4282ac80ec20",
    "title": "Nioh 2",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/2/3f95eb44da34bdb9c97e2e0a9a1ec0dc-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 13, 2020",
    "description": "Master the lethal arts of the samurai as a mysterious half-human, half-supernatural Yokai warrior, in this challenging action RPG sequel. Explore violent Sengoku-era Japan and the deadly Dark Realm, both plagued with grotesque, merciless demons. Unsheathe your deadly weapons and cut down all enemies in your path using a revamped combat system and the ability to transform into a full Yokai to unleash devastating paranormal powers.",
    "score": "85"
  },
  {
    "id": "0b51140b-32ec-4ce4-abcc-bce097720c40",
    "title": "Bayonetta & Vanquish",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/1/9432b6ed3605c28f48249dfa587af984-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 18, 2020",
    "description": "Celebrate the 10th Anniversary of two PlatinumGames cult classics with the Bayonetta & Vanquish 10th Anniversary Bundle. Bayonetta: Experience the genesis of the Bayonetta series with the cult classic, original action-adventure game. Vanquish: The hit sci-fi shooter returns. An overpopulated Earth suffocating under limited resources looks to Providence, the solar-powered space colony for support.",
    "score": "85"
  },
  {
    "id": "62470637-18c6-4e0d-9e1f-7fcd976d5162",
    "title": "Two Point Hospital",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/1/1b296ff702f24597029bdb0984d96def-98.jpg",
    "platform": "Switch",
    "date": "February 25, 2020",
    "description": "Build up a hospital from nothing to a masterpiece as you design the most beautiful - or functional - healthcare operation in the whole of Two Point County. Optimize your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact specifications. Expand your hospital to multiple buildings as you look to get as many patients through the door as possible. Place decorative and functional items around your hospital to improve its prestige, lower patient boredom, increase happiness and keep those end of year awards flowing in.",
    "score": "85"
  },
  {
    "id": "5a045965-2d0b-49fa-bb43-2e0a5d1661b3",
    "title": "Lonely Mountains: Downhill",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/4/c05abefb028295d3540cfeb9e6d2fb10-98.jpg",
    "platform": "Switch",
    "date": "May 7, 2020",
    "description": "Just you and your bike — take it on a thrilling ride down an unspoiled mountain landscape. Make your way through thick forests, narrow trails and wild rivers. Race, jump, slide and try not to crash — all the way from the peak to the valley.",
    "score": "85"
  },
  {
    "id": "9a3690a4-4c01-42d8-8560-d125c5f00d6f",
    "title": "Desperados III",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/1/4922a8be01dfa37bc4e6a59b43c3ca6d-98.jpg",
    "platform": "Xbox One",
    "date": "June 16, 2020",
    "description": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.\n\nYou take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.\n\nCombine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.",
    "score": "85"
  },
  {
    "id": "af166fcc-a986-4890-b47c-1f9b3cac3fc7",
    "title": "Thronebreaker: The Witcher Tales",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/0/b3950d40a50edd2a639879ad334139f3-98.jpg",
    "platform": "Switch",
    "date": "January 28, 2020",
    "description": "Thronebreaker is a single player role-playing game set in the world of The Witcher that combines narrative-driven exploration with unique puzzles and card battle mechanics.\n\nCrafted by the developers responsible for some of the most iconic moments in The Witcher 3: Wild Hunt, the game spins a truly regal tale of Meve, a war-veteran and queen of two Northern Realms Lyria and Rivia. Facing an imminent Nilfgaardian invasion, Meve is forced to once again enter the warpath and set out on a dark journey of destruction and revenge.\n\nKEY FEATURES\n\nAN ALL NEW EPIC TALE\n* Experience an all-new 30-hour Witcher world tale with 20 possible world end-states.\n* Embark on a grand adventure full of thought-provoking quests.\n* Influence the state of the world around you by making difficult choices and face their consequences.\n* Meet a cast of rich, multidimensional characters some of them will join you on your quest, others you'll have to face on the battlefield.\n\nTRAVEL TO NEVER-BEFORE-SEEN KINGDOMS\n* Explore new and mysterious regions of the monster-infested world of The Witcher.\n* Traverse vast lands and unique locations, all with their distinct theme from vibrant countrysides and war-torn landscapes, to grand castles and snow-capped mountains.\n* Save villages from hordes of monsters, look for treasures hidden among ancient ruins, scour the land for resources, and more the world of Thronebreaker is teeming with things to do.\n\nPREPARE FOR WAR\n* Develop and customize your very own battle camp.\n* Train and recruit units, unlock new skills and work on your tactics.\n* Manage resources you find and trade them with local merchants.\n* Learn more about your companions and increase their strength in battle.\n\nLEAD YOUR ARMY IN EPIC BATTLES\n* Build an army from characters you meet and interact with during your journey.\n* Fight in epic story battles and solve unique puzzles and challenges.\n* Use unique skills and abilities of your army and lead it to victory.",
    "score": "84"
  },
  {
    "id": "806528a1-311d-4a8c-a77a-eaa046c1bd40",
    "title": "If Found...",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/1/6f2336c176a97ff57fbf4b65d4dae295-98.jpg",
    "platform": "PC",
    "date": "May 19, 2020",
    "description": "If Found... is an interactive visual novel about going home, coming out and erasing everything.",
    "score": "84"
  },
  {
    "id": "fa02d459-8bcc-4461-9f97-da36e6692997",
    "title": "WHAT THE GOLF?",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/8/07bba4965651a717a5de48856783df24-98.jpg",
    "platform": "Switch",
    "date": "May 21, 2020",
    "description": "The golf game for people who hate golf!\n\nA silly physics-based golf parody where every golf course is a new surprising type of golf, some brilliant or hilarious, others so absurd they will make you go: WHAT THE GOLF?\n\nGolf a house, a horse or car!\n\nFeatures:\n- More surprising new golf mechanics than you can imagine\n- Epic golf boss fights\n- Made by people who know nothing about golf\n- First (and hopefully the last) game that let you golf a horse\n- Will NOT make you a better golf player\n- Surprises!",
    "score": "84"
  },
  {
    "id": "63932b73-e23a-4ee0-9409-8aa71c678f53",
    "title": "Horizon Zero Dawn: Complete Edition",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/8/5410c3d455b9c0341ef7a3023f0e29e4-98.jpg",
    "platform": "PC",
    "date": "August 7, 2020",
    "description": "Experience Aloy’s legendary quest to unravel the mysteries of a future Earth ruled by Machines. An outcast from her tribe, the young hunter fights to uncover her past, discover her destiny… and stop a catastrophic threat to the future. Use devastating tactical attacks against your prey and explore a majestic open world in this action RPG.",
    "score": "84"
  },
  {
    "id": "cb2afcac-199d-46bf-9999-e204ab929ea3",
    "title": "Streets of Rage 4",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/0/a37807579dbc6e3f4d3b759a57ca4577-98.jpg",
    "platform": "PC",
    "date": "April 30, 2020",
    "description": "Publisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves and bandanas. \n\nStreets of Rage, known as Bare Knuckle (Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\n\nFamously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\n\nFeaturing hand-drawn visuals from the team behind 2017's gorgeous Wonder Boy: The Dragon's Trap remake, Streets of Rage 4 builds upon the classic trilogy's gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\n\nWhether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping. \n\nFeatures:\n\n* The comeback of the legendary Streets of Rage series.\n* Beautiful graphics fully hand-drawn animated by the studio behind Wonder Boy: The Dragon's Trap.\n* Classic gameplay enhanced with brand new mechanics.\n* Soundtrack by a wide line-up of world-class musicians.\n* Braised chicken served on a pristine plate.",
    "score": "84"
  },
  {
    "id": "0dd5bb91-7397-404e-bbe8-63740e4e90a0",
    "title": "BioShock: The Collection",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/6/7a00ff92f538b4f28ef195fbe3db52e1-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2020",
    "description": "Return to the cities of Rapture and Columbia and experience the award-winning BioShock franchise like never before, beautifully remastered in 1080p. BioShock: The Collection contains all single-player content from BioShock, BioShock 2, and BioShock Infinite, all single-player add-on content, the Columbias Finest pack, and Directors Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson.\n\nBioShock is a shooter unlike any you've ever played, loaded with weapons and tactics never seen. You'll have a complete arsenal at your disposal from simple revolvers to grenade launchers and chemical throwers, but you'll also be forced to genetically modify your DNA to create an even more deadly weapon: you. \n*Museum of Orphaned Concepts\n*Challenge Rooms\n\nBioShock 2\nSet approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. Players step into the boots of the most iconic denizen of Rapture, the Big Daddy, as they travel through the decrepit and beautiful fallen city, chasing an unseen foe in search of answers and their own survival.\n*Minervas Den\n*Protector Trials\n\nBioShock Infinite\nBring us the girl, wipe away the debt. The year is 1912. Deep in debt, Booker DeWitt has only one opportunity for a clean slate: rescue Elizabeth, a mysterious girl imprisoned since childhood in the flying city of Columbia. \n*Clash in the Clouds\n*Burial at Sea 1&2\n*Columbias Finest Pack\n\nFeatures\n\n*Remastered in 1080p.\n*BioShock main game and all single player DLC.\n*BioShock 2 main game and all single player DLC.\n*BioShock Infinite main game and all single player DLC.\n*Directors Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson",
    "score": "84"
  },
  {
    "id": "79a0f365-e5c7-47c9-b7d5-885b003e2ebc",
    "title": "Two Point Hospital",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/0/3427287f82fef1ed3a1dc49666010675-98.jpg",
    "platform": "Xbox One",
    "date": "February 25, 2020",
    "description": "BUILD, CURE and IMPROVE! Design stunning hospitals, decorate them as you like, cure very unusual illnesses and manage troublesome staff as you spread your budding healthcare organization across Two Point County. Design and build your own hospital.",
    "score": "84"
  },
  {
    "id": "4fa62c54-f83a-42d4-a4af-5c2a140f7a7d",
    "title": "Lair of the Clockwork God",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/5/17ab89cfb05dcf9589380be3eac3a52e-98.jpg",
    "platform": "PC",
    "date": "February 21, 2020",
    "description": "A fast-paced Point-and-Click adventure AND an indie platfomer in one! Join adventurer Ben and wannabe indie darling Dan in a race against time to stop all the Apocalypses happening at the same time.",
    "score": "84"
  },
  {
    "id": "27901b86-a21c-4ea3-a6bf-713b63367c22",
    "title": "Sega Ages: Fantasy Zone",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/0/697650ded5005f55fac19dd0175ed99c-98.jpg",
    "platform": "Switch",
    "date": "January 23, 2020",
    "description": "Take command of the spaceship Opa-Opa and blast your way through various fantastical levels as you try to take out all the enemy bases in each stage. Once you've destroyed the bases, you'll have to beat the stage boss in order to move on to the next level. By using your guns and bombs wisely, you'll be able to take down your enemies and explore each of the crazy environments in this side-scroller. You can also buy upgraded weapons for your ship by accessing the shop.",
    "score": "84"
  },
  {
    "id": "e82add4f-245f-480a-be94-e39d49493d23",
    "title": "To the Moon",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/8/650195023288a1c8f6f617ffeabe514f-98.jpg",
    "platform": "Switch",
    "date": "January 16, 2020",
    "description": "Dr. Rosalene and Dr. Watts have peculiar jobs: They give people another chance to live, all the way from the very beginning... but only in their patients' heads.\n\nDue to the severity of the operation, the new life becomes the last thing the patients remember before drawing their last breath. Thus, the operation is only done to people on their deathbeds, to fulfill what they wish they had done with their lives, but didnt.\n\nThis particular story follows their attempt to fulfill the dream of an elderly man, Johnny. With each step back in time, a new fragment of Johnny's past is revealed. As the two doctors piece together the puzzled events that spanned a life time, they seek to find out just why the frail old man chose his dying wish to be what it is.\n\nAnd Johnny's last wish is, of course... to go to the moon.\n\n\n* A unique story-driven experience\n* Innovative mix between adventure game elements and classic RPG aesthetics\n* Acclaimed original soundtrack that closely ties to the story\n* An espresso execution with zero filler and no time drains",
    "score": "84"
  },
  {
    "id": "27e3912b-f9bb-41d3-a923-814e2c8fd67a",
    "title": "Resident Evil 3",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/3/56defb66b1f5ec951c52970c8b44ac2a-98.jpg",
    "platform": "Xbox One",
    "date": "April 3, 2020",
    "description": "Fight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that the pharmaceutical company Umbrella and their biological weapon, the T-Virus, are behind the incidents though they've lost several members in the process. Jill Valentine and the other surviving S.T.A.R.S. members try to make this truth known, but find that the police department itself is under Umbrella's sway and their reports are rejected out of hand.\n\nHowever, soon reports of a grisly \"cannibal virus\" begin to surface, and vicious dogs begin roaming the streets. With the viral plague spreading through the town and to her very doorstep, Jill is determined to survive.\nHowever, unbeknownst to Jill, an extremely powerful pursuer has already been dispatched to eliminate her.",
    "score": "84"
  },
  {
    "id": "398a6680-132b-4bcf-bf5b-587ec4824872",
    "title": "The Legend of Heroes: Trails of Cold Steel III",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/4/f6ee6feaca5d24dccd7f67fd2b3faaf4-98.jpg",
    "platform": "Switch",
    "date": "June 30, 2020",
    "description": "The end of the civil war led to the turning point of a new era for the Erebonian Empire. Centering on Rean Schwarzer as the Ashen Chevalier, the young man who came to be seen as a hero within the country, a new story of young heroes will unfold.",
    "score": "84"
  },
  {
    "id": "fbc11675-61c5-4309-9641-8e93c7a57918",
    "title": "Bayonetta & Vanquish",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/2/0ff9aea4ff698bbc0560aaa1172f4922-98.jpg",
    "platform": "Xbox One",
    "date": "February 18, 2020",
    "description": "Celebrate the 10th Anniversary of two PlatinumGames cult classics with the Bayonetta & Vanquish 10th Anniversary Bundle. Bayonetta: Experience the genesis of the Bayonetta series with the cult classic, original action-adventure game. Vanquish: The hit sci-fi shooter returns. An overpopulated Earth suffocating under limited resources looks to Providence, the solar-powered space colony for support.",
    "score": "83"
  },
  {
    "id": "77bc85f3-1c64-4e99-b365-19c47f3855fb",
    "title": "Ghost of Tsushima",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/0/260ef84455c9c9e47a0cdd2df24622bb-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 17, 2020",
    "description": "The year is 1274. Samurai warriors are the legendary defenders of Japan -- until the fearsome Mongol Empire invades the island of Tsushima, wreaking havoc and conquering the local population. As one of the last surviving samurai, you rise from the ashes to fight back. But, honorable tactics won't lead you to victory. You must move beyond your samurai traditions to forge a new way of fighting -- the way of the Ghost -- as you wage an unconventional war for the freedom of Japan.",
    "score": "83"
  },
  {
    "id": "163cb1bc-fead-4f62-85b9-b7b04e375f4f",
    "title": "MLB The Show 20",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/8/e00f281a9f94c9df26aed81cf572e806-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 13, 2020",
    "description": "Run the table and rake in rewards with brand new mode “Showdown”. A new experience and updates throughout DD make Diamond Dynasty the best version yet.",
    "score": "83"
  },
  {
    "id": "dda475a9-c2bc-4d37-9559-91638d3894d4",
    "title": "Knights and Bikes",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/1/1dd8fab7067e49fe7d63cd5e49496e84-98.jpg",
    "platform": "Switch",
    "date": "February 6, 2020",
    "description": "Knights And Bikes is a hand-painted action-adventure for 1 or 2 players, set on a British island in the 1980s. It's a coming-of-age story starring Nessa & Demelza, exploring the coasts of Penfurzy on their trusty bikes, looking for a legendary lost treasure in a Goonies-inspired tale of excitement, danger, fun and friendship.\n\nThe two new friends, along with their pet-goose and the pickled-head of an undead knight, form the Penfurzy Rebel Bicycle Club, and are ready for anything this adventure throws at them. They pedal into danger to face threats head-on with frisbees, water-balloons, video game controllers and the powerful beats of an amplified boom-box.\n\nAlong the way they'll stuff their pockets with trinkets and barter for bike upgrades, spurring them onward down the island's country lanes, windswept beaches, deep forests, modern attractions and ancient ruins. Together their friendship will create an adventure as big as their imaginations.",
    "score": "83"
  },
  {
    "id": "568b470a-9ca5-4498-badb-5d8fb22dbc12",
    "title": "Mega Man Zero / ZX Legacy Collection",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/8/ccb756098c89c608d272a220b7b46090-98.jpg",
    "platform": "Switch",
    "date": "February 25, 2020",
    "description": "Mega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent. In addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual Scenario Mode and a Save-Assist feature are available for those who would like to enjoy the story at their own pace. Players can also try their hand at the new leaderboard-based Z Chaser Mode, an exclusive new mode created just for this set of games.",
    "score": "83"
  },
  {
    "id": "10c05c66-4250-4c06-9b31-38bb3f7d91df",
    "title": "Command & Conquer Remastered Collection",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/3/a228feb6fdfb5971088a8f11bd8eb4bb-98.jpg",
    "platform": "PC",
    "date": "June 5, 2020",
    "description": "Command & Conquer and Red Alert are both remastered in 4K by the former Westwood Studios team members. Includes all 3 expansions, rebuilt multiplayer, a modernized UI, Map Editor, bonus footage gallery, and over 7 hours of remastered music.",
    "score": "83"
  },
  {
    "id": "e1d13232-bf2c-4b00-96e7-bc524aed51d9",
    "title": "EA SPORTS UFC 4",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/2/4f3ca63ee258d03f216eae48000e6068-98.jpg",
    "platform": "Xbox One",
    "date": "August 14, 2020",
    "description": "In EA SPORTS UFC 4 the fighter you become is shaped by your fight style, your achievements, and your personality. Develop and customize your character through a unified progression system across all modes. Go from unknown amateur to UFC superstar in the new Career Mode, experience the origins of combat sports in two all-new environments; The Kumite and The Backyard, or challenge the world in new Blitz Battles or Online World Championships to become the undisputed champ. In gameplay, fluid clinch-to-strike combinations offer more responsive and authentic stand-up gameplay, while overhauled takedown and ground mechanics deliver more control in those key phases of the fight. No matter how, or where, you play EA SPORTS UFC 4 puts 'you' at the center of every fight.",
    "score": "83"
  },
  {
    "id": "524ac760-0643-47f6-b446-66ab0e2e3909",
    "title": "Super Mega Baseball 3",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/3/028cdfdd035ff24e83dade952a5ec4f8-98.jpg",
    "platform": "Xbox One",
    "date": "May 13, 2020",
    "description": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. The third entry in the series features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits.",
    "score": "83"
  },
  {
    "id": "7e9ce559-8977-4d62-92fe-9cccecd691c3",
    "title": "Sega Ages: Sonic the Hedgehog 2",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/4/e01dd90b9b86fda11824eb53a0c0dad8-98.jpg",
    "platform": "Switch",
    "date": "February 20, 2020",
    "description": "Super Speed! Sonic's back and better than ever. He's a blur in blue! A blaze of action! With his new Super Spin Dash. And a new, fabulous friend, \"Tails\" the Fox. You won't believe it 'til you see it. And when you play, you won't stop. Super Play! Defy gravity in hair-raising loop-de-loops. Grab Power Sneakers and race like lightning through the mazes. All at break-neck speed! Super Power! Sonic's attitude is can-do. The mad scientist Dr. Robotnik is planning a world takeover. Sonic gets tough in the fight to save his friends and squash Robotnik for good!",
    "score": "83"
  },
  {
    "id": "1491dfbd-9d0d-4b69-ab65-d785764372d4",
    "title": "One Step From Eden",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/2/dcb8bfaabf3ca67664135447f89c6e28-98.jpg",
    "platform": "PC",
    "date": "March 26, 2020",
    "description": "Build a powerful deck, cast spells on the fly, battle evolving enemies, find game-changing artifacts, make friends or make enemies, just make it to Eden.",
    "score": "83"
  },
  {
    "id": "0c7a414b-7a37-45a5-8d2a-dcad4d7c0d8d",
    "title": "Code:Realize - Guardian of Rebirth",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/8/05dd2832c284977212df6b30d7df4502-98.jpg",
    "platform": "Switch",
    "date": "February 6, 2020",
    "description": "This all happened many, many years ago.\nThe girl searched. Grass withered.\nThe girl searched even harder. Flowers were the next to die.\nEven so, the girl continued her search. Eventually, the whole land rotted.\nThe girl was a monster -- a lonely monster.\n\nThis all happened many, many years ago.\n\nThe poisonous girl who destroyed nature and man alike only sought one thing -- love.",
    "score": "83"
  },
  {
    "id": "a5f3793a-db71-491f-8161-a1d0cc3490e6",
    "title": "Freedom Finger",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/9/ccb1c4025b78abae18bbc765229f2ac6-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 24, 2020",
    "description": "Freedom Finger is a music driven, side-scrolling shooter that sends you blasting through 40 levels of crazy cartoon action. Whether you want to chill and enjoy the story or crank the difficulty for a butt-blasting ridiculous challenge, we’ve got you covered.",
    "score": "82"
  },
  {
    "id": "18a3a5e2-8cbc-4ec8-b0c0-2096a8b9b734",
    "title": "Street Fighter V: Champion Edition",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/1/d97dd18e24eee0a86e4dae2645664ff2-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 14, 2020",
    "description": "Rule the ring with Street Fighter V: Champion Edition, the most robust version of the acclaimed fighting game! This new version includes all content (excluding Fighting Chance costumes, brand collaboration costumes and Capcom Pro Tour DLC) from both the original release and Street Fighter V: Arcade Edition. Champion Edition adds each character, stage and other content that released after Arcade Edition and with the release of this new version. In total: 40 characters, 34 stages, over 200 costumes all action-packed into one knockout edition! READY? FIGHT!\n\nAll game mode additions and balance updates are free for owners of any Street Fighter V version. Additionally, all DLC characters remain earnable completely free of charge through completing various in-game challenges and receiving earned in-game currency, called Fight Money. For those who can't wait, in-game content can be obtained instantly using real money. Certain additional content can only be acquired using Fight Money, which can be earned through normal gameplay.\n\nV-SKILLS I AND II\nThe addition of V-Skill II provides more options and depth to the combat system.\n\nONLINE MATCHES\nBattle against other players online in Casual and Ranked matches.\n\nEXTRA BATTLE CHALLENGES\nComplete optional, time-exclusive challenges for a chance to win rewards.\n\nCINEMATIC STORY\nFollow the cast through \"A Shadow Falls,\" a feature-length adventure that spans the globe.",
    "score": "82"
  },
  {
    "id": "ea600df9-7436-4cc7-bca7-fd5a17b518ea",
    "title": "Streets of Rage 4",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/4/96a7458cdb603f57aaecdbbaa7eecb44-98.jpg",
    "platform": "Xbox One",
    "date": "April 30, 2020",
    "description": "Publisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves and bandanas. \n\nStreets of Rage, known as Bare Knuckle (Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\n\nFamously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\n\nFeaturing hand-drawn visuals from the team behind 2017's gorgeous Wonder Boy: The Dragon's Trap remake, Streets of Rage 4 builds upon the classic trilogy's gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\n\nWhether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping. \n\nFeatures:\n\n* The comeback of the legendary Streets of Rage series.\n* Beautiful graphics fully hand-drawn animated by the studio behind Wonder Boy: The Dragon's Trap.\n* Classic gameplay enhanced with brand new mechanics.\n* Soundtrack by a wide line-up of world-class musicians.\n* Braised chicken served on a pristine plate.",
    "score": "82"
  },
  {
    "id": "8a8d2261-bd66-4d37-8ac9-28237388eba2",
    "title": "Huntdown",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/7/56249814b0d8099d382bdad34df75614-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "82"
  },
  {
    "id": "0369a8c9-1e4d-401a-9b4b-7cdb7e1d4c04",
    "title": "Yakuza 5 Remastered",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/6/aa31f852ecc7e7b154a595eef23fb6a2-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 11, 2020",
    "description": "The legendary dragon returns to the criminal underworld of Yakuza. Kazuma Kiryu, once known as the Dragon of Dojima, was living a quiet life as a taxi driver in Hakata after severing all his ties with the underworld.  However, at the dawn of the bloody war between the Tojo Clan and the Omi Alliance, Kazuma is forced to accept his inescapable fate and returns to a life filled with crime and violence to protect his loved ones.",
    "score": "82"
  },
  {
    "id": "b8480589-dbd4-4aa9-a3e9-ad04c74b6929",
    "title": "SUPERHOT: MIND CONTROL DELETE",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/6/37d856f080b73a9d69e8dffdc1982b54-98.jpg",
    "platform": "Xbox One",
    "date": "July 16, 2020",
    "description": "ONE OF US. ONE OF US. Still outnumbered, still outgunned. Enemies swirl around you in a storm of slow motion violence. Battle after battle, each fallen foe pushes you closer to the secrets hiding in the game and each secret gives you more powers to fight the System’s unending opposition.",
    "score": "82"
  },
  {
    "id": "e9e9a918-7f6a-4a31-ae6c-0ae1af09abea",
    "title": "Necrobarista",
    "rankNumber": "82.",
    "img": "https://static.metacritic.com/images/products/games/3/8e81e82d9aa1909018469897e086795f-98.jpg",
    "platform": "PC",
    "date": "July 22, 2020",
    "description": "In a back-alley cafe, the dead are granted one last night to mingle with the living. Necrobarista follows a dynamic and diverse cast of characters as they navigate Melbourne's hipstery coffee culture, the questionable ethics of necromancy, and the process of letting go.",
    "score": "82"
  },
  {
    "id": "63ef98bf-3c9c-4bad-966d-8d5c9131f364",
    "title": "Ruiner",
    "rankNumber": "83.",
    "img": "https://static.metacritic.com/images/products/games/1/c4c399142ae9ff690bd80a180e5060de-98.jpg",
    "platform": "Switch",
    "date": "June 18, 2020",
    "description": "In the year 2091 pervasive advancements in technology and computerization haven't changed human nature. Playing with people's lives has never been more fun.",
    "score": "82"
  },
  {
    "id": "a582236f-4196-4e91-a137-6ec238890e89",
    "title": "Under Night In-Birth Exe:Late[cl-r]",
    "rankNumber": "84.",
    "img": "https://static.metacritic.com/images/products/games/2/9b8ae8e28d5215d358337310b6ed2809-98.jpg",
    "platform": "Switch",
    "date": "February 20, 2020",
    "description": "Cold friends & New under night In-Birth exe: late[cl-r] introduces a brand new character-icyy Fighter londrekia and his frosty new set of moves. Balancing act the new game features new moves and balance adjustments to every character-totalingg roughly 1, 000 improvements.\nShow your true colors each character will receive five new Color schemes (for a total of 40 new Color schemes), so players can customize their fighters to suit their every Mood.",
    "score": "82"
  },
  {
    "id": "d297f59c-f899-49c9-ac89-abe99b98570e",
    "title": "CrossCode",
    "rankNumber": "85.",
    "img": "https://static.metacritic.com/images/products/games/6/dca175d4309b3ca06c1147b44bb70cd1-98.jpg",
    "platform": "Switch",
    "date": "July 9, 2020",
    "description": "This retro-inspired 2D Action RPG might outright surprise you. CrossCode combines 16-bit SNES-style graphics with butter-smooth physics, a fast-paced combat system, and engaging puzzle mechanics, served with a gripping sci-fi story.\n\nCrossCode is all about how it plays! Take the best out of two popular genres, find a good balance between them and make a great game. That’s what CrossCode does. You get the puzzles of Zelda-esque dungeons and are rewarded with the great variety of equipment you know and love from RPGs. During the fast-paced battles you will use the tools you find on your journey to reveal and exploit the enemies' weaknesses and at the same time will be able to choose equipment and skills for a more in-depth approach in fighting your enemies.",
    "score": "82"
  },
  {
    "id": "9a48e299-5787-4f91-9319-78583db3ea40",
    "title": "The Sims 4: Eco Lifestyle",
    "rankNumber": "86.",
    "img": "https://static.metacritic.com/images/products/games/3/18b139925a740f950965b1fb7981ce8d-98.jpg",
    "platform": "PC",
    "date": "June 5, 2020",
    "description": "Ready for your Sims to impact their world? Move into a community of fellow collaborative makers in The Sims 4 Eco Lifestyle Expansion Pack!* Play to change and make a difference in the new world of Evergreen Harbor. Help your new neighbors decide on a Community Space Project, reduce your eco footprint, and watch your neighborhood transform. You’ll be surprised by what happens when your Sims start making the rules. [EA]",
    "score": "82"
  },
  {
    "id": "c131fd4c-5558-4090-a2ca-709ab61d29fe",
    "title": "Desperados III",
    "rankNumber": "87.",
    "img": "https://static.metacritic.com/images/products/games/0/6dc10463e956606431c16c7574302f6b-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 16, 2020",
    "description": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.\n\nYou take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.\n\nCombine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.",
    "score": "82"
  },
  {
    "id": "2c140402-e6da-414c-98c9-f44b7b5f1e3d",
    "title": "Borderlands Legendary Collection",
    "rankNumber": "88.",
    "img": "https://static.metacritic.com/images/products/games/8/9f61bad844829d8315230966f94df1a2-98.jpg",
    "platform": "Switch",
    "date": "May 29, 2020",
    "description": "Get three times the mayhem, three times the loot, and three times the action with the Borderlands Legendary Collection! Kill bandits and beasts, collect powerful weaponry, and maybe even save the universe in Borderlands: Game of the Year Edition, Borderlands 2, and Borderlands: The Pre-Sequel, along with piles of bonus add-on content for each game, adding 100+ hours of gameplay at an incredible value.\n\n* Enjoy all three games solo or cooperatively with local two-player split-screen or four-player online play\n\n* Borderlands: Game of the Year Edition - Discover the co-op shooter-looter that started it all, crammed with content and enhancements! Equip bazillions of guns as one of four trigger-happy mercenaries, each with unique RPG skills. Take on the lawless desolate planet Pandora in pursuit of powerful alien technology rumored to be inside an ancient Vault.\n\n* Borderlands 2 - Play as one of six vault hunters attempting to liberate Pandora from evil mastermind and corporate CEO Handsome Jack. Make new friends, arm them with a bazillion weapons and fight alongside them in a relentless quest for revenge and redemption.\n\n* Borderlands: The Pre-Sequel - Discover the story behind Borderlands 2 villain, Handsome Jack, and his rise to power. Set between the events of Borderlands and Borderlands 2, The Pre-Sequel gives you a whole lotta new gameplay and features the genre-blending fusion of shooter and RPG mechanics that players have come to love. \n\nThe Borderlands Legendary Collection versions of Borderlands: Game of the Year Edition, Borderlands 2, and Borderlands: The Pre-Sequel come complete with loads of extra content, including the following major add-ons:\n\nBorderlands: Game of the Year Edition\n- The Zombie Island of Dr. Ned\n- Mad Moxxi's Underdome Riot\n- The Secret Armory of General Knoxx\n- Claptrap's New Robot Revolution\n\nBorderlands 2\n- Captain Scarlett and Her Pirate's Booty\n- Mr. Torgue's Campaign of Carnage\n- Sir Hammerlock's Big Game Hunt\n- Tiny Tina's Assault on Dragon Keep\n- Mechromancer Pack (play as Gaige)\n- Psycho Pack (play as Krieg)\n\nBorderlands: The Pre-Sequel\n- Claptastic Voyage\n- The Holodome Onslaught\n- Baroness Pack (play as Aurelia)\n- Handsome Jack Doppelganger Pack (play as \"Jack\")",
    "score": "82"
  },
  {
    "id": "86c84e32-5ad4-431a-975c-943db30df245",
    "title": "Devil May Cry 3: Special Edition",
    "rankNumber": "89.",
    "img": "https://static.metacritic.com/images/products/games/4/9a29f6103cca84b92fedaf3f3557cf65-98.jpg",
    "platform": "Switch",
    "date": "February 20, 2020",
    "description": "Set before the original Devil May Cry, Devil May Cry 3: Special Edition follows Dante's journey as he battles his evil twin brother in a final confrontation. Along the way, you'll encounter both formidable foes and unusual characters. When attacking, you can choose to use short-range, long-range, defensive, or evasive play styles. Each system has its own set of gameplay features, and you can choose to power up your favorite style for increased special attack abilities. The Special Edition adds the ability to play as Dante's nemesis Virgil and a survival game mode.",
    "score": "82"
  },
  {
    "id": "47e0df04-b0d6-44bc-944b-1747e9c3f854",
    "title": "Streets of Rage 4",
    "rankNumber": "90.",
    "img": "https://static.metacritic.com/images/products/games/2/5e875925f219e061aabd3b81dff0bc92-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 30, 2020",
    "description": "Publisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves and bandanas. \n\nStreets of Rage, known as Bare Knuckle (Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\n\nFamously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\n\nFeaturing hand-drawn visuals from the team behind 2017's gorgeous Wonder Boy: The Dragon's Trap remake, Streets of Rage 4 builds upon the classic trilogy's gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\n\nWhether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping. \n\nFeatures:\n\n* The comeback of the legendary Streets of Rage series.\n* Beautiful graphics fully hand-drawn animated by the studio behind Wonder Boy: The Dragon's Trap.\n* Classic gameplay enhanced with brand new mechanics.\n* Soundtrack by a wide line-up of world-class musicians.\n* Braised chicken served on a pristine plate.",
    "score": "82"
  },
  {
    "id": "8fc700fc-b09f-4a22-a2be-ace4ae3042c5",
    "title": "Two Point Hospital",
    "rankNumber": "91.",
    "img": "https://static.metacritic.com/images/products/games/9/e26e5772e630c03bef0dae20dcd43311-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 25, 2020",
    "description": "Build up a hospital from nothing to a masterpiece as you design the most beautiful - or functional - healthcare operation in the whole of Two Point County. Optimize your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact…",
    "score": "82"
  },
  {
    "id": "c3901bcc-b43e-4ea0-9d08-580ae0ab945a",
    "title": "Clubhouse Games: 51 Worldwide Classics",
    "rankNumber": "92.",
    "img": "https://static.metacritic.com/images/products/games/5/e15b342486b29baa4d553150b86f399f-98.jpg",
    "platform": "Switch",
    "date": "June 5, 2020",
    "description": "Play and discover 51 board games, tabletop games, and more all in one package -- Clubhouse Games: 51 Worldwide Classics. This diverse collection includes games from all over the world across multiple genres, from familiar favorites like Chess to international hits like Mancala that have been around for 100s of years!\n\nEnjoy familiar favorites and learn hidden gems from around the world in this collection of 51 board games, tabletop games and more! Whether you like to sit and strategize or rely on reflexes, Clubhouse Games: 51 Worldwide Classics contains games from across an array of genres for you to play and discover. Each game is presented with stunning detail as dice clack and marbles glimmer.\n\nStrategic players will feel right at home with games like Four-in-a-row and Renegade, while those who prefer to use their reflexes can enjoy games like Slot Cars and Toy Boxing!\n\nWith board games, card games, sports, solitaires and more, Clubhouse Games: 51 Worldwide Classics is an eclectic collection of games to play and discover on your Nintendo Switch.",
    "score": "82"
  },
  {
    "id": "e57d718c-db4e-4ccd-a880-03617475d4f9",
    "title": "MotoGP 20",
    "rankNumber": "93.",
    "img": "https://static.metacritic.com/images/products/games/6/56bb315d12195fc9ed352e5171165429-98.jpg",
    "platform": "Xbox One",
    "date": "April 23, 2020",
    "description": "Take control of your own career, switch from real teams to new teams created with sponsors from the world of MotoGP™, decide the development of the bike and manage your technical unit to win. Improved physics, with even more realistic and complex braking management. The tire has been divided into independent sectors for wear and temperature, and the fuel consumption can be managed with driving style and power maps. If you were looking for a challenge, this is definitely the one for you. Being a successful driver is much more than just keeping the throttle wide open. You also need to win with style! Unleash your creativity with 6 different graphic editors, including the new Suit and Livery editor for your bike. [Milestone]",
    "score": "82"
  },
  {
    "id": "b499fd1a-f6ea-4967-bf7d-49dd00c9eb53",
    "title": "Tom Clancy's The Division 2: Warlords of New York",
    "rankNumber": "94.",
    "img": "https://static.metacritic.com/images/products/games/8/7dbe518a41ad6f6cd1677148cbff905c-98.jpg",
    "platform": "Xbox One",
    "date": "March 3, 2020",
    "description": "While The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and used them to conquer Lower Manhattan. With other rogue Agents and a lethal new viral strain at his command, Keener is poised to eradicate what little has been rebuilt since the catastrophic Black Friday pandemic. The battle to restore order continues, but now The Division has a new mission: Stop Keener at any cost.",
    "score": "82"
  },
  {
    "id": "a26b2f81-9f1f-409a-aa27-4976cea295b8",
    "title": "Pixel Ripped 1995",
    "rankNumber": "95.",
    "img": "https://static.metacritic.com/images/products/games/6/3e552bb7c9a009278e8c7f2218ffe66f-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 12, 2020",
    "description": "Pixel Ripped is back with a brand new nostalgia-fueled virtual reality game-within-a-game, this time in the year 1995! To restore balance to multiple dimensions, our videogame hero Dot recruits the help of the best gamer from 1995, an unassuming 9-year-old boy named David. Join this unlikely duo through challenging throwbacks to all your favorite classics from the late 16-bit and early 32-bit era of games inside a virtual reality world.",
    "score": "82"
  },
  {
    "id": "edf59fbb-2ee8-486b-aa2b-945f24e93fca",
    "title": "Tokyo Mirage Sessions #FE Encore",
    "rankNumber": "96.",
    "img": "https://static.metacritic.com/images/products/games/4/38832341328bc9b0046973fa22b53ffd-98.jpg",
    "platform": "Switch",
    "date": "January 17, 2020",
    "description": "The worlds of the Fire Emblem series and Atlus games have crossed paths again and the result is coming to the Nintendo Switch system. An interdimensional evil has invaded modern-day Tokyo, resulting in this fantastical barrage of music, style, and yes, danger. So, fight back! Battle through dungeons to pump up your strategy and creatively decimate your foesbefore all hope fades to black. You and the rising stars you call friends will need to call on your own creative powermanifested as iconic Fire Emblem characters -- to wage a secret war on rogue spirits that feed on creativity. Each encounter will immerse you in deep, turn-based battles that blend the combat of the Fire Emblem and Shin Megami Tensei series into one brutal harmony. Fuse items to craft weaponry; then play to your strengths and crush your foes. Around every corner you'll find fun nods to multiple fandoms, including Fire Emblem references, dungeons themed to the entertainment industry, and stunning musical performances.",
    "score": "81"
  },
  {
    "id": "b3797e5d-cff1-49f3-8228-5e6eb8204975",
    "title": "SnowRunner",
    "rankNumber": "97.",
    "img": "https://static.metacritic.com/images/products/games/5/2d3ea2d18f02be8efb3149bcc281caa6-98.jpg",
    "platform": "PC",
    "date": "April 28, 2020",
    "description": "SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.\nOvercome mud, torrential waters, snow, and frozen lakes while taking on perilous contracts and missions. Expand and customize your fleet with many upgrades and accessories including an exhaust snorkel for heavy waters or chain tires to battle the snow.",
    "score": "81"
  },
  {
    "id": "7a3e6e08-a4e7-434d-83e4-facc4b592371",
    "title": "Remnant: From the Ashes - Swamps of Corsus",
    "rankNumber": "98.",
    "img": "https://static.metacritic.com/images/products/games/6/cffd60220eaa0fd0aebe401f9efdc57b-98.jpg",
    "platform": "PC",
    "date": "April 28, 2020",
    "description": "Remnant: From the Ashes – Swamps of Corsus requires ownership of Remnant: From the Ashes to play. Begin your journey across the dangerous and corrupted worlds of Remnant: From the Ashes with a new mode and expanded map content in the Swamps of Corsus DLC. New Mode - Survival. Fight for your life in this new rogue-like game mode! Start off your adventure with nothing but a pistol, some scrap and the skin on your back. Travel randomly through corrupted World Stones to different biomes, scrap-up gear, fight insanely-difficult bosses and test your endurance on how long you can resist The Root’s influence. The Iskal Rise. The swamps of Corsus swarm with new content! Discover a new zone in Adventure Mode, fight new bosses, experience new stories, participate in new events, find new quests, and more. Lock & Load. Pick up new items, new armor and skins, new weapons, new mods and new traits. Armor Skins. By defeating bosses in Survival Mode, or the Hard and Nightmare difficulties in Campaign and Adventure Mode, earn Glowing Shards which you can use to purchase alternate armor skins for every piece of armor available in the game.",
    "score": "81"
  },
  {
    "id": "a4d2e3e2-6d4b-474d-8718-78a0868b0eae",
    "title": "Jet Lancer",
    "rankNumber": "99.",
    "img": "https://static.metacritic.com/images/products/games/2/2c7eb07bd678a89be27ec0e89d73313b-98.jpg",
    "platform": "Switch",
    "date": "May 12, 2020",
    "description": "Jet Lancer is a high-velocity aerial combat shooter where you duel enemy aviators, hunt giant robots, and defy death at supersonic speeds. You are Ash Leguinn: badass pilot, highly paid mercenary, and flight-school drop out. Your day job is fine - the daily grind of dealing with Sky Pirates pays the bills - but nothing compares to the rush of demolishing a ninety-ton mechanical monstrosity at the speed of sound. And you’ll have your chance. As mechanized weapons converge on Root City, you’ll have to be at the top of your game to survive, and you’ll have to surpass your limits if you want to save the world.",
    "score": "81"
  },
  {
    "id": "9367974a-7733-4a93-a9e3-0101a026b960",
    "title": "Hunt: Showdown",
    "rankNumber": "100.",
    "img": "https://static.metacritic.com/images/products/games/5/d2b3a40884c248dab062f9af280c20ad-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 18, 2020",
    "description": "You and your partner are members of a secret hunting society that tracks and kills creatures. The bounties are high, but so are the risks. The smallest mistake will cost you everything—your bounty, your gear, your life, and your very soul. Some hunt for wealth, some for power. Some hunt to protect others, some hunt for glory. You must track your quarry through a dark and treacherous world. Winner takes all. Fail, and go straight to hell.",
    "score": "81"
  }
]