[
  {
    "id": "6e97dd29-9917-4754-8de7-546af26b1b01",
    "title": "Persona 5 Royal",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/2/1d340c792338fa16de96bd8b60d3cab5-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 31, 2020",
    "description": "Prepare for an all-new RPG experience in Persona 5 Royal based in the universe of the award-winning series, Persona! Don the mask of Joker and join the Phantom Thieves of Hearts. Break free from the chains of modern society and stage grand heists to infiltrate the minds of the corrupt and make them change their ways! Persona 5 Royal is packed with new characters, confidants, story depth, new locations to explore, and a new grappling hook mechanic for stealthy access to new areas. With a new semester at Shujin Academy, get ready to strengthen your abilities in the metaverse and in your daily life. Persona 5 Royal presents a unique visual style and award nominated composer Shoji Meguro returns with an all-new soundtrack. Explore Tokyo, unlock new Personas, customize your own personal Thieves Den, discover a never-before-seen story arc, cutscenes, alternate endings, and more! Even for the most seasoned Phantom Thieves among us, Persona 5 Royal is a new challenge to defy conventions, discover the power within, and fight for justice. Wear the mask. Reveal your truth.",
    "score": "95"
  },
  {
    "id": "2d634ac4-b44f-4e56-9492-4afe2f0bf3bb",
    "title": "The Last of Us Part II",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/3/976dc172a149f212d4b059e6eede1900-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 19, 2020",
    "description": "Five years after their dangerous journey across the post-pandemic United States, Ellie and Joel have settled down in Jackson, Wyoming. Living amongst a thriving community of survivors has allowed them peace and stability, despite the constant threat of the infected and other, more desperate survivors. When a violent event disrupts that peace, Ellie embarks on a relentless journey to carry out justice and find closure. As she hunts those responsible one by one, she is confronted with the devastating physical and emotional repercussions of her actions.",
    "score": "93"
  },
  {
    "id": "ac323620-e090-4688-bb8d-effe0d936faf",
    "title": "Pistol Whip",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/0/4bfabdfe73117cf5d4a10e5702190156-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 30, 2020",
    "description": "Pistol Whip is an unstoppable action-rhythm FPS. Journey through a cinematic bullet hell powered by a breakneck soundtrack to become the ultimate action hero legend.",
    "score": "89"
  },
  {
    "id": "bc404cc0-a7f3-426d-930e-1dd00a86d61d",
    "title": "Dreams",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/7/414587fc71d02964cacd4d79c89e9226-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 14, 2020",
    "description": "Dreams is the space you go to where you go to play and experience the dreams of Media Molecule and its community. It’s also a space in which to create your own dreams, whether they’re games, art, films, music or anything in-between and beyond. [Media Molecule]",
    "score": "89"
  },
  {
    "id": "efa83f23-9da4-4d6e-be22-1c1a7dd86319",
    "title": "Tony Hawk's Pro Skater 1 + 2",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/0/64dd7ba47face08621c57c84726bc0e2-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 4, 2020",
    "description": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.",
    "score": "88"
  },
  {
    "id": "e6ef09c9-fd95-4349-b625-5b26e56899c9",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/9/1914df655227da69db0eca3865737861-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 28, 2020",
    "description": "KENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.",
    "score": "88"
  },
  {
    "id": "49669427-6a05-4a80-9ddd-443c1e0698da",
    "title": "Final Fantasy VII Remake",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/5/40531eb3a9013197e4bf63dbfb866719-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 10, 2020",
    "description": "Long ago, we looked upon a foreboding sky. The memory of the star that threatened all burns eternal in our hearts. In its wake came an age of silence. Yet with each fond remembrance, we knew those encountered were not forgotten, that some day we would see them again. Perhaps it was no more than wishful thinking. But after the long calm, there are the beginnings of a stir. The reunion at hand may bring joy, it may bring fear, but let us embrace whatever it brings. For they are coming back. At last the promise has been made.",
    "score": "87"
  },
  {
    "id": "324838eb-58e2-4230-be83-3ccc2387f917",
    "title": "DOOM Eternal",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/6/3a99440dc8efd4b087dc5c2f08a97ee0-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 20, 2020",
    "description": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]",
    "score": "87"
  },
  {
    "id": "0ecdef99-3889-4279-b823-0c6a2edd94ba",
    "title": "F1 2020",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/0/a6b5c97bd1982a9bf6de744278b973fe-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 6, 2020",
    "description": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.",
    "score": "86"
  },
  {
    "id": "b994ab36-4a27-4890-a234-577cb2d7cf86",
    "title": "Cuphead",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/7/dc89cde24094307bd112ef06f4feb6cd-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 28, 2020",
    "description": "Cuphead is a classic run and gun action game heavily focused on boss battles. Inspired by cartoons of the 1930s, the visuals and audio are painstakingly created with the same techniques of the era, i.e. traditional hand drawn cel animation, watercolor backgrounds, and original jazz recordings.\nPlay as Cuphead or Mugman (in single player or local co-op) as you traverse strange worlds, acquire new weapons, learn powerful super moves, and discover hidden secrets while you try and pay your debt back to the devil!",
    "score": "86"
  },
  {
    "id": "6e84c2be-ec4f-4d10-a543-34e390b403e4",
    "title": "Nioh 2",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/2/3f95eb44da34bdb9c97e2e0a9a1ec0dc-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 13, 2020",
    "description": "Master the lethal arts of the samurai as a mysterious half-human, half-supernatural Yokai warrior, in this challenging action RPG sequel. Explore violent Sengoku-era Japan and the deadly Dark Realm, both plagued with grotesque, merciless demons. Unsheathe your deadly weapons and cut down all enemies in your path using a revamped combat system and the ability to transform into a full Yokai to unleash devastating paranormal powers.",
    "score": "85"
  },
  {
    "id": "02c33c16-7f50-41ee-94da-7a7ab98de9d4",
    "title": "Bayonetta & Vanquish",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/1/9432b6ed3605c28f48249dfa587af984-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 18, 2020",
    "description": "Celebrate the 10th Anniversary of two PlatinumGames cult classics with the Bayonetta & Vanquish 10th Anniversary Bundle. Bayonetta: Experience the genesis of the Bayonetta series with the cult classic, original action-adventure game. Vanquish: The hit sci-fi shooter returns. An overpopulated Earth suffocating under limited resources looks to Providence, the solar-powered space colony for support.",
    "score": "85"
  },
  {
    "id": "15d9cfb4-181b-40dd-8a6c-8785cd1a6f1d",
    "title": "Ghost of Tsushima",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/0/260ef84455c9c9e47a0cdd2df24622bb-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 17, 2020",
    "description": "The year is 1274. Samurai warriors are the legendary defenders of Japan -- until the fearsome Mongol Empire invades the island of Tsushima, wreaking havoc and conquering the local population. As one of the last surviving samurai, you rise from the ashes to fight back. But, honorable tactics won't lead you to victory. You must move beyond your samurai traditions to forge a new way of fighting -- the way of the Ghost -- as you wage an unconventional war for the freedom of Japan.",
    "score": "83"
  },
  {
    "id": "2ff74964-1f6e-4f94-b437-8cb375f6d0b9",
    "title": "MLB The Show 20",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/8/e00f281a9f94c9df26aed81cf572e806-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 13, 2020",
    "description": "Run the table and rake in rewards with brand new mode “Showdown”. A new experience and updates throughout DD make Diamond Dynasty the best version yet.",
    "score": "83"
  },
  {
    "id": "7aece087-0155-4a5e-9963-d694806ae065",
    "title": "Freedom Finger",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/9/ccb1c4025b78abae18bbc765229f2ac6-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 24, 2020",
    "description": "Freedom Finger is a music driven, side-scrolling shooter that sends you blasting through 40 levels of crazy cartoon action. Whether you want to chill and enjoy the story or crank the difficulty for a butt-blasting ridiculous challenge, we’ve got you covered.",
    "score": "82"
  },
  {
    "id": "cb34db26-759f-498b-b1db-7a0684a12459",
    "title": "Street Fighter V: Champion Edition",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/1/d97dd18e24eee0a86e4dae2645664ff2-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 14, 2020",
    "description": "Rule the ring with Street Fighter V: Champion Edition, the most robust version of the acclaimed fighting game! This new version includes all content (excluding Fighting Chance costumes, brand collaboration costumes and Capcom Pro Tour DLC) from both the original release and Street Fighter V: Arcade Edition. Champion Edition adds each character, stage and other content that released after Arcade Edition and with the release of this new version. In total: 40 characters, 34 stages, over 200 costumes all action-packed into one knockout edition! READY? FIGHT!\n\nAll game mode additions and balance updates are free for owners of any Street Fighter V version. Additionally, all DLC characters remain earnable completely free of charge through completing various in-game challenges and receiving earned in-game currency, called Fight Money. For those who can't wait, in-game content can be obtained instantly using real money. Certain additional content can only be acquired using Fight Money, which can be earned through normal gameplay.\n\nV-SKILLS I AND II\nThe addition of V-Skill II provides more options and depth to the combat system.\n\nONLINE MATCHES\nBattle against other players online in Casual and Ranked matches.\n\nEXTRA BATTLE CHALLENGES\nComplete optional, time-exclusive challenges for a chance to win rewards.\n\nCINEMATIC STORY\nFollow the cast through \"A Shadow Falls,\" a feature-length adventure that spans the globe.",
    "score": "82"
  },
  {
    "id": "cabafb80-bd4f-49ab-b777-aeb6ba793c8d",
    "title": "Huntdown",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/7/56249814b0d8099d382bdad34df75614-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "82"
  },
  {
    "id": "b5066755-8901-4443-8d7a-2bd8067f3add",
    "title": "Yakuza 5 Remastered",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/6/aa31f852ecc7e7b154a595eef23fb6a2-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 11, 2020",
    "description": "The legendary dragon returns to the criminal underworld of Yakuza. Kazuma Kiryu, once known as the Dragon of Dojima, was living a quiet life as a taxi driver in Hakata after severing all his ties with the underworld.  However, at the dawn of the bloody war between the Tojo Clan and the Omi Alliance, Kazuma is forced to accept his inescapable fate and returns to a life filled with crime and violence to protect his loved ones.",
    "score": "82"
  },
  {
    "id": "36476f12-26ff-45f3-a593-a77feb92a61a",
    "title": "Desperados III",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/0/6dc10463e956606431c16c7574302f6b-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 16, 2020",
    "description": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.\n\nYou take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.\n\nCombine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.",
    "score": "82"
  },
  {
    "id": "9b20f1d2-c958-429b-bdcd-7297d85a05d5",
    "title": "Streets of Rage 4",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/2/5e875925f219e061aabd3b81dff0bc92-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 30, 2020",
    "description": "Publisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves and bandanas. \n\nStreets of Rage, known as Bare Knuckle (Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\n\nFamously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\n\nFeaturing hand-drawn visuals from the team behind 2017's gorgeous Wonder Boy: The Dragon's Trap remake, Streets of Rage 4 builds upon the classic trilogy's gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\n\nWhether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping. \n\nFeatures:\n\n* The comeback of the legendary Streets of Rage series.\n* Beautiful graphics fully hand-drawn animated by the studio behind Wonder Boy: The Dragon's Trap.\n* Classic gameplay enhanced with brand new mechanics.\n* Soundtrack by a wide line-up of world-class musicians.\n* Braised chicken served on a pristine plate.",
    "score": "82"
  },
  {
    "id": "a0f5f45c-09a5-4f56-8fe5-319c4dee4a6e",
    "title": "Two Point Hospital",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/9/e26e5772e630c03bef0dae20dcd43311-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 25, 2020",
    "description": "Build up a hospital from nothing to a masterpiece as you design the most beautiful - or functional - healthcare operation in the whole of Two Point County. Optimize your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact…",
    "score": "82"
  },
  {
    "id": "bf0c073e-0672-4111-a4c4-630e6cb716e3",
    "title": "Pixel Ripped 1995",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/6/3e552bb7c9a009278e8c7f2218ffe66f-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 12, 2020",
    "description": "Pixel Ripped is back with a brand new nostalgia-fueled virtual reality game-within-a-game, this time in the year 1995! To restore balance to multiple dimensions, our videogame hero Dot recruits the help of the best gamer from 1995, an unassuming 9-year-old boy named David. Join this unlikely duo through challenging throwbacks to all your favorite classics from the late 16-bit and early 32-bit era of games inside a virtual reality world.",
    "score": "82"
  },
  {
    "id": "f910bae4-c35c-48e3-a0ef-8c53c3ef9fbc",
    "title": "Hunt: Showdown",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/5/d2b3a40884c248dab062f9af280c20ad-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 18, 2020",
    "description": "You and your partner are members of a secret hunting society that tracks and kills creatures. The bounties are high, but so are the risks. The smallest mistake will cost you everything—your bounty, your gear, your life, and your very soul. Some hunt for wealth, some for power. Some hunt to protect others, some hunt for glory. You must track your quarry through a dark and treacherous world. Winner takes all. Fail, and go straight to hell.",
    "score": "81"
  },
  {
    "id": "44548b17-9c3b-4e07-ac6f-010af0c928be",
    "title": "Bloodroots",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/4/b82cf003538a2c313d632e4f919842b1-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 28, 2020",
    "description": "In Bloodroots, the world is your weapon - improvise and adapt to an ever-changing ballet of ultraviolence, in a bloody revenge quest across the Weird West.",
    "score": "81"
  },
  {
    "id": "14dfae82-4292-4272-bd74-c09a2ae608ae",
    "title": "CrossCode",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/6/fa6e57cc074034e48f9a1c903cfc8a2a-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 9, 2020",
    "description": "A retro-inspired 2D Action RPG set in the distant future. A story about the distant future of gaming - from an unexpected angle. Plenty of characters and plot twists included. Master the bouncing ball mechanics and solve a whole bunch of puzzles. CrossCode has fast, action-packed combat filled with damage numbers. And we still managed to squeeze some strategy in there. Be a proper avatar and master all 4 elements: Cold, Heat, Shock and Wave. What, those are not the right elements? No idea what you are talking about. Being a proper RPG, CrossCode comes with tons of skills, equipment, items, NPCs, quests and all those fun little things consuming your precious time. CrossCode is full of awesome: huge hostile cyborg crabs, a seaman with a jetpack and head-banging meerkats.",
    "score": "81"
  },
  {
    "id": "0f062b0f-b953-4dcb-93a7-871e0f8b57b6",
    "title": "SnowRunner",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/3/44d88d643dbbfb5c237ddfc8d629a6a5-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 28, 2020",
    "description": "SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.\nOvercome mud, torrential waters, snow, and frozen lakes while taking on perilous contracts and missions. Expand and customize your fleet with many upgrades and accessories including an exhaust snorkel for heavy waters or chain tires to battle the snow.",
    "score": "81"
  },
  {
    "id": "525c3fff-282c-4d47-b807-e78725839fb9",
    "title": "Creature in the Well",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/7/3c25d03e72f50ea9fc1b291f84dec503-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 27, 2020",
    "description": "Creature in the Well is a top-down, pinball-inspired, hack-and-slash dungeon crawler. As the last remaining BOT-C unit, venture deep into a desert mountain to restore power to an ancient facility, haunted by a desperate Creature. Uncover and upgrade powerful gear in order to free the city of Mirage from a deadly sandstorm.",
    "score": "81"
  },
  {
    "id": "9485fc17-fbc4-4397-80c1-6df5197a87a1",
    "title": "Under Night In-Birth Exe:Late[cl-r]",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/3/54984d9a24481d6f36828acf8bcbb34c-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 20, 2020",
    "description": "Cold friends & New under night In-Birth exe: late[cl-r] introduces a brand new character-icyy Fighter londrekia and his frosty new set of moves. Balancing act the new game features new moves and balance adjustments to every character-totalingg roughly 1, 000 improvements.",
    "score": "80"
  },
  {
    "id": "0fa8b5da-82df-4663-ba6f-d15e7909f3e9",
    "title": "Neon Abyss",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/6/7e7b10d177d612e80204ebfe2a50f4c0-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 14, 2020",
    "description": "Neon Abyss is a frantic, roguelite action-platformer where you run ‘n’ gun your way into the Abyss. Featuring unlimited item synergies and a unique dungeon evolution system, each run diversifies the experience and every choice alters the ruleset.",
    "score": "80"
  },
  {
    "id": "33a89a17-0905-4f48-aed0-4fe00997dc72",
    "title": "Super Mega Baseball 3",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/0/1416f2881fab460f7becfd5fc49bb986-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 13, 2020",
    "description": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. The third entry in the series features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits.",
    "score": "80"
  },
  {
    "id": "42a99bed-a107-48ac-9185-6cea9a1a1501",
    "title": "Fall Guys: Ultimate Knockout",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/1/4bc93e01ecce1839952daa10a891a3f5-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 4, 2020",
    "description": "Fall Guys is a massively multiplayer party game with up to 60 players online in a free-for-all struggle through round after round of escalating chaos until one victor remains.",
    "score": "80"
  },
  {
    "id": "25b5f706-c1e0-470d-a0f6-308e32823084",
    "title": "Mega Man Zero / ZX Legacy Collection",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/7/13e0b1df17cb3f296e95ce734c97791d-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 25, 2020",
    "description": "Mega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent.\n\nIn addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual Scenario Mode and a Save-Assist feature are available for those who would like to enjoy the story at their own pace. Players can also try their hand at the new leaderboard-based Z Chaser Mode, an exclusive new mode created just for this set of games.",
    "score": "80"
  },
  {
    "id": "31bede91-31d7-4923-9260-cd70ea6b59db",
    "title": "Superliminal",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/7/92bb3e5ed147f71e099b9a931375477a-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 7, 2020",
    "description": "Perception is reality. In this mind-bending first-person puzzler, you explore a surreal dream world and solve impossible puzzles using the ambiguity of depth and perspective.",
    "score": "80"
  },
  {
    "id": "c35e1828-2440-4301-9627-c3ac05bfe216",
    "title": "Telling Lies",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/1/f9c595523ec84fe2ad0f1dcbf59427cb-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 28, 2020",
    "description": "An investigative thriller game with non-linear storytelling, Telling Lies revolves around a cache of secretly recorded video conversations. Starring Logan Marshall-Green, Alexandra Shipp, Kerry Bishé, Angela Sarafyan and directed by Sam Barlow, creator of Her Story and Silent Hill: Shattered Memories.",
    "score": "79"
  },
  {
    "id": "b360e13f-fc29-4a1e-a154-47c2ecdc91df",
    "title": "Atelier Dusk Trilogy Deluxe Pack",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/0/91fa3defdfd58e4ef8fbddf80361025d-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 14, 2020",
    "description": "The DX versions of the titles from the Dusk series are now available as a specially priced 3-game set! Atelier Ayesha: The Alchemist of Dusk DX, Atelier Escha & Logy: Alchemists of the Dusk Sky DX, Atelier Shallie: Alchemists of the Dusk Sea DX.",
    "score": "79"
  },
  {
    "id": "830135ea-2f5f-4787-a568-ebda78e97d4a",
    "title": "EarthNight",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/4/7271af59138cb5771ffacc6bd0026460-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 23, 2020",
    "description": "EarthNight is a hand-painted roguelike runner about the dragon apocalypse. Dragons have taken over the Earth and exiled the decimated human population to outer space. Our outraged heroes Stanley and Sydney decide to skydive to the planet’s surface, taking out as many dragons as they can on their way. In terms of gameplay, Stanley is a good pick for beginners given his simpler control scheme. Sydney is for experts, with a less intuitive — but ultimately more rewarding — control scheme.",
    "score": "79"
  },
  {
    "id": "d01ad024-d9ee-44d7-bcf3-62f8be4db4b7",
    "title": "WRC 9 FIA World Rally Championship",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/4/337cae12087533261bfcda1b9c544acd-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 4, 2020",
    "description": "The WRC license is back and even better this year with WRC 9. Take part in the Calendar's 3 new rallies and challenge the community with the customisable league system. Then dive into the skin of a co-driver with the astonishing co-op mode.",
    "score": "79"
  },
  {
    "id": "a0ef4e35-53e9-49f7-ae4b-ef405778e7ca",
    "title": "The Walking Dead: Saints & Sinners",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/0/86bf844eed32be5dfa9a76ea38e62f1d-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 5, 2020",
    "description": "Saints & Sinners is a game unlike any other in The Walking Dead universe. Every challenge you face and decision you make is driven by YOU. Fight the undead, scavenge through the flooded ruins of New Orleans, and face gut-wrenching choices for you and the other survivors. Live The Walking Dead.",
    "score": "79"
  },
  {
    "id": "6bfc5f93-50be-4101-b6a3-7ef105b642ff",
    "title": "Call of Duty: Warzone",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/3/44627355a88e8d1ac28b9c06bd0e345a-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 10, 2020",
    "description": "Welcome to Warzone – a new combat experience where up to 150 players take the role of a veteran Tier 1 Operator and drop in to the dense and sprawling world of Verdansk. Warzone is  packed with non-stop action that’s free-to-play and free-for-everyone. You do not need to own the full version of Call of Duty: Modern Warfare to download, play and enjoy Warzone. In Battle Royale, fight to be the last squad standing while escaping the deadly gas in the swiftly closing circle with up to 150 players. In Plunder, the race is on to collect the most in-match Cash by looting across the map, taking down enemies to steal their Cash, and completing in-match Contracts. Warzone takes place in Verdansk, an expansive city with multiple named zones and well over 300 points of interest. Each zone features distinct landmarks like the Gorengard Lumber Yard or the Gora Dam; the zones take place across different environment types like cities and rural areas for unique engagements. Change up your drop location in each match to get a better lay of the land and take advantage of what Verdansk has to offer. If you need to get somewhere fast in Warzone, the best method is a vehicle. There are five vehicles all with varying levels of protection, speed, seating, and off-roading capability. Each vehicle has a health meter and when it reaches zero, the vehicle explodes and flames out. Needlessly to say, if the health of your vehicle is depleting, bail out before the impending explosion. [Activision]",
    "score": "79"
  },
  {
    "id": "91fb64e8-1a3f-4773-8b45-42fe07742e10",
    "title": "Resident Evil 3",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/2/72764928de50fee04f05ac490153dc0e-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 3, 2020",
    "description": "Fight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that the pharmaceutical company Umbrella and their biological weapon, the T-Virus, are behind the incidents though they've lost several members in the process. Jill Valentine and the other surviving S.T.A.R.S. members try to make this truth known, but find that the police department itself is under Umbrella's sway and their reports are rejected out of hand.\n\nHowever, soon reports of a grisly \"cannibal virus\" begin to surface, and vicious dogs begin roaming the streets. With the viral plague spreading through the town and to her very doorstep, Jill is determined to survive.\nHowever, unbeknownst to Jill, an extremely powerful pursuer has already been dispatched to eliminate her.",
    "score": "79"
  },
  {
    "id": "7a904a0a-45f2-45ff-900b-0e874fd5f98a",
    "title": "Paper Beast",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/8/6afc44b9af83b980188fe44cc7b76a4e-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 24, 2020",
    "description": "Experience a dreamlike odyssey through a wild and simulated ecosystem. Take off on an adventure! Connect with exotic and surprising creatures. Shape the environment to solve puzzles. Or let your imagination guide you through an immersive sandbox.",
    "score": "79"
  },
  {
    "id": "5e6c5ebe-7a47-4804-a5b7-a23584c267a3",
    "title": "EA SPORTS UFC 4",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/1/2ad6480354cda9ae8e6cbdad226d66b7-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 14, 2020",
    "description": "In EA SPORTS UFC 4 the fighter you become is shaped by your fight style, your achievements, and your personality. Develop and customize your character through a unified progression system across all modes. Go from unknown amateur to UFC superstar in the new Career Mode, experience the origins of combat sports in two all-new environments; The Kumite and The Backyard, or challenge the world in new Blitz Battles or Online World Championships to become the undisputed champ. In gameplay, fluid clinch-to-strike combinations offer more responsive and authentic stand-up gameplay, while overhauled takedown and ground mechanics deliver more control in those key phases of the fight. No matter how, or where, you play EA SPORTS UFC 4 puts 'you' at the center of every fight.",
    "score": "79"
  },
  {
    "id": "83d2f037-0053-478f-b3b7-3e2062015770",
    "title": "Granblue Fantasy: Versus",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/0/105f4fe4e8b7091cf047a6cab4caf14b-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 3, 2020",
    "description": "In a world where adventurers roam the skies on airships, and the floating islands of the Skydoms lead their way, the Grandcypheran airship of massive proportionssets out on a magnificent journey, traveling the islands, and picking up a veritable army of sellswords, knights, and mages along the way However, these heroes of the sky will soon embark on a brand-new adventure, where battle and glory await!\n\nAn international mobile game hit, Granblue Fantasy has topped the charts, charming players across the globe with a plethora of lovable characters and story-driven mechanics. Now, legendary fighting game studio Arc System Works and Cygames are teaming up to bring the universe to home console in an action-packed head-to-head fighter. Featuring a colorful cast of their most popular \"crewmembers,\" each with a unique fighting style that is easy to learn but hard to master, Granblue Fantasy: Versus is sure to appeal to fans of Granblue lore and fighting games alike.\n\nKEY FEATURES\n\n* An Anime Fighter for Players of All Levels!\nArc System Works, the team behind critically-acclaimed fighting series BlazBlue, Guilty Gear, and Dragon Ball FighterZ, and Cygames, the people behind the international mobile phenomenon Granblue Fantasy, usher in a new era of fighting games with a rich and accessible battle system suitable for beginners and veterans alike.\n\n* Fight as Your Favorite Granblue Characters!\nA balanced and varied cast of combatants are ready to duke it out, each with their own individual fighting styles and dazzling skills. Whether it's the well-rounded Katalina, the long-range specialist Ferry, or the dual blade wielder Lancelot, there is a character and style to suit almost anyone's tastes.\n\n* A Gorgeous 2.5D Style World, Accompanied by Memorable Melodies!\nHigh production values recreate the well-known locales of the Granblue Fantasy universe in vivid 2.5D, bringing these environments to life as crewmembers cheer in the background, all accompanied by Stelle Magna's stirring soundtrack.\n\n* Captivating Visuals, Designed by a Fantasy Expert!\nHideo Minaba of Final Fantasy series fame contributes as art director, lending his extraordinary talents and unforgettable character and world designs to the Granblue Fantasy universe!",
    "score": "78"
  },
  {
    "id": "cbf675b1-1317-4902-b7a2-557215f74116",
    "title": "Mobile Suit Gundam: Extreme VS. MaxiBoost ON",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/0/e204b3b840ba7a952c2b98fa894eb995-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 30, 2020",
    "description": "MOBILE SUIT GUNDAM EXTREME VS. MAXIBOOST ON” is a true port of the arcade version that started operation in 2016 in Japan—and is still popular today. Coordinate and lay waste to your rivals in fierce PVP fighting combat iconic to the EXTREME VS. series. Join the battle with 183 units from the entire Gundam universe, each with different abilities ready to suit your play style. Choose between three different EX BURST Systems: FIGHTING BURST, EXTEND BURST and SHOOTING BURST!",
    "score": "78"
  },
  {
    "id": "1b6f8fc8-d983-4e72-aa17-88acffe04dd8",
    "title": "Control: The Foundation",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/4/1060d94dffad510a710a1d181f50f3f6-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 26, 2020",
    "description": "The Foundation Expansion includes new story content and side missions as well as new weapons and mods inspired by the Oldest House's mysterious origins. The Astral Plane is colliding with our reality. Jesse Faden, the Director of the Federal Bureau of Control, must travel through the caverns of the Foundation to prevent the Astral Plane from consuming the Oldest House. The missing Head of Operations, Helen Marshall, may hold some answers to the mysteries surrounding this threat...",
    "score": "78"
  },
  {
    "id": "41115f23-f629-457d-9804-0eed1ed70771",
    "title": "Othercide",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/0/2e20182d2cc321797dd6b1f138344d71-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 28, 2020",
    "description": "Othercide is a horror-themed turn-based strategy game where the lore and game mechanics are tightly intertwined to deliver a twisted, dark and challenging experience. Enter a brutal world under assault from terrifying creatures from another dimension, hold back the tide with limited resources and endure brutal conditions in visually stunning world.\n\nExperience dynamic turn-based combat and a new way to anticipate enemy movements to perform a flawless tactical plan. Using the Initiative Sequence System and unique set of skills, you will be able to interrupt an enemy attack, plan a delayed action that will be triggered later on in the timeline and use reaction skill to respond to any threat.\n\nPrepare to suffer and face close calls in our terrifying and ruthless universe. With roguelite features, deadly missions, limited resources and permanent death, there is no room for errors.\n\nLevel up, unlock new skills and collect memories from the death of your enemies. A limited number of these bonuses can be implemented to your skills to boost their stats. But choose wisely as once implemented, you can't take them back, unless... you decide to sacrifice your Daughter!\n\nMake dramatic choices and endure with your Daughters traumatic experiences which will make them stronger or weaker.\n\nOthercide invites you in a ethereal monochromatic dimension with only dashes of crimson red where your worst nightmares come to life.",
    "score": "78"
  },
  {
    "id": "5077cec0-1ae4-488b-b285-14be2d450dbe",
    "title": "John Wick Hex",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/0/f30f647151dc0856dc5583cd26effaf6-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 5, 2020",
    "description": "John Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like John Wick, the professional hitman of the critically acclaimed film franchise. Created in close cooperation with the creative teams behind the films, John Wick Hex is fight-choreographed chess brought to life as a video game, capturing the series’ signature gun fu style while expanding its story universe. Players must make quick decisions and choose every action and attack they make, all the while considering their immediate cost and consequences.",
    "score": "78"
  },
  {
    "id": "7955573d-86a8-4399-9e47-25a4bc90ff61",
    "title": "Fury Unleashed",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/9/2b1f1b288091c40ad0c94ca75de6c601-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 8, 2020",
    "description": "Fury Unleashed is an action platformer where you shoot your way through the pages of an ever-changing comic book. Take advantage of unique combo system to unleash your fury and become a whirling tornado of destruction. Discover why your creator doubted in you and prove him wrong.",
    "score": "78"
  },
  {
    "id": "175d86f9-d8f2-4ed8-94a6-e04573a697e0",
    "title": "Wasteland 3",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/5/cdf2359ad5145260958cd7599d4a7427-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 28, 2020",
    "description": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies.",
    "score": "78"
  },
  {
    "id": "bf01e1c4-a17f-446e-9518-a1a8ef82459c",
    "title": "SUPERHOT: MIND CONTROL DELETE",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/5/991bdb53d6a33bd5b2a20e514e739157-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 16, 2020",
    "description": "ONE OF US. ONE OF US. Still outnumbered, still outgunned. Enemies swirl around you in a storm of slow motion violence. Battle after battle, each fallen foe pushes you closer to the secrets hiding in the game and each secret gives you more powers to fight the System’s unending opposition.",
    "score": "78"
  },
  {
    "id": "30bbf572-f29b-4db0-a2cc-57203182ede1",
    "title": "Descenders",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/2/b5468cf1a9c7f5ac28c95ae0f9892bea-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 25, 2020",
    "description": "Descenders is extreme downhill freeriding for the modern era, with procedurally generated worlds, and where mistakes have real consequences. Will you lead your team to glory and become the next legendary Descender? In Descenders, your team is your life. When you pick a side - Enemy, Arboreal or Kinetic - you'll be bound together with other players who choose the same side as you.\n\nGrab your bike, pick your team, and attempt to live up to the legend of your Descender. Will you join the die-hard, trick-frenzy ranks of Team Enemy, the proficient, off-road stylings of Team Arboreal, or the high-octane, speed-is-everything Team Kinetic?",
    "score": "77"
  },
  {
    "id": "6cf6f152-3db1-45e7-a66f-2e2245d091fe",
    "title": "Hardcore Mecha",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/2/8c1c3193af95175e89649e5d5b0cbf32-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 14, 2020",
    "description": "Hardcore Mecha is a 2D platformer action focusing on a better handling. The Campaign mode offers rich gameplay and seamless in-game cut-scenes for an immersive experience. Choose your favorite mecha in Multiplayer, experience the fast-paced hardcore competitive battle of steel.",
    "score": "77"
  },
  {
    "id": "eebcbbdf-0cfd-4f73-8fae-6d8e7d42d752",
    "title": "Pillars of Eternity II: Deadfire",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/3/22fe1c74e8055ba5f557e70fe400015b-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 28, 2020",
    "description": "Pursue a rogue god over land and sea in the sequel to the multi-award-winning RPG Pillars of Eternity. Captain your ship on a dangerous voyage of discovery across the vast unexplored archipelago region of the Deadfire. Bend the world to your will, as you explore the depths of infinite possibilities, including detailed character customization, total freedom of exploration, and more meaningful choices at every turn.\n\nFeatures:\n\n* Immerse yourself in a deeper single player RPG game experience -- enriched with cutting edge technology and features, Deadfire builds on the foundation of classic D&D gameplay with vastly improved graphics, deeper game mechanics and a whole new hand-crafted adventure where choices truly matter.\n\n* Discover the new region of the Deadfire -- plot your own course by ship and explore the rich and exotic islands of the archipelago region, discovering new places interacting with their inhabitants and engaging in a variety of quests at every port.\n\n* Build your party and customize your companions -- choose from 7 different companions to join you on your quest and assign multiple classes and deeper abilities for each. Witness their personal relationships and interactions unfold with the addition of the new companion system.\n\n* Captain your ship across the seas -- as your stronghold on the seas, your ship is much more than simply a vessel for exploring. Upgrade your ship and crew and choose what skills you improve in order to survive dangerous encounters along the way.",
    "score": "77"
  },
  {
    "id": "0b1484a0-d8f9-46b6-a847-9b5059351c0f",
    "title": "Mortal Shell",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/8/4713565c63301d1996e972a6de3cb2a6-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 18, 2020",
    "description": "Mortal Shell is a deep action-RPG that tests your sanity and resilience in a shattered world. Your adversaries spare no mercy, with survival demanding superior awareness and precision. Possess lost warriors, discover hidden sanctums, and face formidable foes.",
    "score": "77"
  },
  {
    "id": "9b0b48cf-4acb-4d50-bd97-15235faf0247",
    "title": "Yakuza 3 Remastered",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/4/34b847ef5971586de6b1b8c90fc22cf0-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 11, 2020",
    "description": "As part of The Yakuza Remastered Collection, enjoy Yakuza 3 with restored content in 1080p and 60fps. In a quest to abandon their bloody past, Kazuma Kiryu and adoptive daughter Haruka Sawamura leave for Okinawa to run the Morning Glory Orphanage. But trouble shadows Kiryu and the Morning Glory Orphanage is soon entangled in a deadly power struggle.",
    "score": "77"
  },
  {
    "id": "a15c30c4-3809-44de-9eda-5b783d0a0205",
    "title": "Deliver Us The Moon",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/7/061786e7d98608999a541899455d1b56-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 24, 2020",
    "description": "Deliver Us The Moon is a Sci-Fi thriller set in an apocalyptic near future, where Earth's natural resources are depleted. A lone astronaut is sent to the moon on a critical mission to save humanity from extinction.",
    "score": "77"
  },
  {
    "id": "117e1fe0-868b-48cb-b6cb-8749e07860bb",
    "title": "FORM",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/2/223bd009f62040d77eef1a2931e7d4d3-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 7, 2020",
    "description": "Enter a surreal adventure where puzzles are built from dreams and memories. Solve the mystery behind an ancient artifact. Advance through a world that transforms around you. Transcend this existence. Charm Games brings you Form, a surreal adventure that unfolds within the confines of the human mind.",
    "score": "77"
  },
  {
    "id": "970fc479-cf7d-44e3-b574-d330c19fd053",
    "title": "Pathfinder: Kingmaker - Definitive Edition",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/3/9d539feaf8bd906ed4561c21c8d9a6a3-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 18, 2020",
    "description": "Pathfinder: Kingmaker is the first single-player isometric CRPG set in the world of a top-selling D&D type role-playing game by Paizo. Being a tribute to such classics as Baldur's Gate and Neverwinter Nights, it brings back memories of beloved gameplay mechanics and embarks the player on a hand-crafted, story-driven adventure. Become introduced to the rich universe of Pathfinder as a newcomer or explore famous locations familiar to any fan of the original tabletop game. Walk your path through the legendary Stolen Lands and meet iconic characters, ready to accompany you on your arduous journey. Gather the perfect party, dive into a great variety of dungeons, and defeat some of the deadliest creatures this world has ever seen. Witness how your decisions affect the environment and the people inhabiting it.\n\nEstablish your kingdom to bring peace, hope, and prosperity to the land or take everything for yourself and drive it into darkness. The choice is only yours! \n\nTHE MAJOR FEATURES:\n\nCOMPANION FOCUSED STORY\nExperience the adventure alongside living and breathing companions, each with deep stories and decisions of their own. Love them, adore them or hate them for who they are.\n\nCHARACTER DEVELOPMENT\nCustomize your character and companions with a multitude of options available in Pathfinder to make the perfect party capable of overcoming insurmountable challenges.\n\nKINGDOM\nEstablish your kingdom in Stolen Lands, claim new territories, and build towns and cities. Be a wise ruler or a heavy-handed tyrant.",
    "score": "77"
  },
  {
    "id": "2ef7c23e-1983-4afb-9b5e-7f1f3b47b482",
    "title": "Death end re;Quest 2",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/4/f46fd02c144e88e8b8f19e56c148c401-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 25, 2020",
    "description": "In collaboration with Corpse Party scenario writer Makoto Kedouin, this horror RPG follows Mai Toyama’s search for her sister in a quiet lakeside town. She’ll unravel clues to the town’s past by day, and battle Shadow Matter by night. Can you uncover the truth before reality is consumed by darkness?",
    "score": "77"
  },
  {
    "id": "94c1ed8c-a476-482f-bb84-98a9cb2d7b51",
    "title": "Nioh 2: The Tengu's Disciple",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/4/f40479176cd59012e2a7e6d72a797aba-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 30, 2020",
    "description": "Nioh 2: The Tengu's Disciple is a Role-Playing game, developed by Team Ninja and published by Sony Interactive Entertainment.",
    "score": "77"
  },
  {
    "id": "0789d083-d720-4ee4-93fc-980dad7940ec",
    "title": "Darksiders Genesis",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/3/f72da32b8e17208b5d8599155b28a242-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 14, 2020",
    "description": "From the dawn of creation, the council has maintained the Balance across existence. Carrying out their orders are the Horsemen, Nephilim (powerful beings spawned from the unnatural union of angels and demons) who have pledged themselves to the Council and been granted immense power.\n\nHowever, this power came at a tragic cost: the Horsemen were ordered to use their newfound strength to wipe out the rest of their kind. What followed was a bloody battle on Eden where the Horsemen, obeying the will of the Council, annihilated the Nephilim.\n\nDarksiders: Genesis is an action/adventure that tears its way through hordes of demons, angels, and everything in-between on its way to Hell and back with guns blazing and swords swinging. Genesis gives players their first look at the world of Darksiders before the events of the original game, as well as introduces the horseman Strife.",
    "score": "77"
  },
  {
    "id": "90a55e1b-c85a-4e49-aab9-88b3b2c88ff4",
    "title": "MotoGP 20",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/8/3edc992ae75f8c01500a6c5f43e7177d-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 23, 2020",
    "description": "Take control of your own career, switch from real teams to new teams created with sponsors from the world of MotoGP™, decide the development of the bike and manage your technical unit to win. Improved physics, with even more realistic and complex braking management. The tire has been divided into independent sectors for wear and temperature, and the fuel consumption can be managed with driving style and power maps. If you were looking for a challenge, this is definitely the one for you. Being a successful driver is much more than just keeping the throttle wide open. You also need to win with style! Unleash your creativity with 6 different graphic editors, including the new Suit and Livery editor for your bike. [Milestone]",
    "score": "76"
  },
  {
    "id": "05c73145-8c7d-4502-9087-a1ecf81adb84",
    "title": "Trials of Mana",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/8/34a7ad0b1f9a70a927defa82309f0a22-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 24, 2020",
    "description": "When the world was shrouded in darkness, the Goddess of Mana drew forth the Sword of Mana to smite the eight Benevodons, monsters of destruction. She sealed the horrors inside the eight Mana Stones, bringing the realm back from the brink. Weakened from rebuilding the world, the Goddess changed herself into a tree and fell into a deep sleep for many years. However, the forces of evil soon sought to free the Benevodons to gain control of the world. They started a terrible war to further their plot and destabilize the kingdoms. Peace was at an end. Mana itself began to disappear from the world and the Mana Tree started to wither...",
    "score": "76"
  },
  {
    "id": "d8e9e72d-f5ce-4500-be98-cfa9f9fe0a4e",
    "title": "Kingdoms of Amalur: Re-Reckoning",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/5/e8c843e206132b2ed0cbd36d930614ea-98.jpg",
    "platform": "PlayStation 4",
    "date": "September 8, 2020",
    "description": "The hit RPG returns! From the minds of the bestselling author R.A. Salvatore, spawn creator Todd mcfarlane, and Elder Scrolls IV: oblivion lead designer Ken rolston, comes kingdoms of amalur: re-reckoning. Remastered with stunning visuals and refined gameplay re-reckoning delivers intense, customizable RPG combat inside a sprawling game world. Uncover the secrets of amalur, from the vibrant city of rathir to the vast region of dalentarth to the grim dungeons of the brigand Hall caverns. Rescue a world torn apart by a vicious war and control the keys to immortality as the first Warrior ever to be resurrected from the grips of death. \n\n* Build the ideal character for the most intense combat, choosing from a countless combinations of skills, abilities, weapons and pieces of armor\n* The revolutionary destiny system allows you to continuously evolve your character class to your style of play\n* Seamlessly Integrate magical and melee attacks as you take on scores of enemies in grand fight sequences and finish them Off with brutal fate shift kills\n* Extend your experience in amalur with all DLC from the original release, from teeth of naros to Legend of Dead kel and more!\n* Hundreds of hours of RPG play await! Travel from the vibrant city of rathir, to the vast region of dalentarth, and the grim dungeons of the brigand Hall caverns as you uncover the secrets of amalur!",
    "score": "76"
  },
  {
    "id": "dcedb27e-b6b6-44c7-a960-1eef4db4fb4a",
    "title": "PGA Tour 2K21",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/7/ae3cb819e54aaff4e984a0fcc8ddd9a6-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 21, 2020",
    "description": "ALL-NEW PGA TOUR CAREER MODE:Prove you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\n    PGA TOUR PROS AND NEW COURSES: Play against Justin Thomas and 11 top pros on stunning, real-life courses including TPC Sawgrass, East Lake Golf Club, and more.\n    BUILD YOUR MYPLAYER & DREAM COURSE: Create and personalize your MyPLAYER with equipment and apparel from brands you love. Design your ultimate course with 1,000s of custom options.\n    DOMINATE THE GREEN AT ANY SKILL LEVEL: Rookies can take advantage of real-time tutorials, tips and shot suggestions. Already a pro? Master your game with Pro Vision, Distance Control, Putt Preview, and other innovations.\n    GET THE PARTY STARTED: Hit the links with friends by playing local and online matches, including Alt-Shot, Stroke Play, Skins and 4-Player Scramble.\n    MAKE YOUR OWN RULES: Command your Clubhouse with Online Societies. Run full seasons and tournaments and earn bragging rights on the course. Create entry rules and requirements as well as handicap and event settings.\n    THE MOST REALISTIC COURSES EVER: Real-world scanning brings the fairway, green, bunkers, trees, lakes and ponds to life! True-to-form PGA TOUR broadcast presentation features slick graphics, dynamic cut-scenes and a seamless replay system, all anchored by the play-by-play commentary of Luke Elvy and Rich Beem.",
    "score": "76"
  },
  {
    "id": "46cd5b8d-5bcd-4b2f-ae4e-facd5aad540a",
    "title": "Utawarerumono: Prelude to the Fallen",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/2/1e3857c89bc48d678b39e7d6f5d9aca9-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 26, 2020",
    "description": "Prelude to the Fallen follows the story of a young man with no memories who awakens in a strange world, and is taken in by a tribe of kindhearted villagers. He is raised as one of their own, eventually receiving the name \"Hakuowlo.\" When neighboring nations begin to encroach on his village, Hakuoro rises up against the tyrannical invaders, setting off on an unforgettable journey that lives on in the songs of legend.",
    "score": "76"
  },
  {
    "id": "37550c20-1964-4c42-8b12-734e2fbe8119",
    "title": "The Wonderful 101: Remastered",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/7/826dbeac559350df3f3378d5cbf567fb-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 19, 2020",
    "description": "A team of heroes from around the world must UNITE to protect the earth from vicious alien invaders! This band of 100 Wonderful Ones works together using their fantastic abilities to create a variety of forms. Whether it be a giant fist or a sharp blade, they'll use their wits and power to overcome the enemy's pitfalls and perils! And the final member of this team of courageous heroes... is you.\n\nFeatures:\n\n* Over 100 unique and dazzling heroes, each with their own backstories and emblems!\n\n* Change weapons in a flash with the 'Unite Morph' system! Draw shapes to switch between swords, whips, hammers, and more to battle with strategy and flair!\n\n* Unite Morphs can be more than just weapons! Build hang gliders and bridges to cross chasms, and bounce and blast your way to great heights! Use your smarts as well as your strength to solve puzzles and persevere!\n\n* Don't forget - a hero's true calling is protection! Rescue the citizens you come across and your bravery will inspire them to UNITE UP! For a limited time, of course.\n\n* Your missions will take around the world! Through cities, across the ocean floor, deep in the jungle, and to a host of exciting locations!",
    "score": "76"
  },
  {
    "id": "c6fa323d-0a45-4faf-a845-e34dc286d0de",
    "title": "DOOM 64",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/2/59c7c2744ab71b75638d9fec32706f2b-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 20, 2020",
    "description": "You killed the Demons once, they were all dead. Or so you thought... A single Demon Entity escaped detection. Systematically it altered decaying, dead carnage back into grotesque living tissue. The Demons have returned - stronger and more vicious than ever before. You mission is clear, there are no options: kill or be killed!",
    "score": "75"
  },
  {
    "id": "2b88e097-0f51-47c0-8a8e-85d9372c7bd7",
    "title": "One Piece: Pirate Warriors 4",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/6/ea1f2f4776b0ea21abf41d87b92a2349-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 27, 2020",
    "description": "The Pirate Warriors are back and bring with them a more explosive story, more environments and even crazier attacks in ONE PIECE: PIRATE WARRIORS 4. Follow Luffy and the Straw Hats from the beginning as they make their journey through different islands and onwards in the hopes of ﬁnding the illustrious treasure - the One Piece. Play through some of the most extraordinary islands and environments in the ONE PIECE story and take on memorable foes. Choose from some of your favorite characters and take on a vast number of enemies through iconic moments from the One Piece anime. Developed by the masters of the action musou genre, KOEI TECMO GAMES, ONE PIECE Pirate Warriors 4 brings together the excitement from slashing hordes of enemies with the fun and energetic personalities from the One Piece series. Embark on a new pirate warriors adventure.",
    "score": "75"
  },
  {
    "id": "8676444d-4ee5-44b1-9d8d-9afebda5049f",
    "title": "Ys: Memories of Celceta",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/3/008622d6d1acff7cd75dc220d218f838-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 9, 2020",
    "description": "In Ys: Memories of Celceta, developer Falcom revisits the land and characters of Japanese cult favorite Ys IV for its first ever North American debut. This re-envisioning of the fourth installment in the Ys series takes a brand new approach, changing and framing the story of Ys IV within an all-new tale of conspiracy, deception and mystery. Featuring an updated version of the party-based battle system from Ys Seven, as well as the largest and most varied overworld in series history, Ys: Memories of Celceta brings a greater sense of adventure to the Ys universe than has ever been seen before.",
    "score": "75"
  },
  {
    "id": "fffb6410-3999-485a-b6ff-db3c2d6277b3",
    "title": "Beyond Blue",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/2/94792f23db91dc23449a834a3e834122-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 11, 2020",
    "description": "Beyond Blue takes players into the near future, where they will have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. She and her newly-formed research team will use groundbreaking technologies to see, hear, and interact with the ocean in a more meaningful way than has ever been attempted. The game features an evocative narrative and exploration of an untouched world. Embracing the same inclusive development process that was used to create Never Alone (Kisima Ingitchuna), E-Line’s BAFTA award-winning game about Alaska Native culture, the company partnered with BBC Studios (developers of the acclaimed Blue Planet II), OceanX Media, world-class game makers, and some of science’s leading ocean experts to craft an experience that reflects the awesome wonder and unbounded mystery that infuses our planet’s beating blue heart.",
    "score": "75"
  },
  {
    "id": "b1234931-a51e-45f9-b7d5-f3c41b688b91",
    "title": "Below",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/0/10b1469e495e5e74b77f7895505b0acc-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 7, 2020",
    "description": "Below is a classic rogue tale with moody graphics and Kinect technology. You'll scour the open world in search of rare and special loot while battling the malevolent Darkness, an AI-controlled character which uses Kinect to sense and change level progression based on the rooms surroundings.",
    "score": "75"
  },
  {
    "id": "1c6dbd2b-834d-4e7c-8349-86de1bb4eb69",
    "title": "The Room VR: A Dark Matter",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/0/6ab6dc3f5c85a2d580c07e70a7f4d353-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 26, 2020",
    "description": "The British Institute of Archaeology, London, 1908: The disappearance of an esteemed Egyptologist prompts a Police investigation into the unknown. Explore cryptic locations, examine fantastic gadgets and uncover an otherworldly discovery which blurs the line between reality and illusion. Designed from the ground up for the unique capabilities of virtual reality, players can inhabit the spine-tingling world of The Room and interact with its strange contraptions in this compelling new chapter.",
    "score": "75"
  },
  {
    "id": "5dfeb6dd-83be-4d2e-af11-7008e46e8749",
    "title": "Patapon 2 Remastered",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/3/d5d6dabc6be15835a436fe2a97d1d026-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 30, 2020",
    "description": "The story of the Patapon tribe marches forth as they hunt for the fabled Earthend. Shipwrecked in a new and strange continent the Patapon are depending on you, their god, to lead them safely through this perilous new land. As you guide the tribe through this new world with your mystical drum, they will come face to face with a new tribe, encounter a mysterious and mighty Hero Patapon and uncover the ruins of Patapolis, a mystical place long spoken of by the Patapon. All-new modes to Patapon 2 include thrilling multiplayer stages, a huge array of missions and deep tutorials that will have you drumming to the beat of the Patapon in no time. Head to patapon-game.com for the captivating mini-game, The Art Of War, where the goal is to collect as many Patapon characters as you can and then immortalise your battle with the Patapon Wallpaper creator. Lead your loyal followers through 60 rhythmic stages. Keep the beat going with tons of hidden items and mini-games to reveal. Drum along with friends and tackle multiplayer missions.",
    "score": "75"
  },
  {
    "id": "b38da46a-a541-4000-a087-901646225337",
    "title": "Mortal Kombat 11: Aftermath",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/4/bdc5524077a291359dd2ff659f030e85-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 26, 2020",
    "description": "Aftermath features a brand-new cinematic story centered around trust and deceit. Fire God Liu Kang, the new keeper of time and protector of Earthrealm, looks to secure the future he envisions. In order to do so, he is forced to enlist the help of some unlikely allies and familiar foes. Players will have to decide who they can trust and who they must defeat with fate on the line. Forge a new history. \n\nNew Playable Fighters\nSheeva and Fujin triumphantly return, with special guest RoboCop making his debut in Mortal Kombat. Dead or Alive, they're coming with you!\n\nStage Fatalities\nThe Klassic finishing move is back! Use the world as your weapon, and watch as the environment engulfs, eviscerates and destroys your opponents. \n\nFriendships\nYou can dance if you want to. Friendly finishers are back for the entire roster. Kill them with Kindness as the ultimate troll move. \n\nNew Stages\nKronika's Keep and Soul Chamber will be brand-new additions. Aftermath will also bring the klassic Dead Pool stage and RetroKade featuring favorites from MKI-III.",
    "score": "75"
  },
  {
    "id": "b75c3c02-8cb3-4fb0-862b-50fded25e6c7",
    "title": "Ion Fury",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/6/ae7e528ecfc9f96d58138e89f4f51cc3-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 14, 2020",
    "description": "Tear through cyborg infantry, giant robots and even wendigos with eight retro-inspired weapons. Dual-wield Penetrator SMGs with incendiary ammunition to scorch foes, wreak havoc with the Disperser with either shotgun shells or swap in grenade rounds, or chuck a Clusterpuck into a room and delete everyone. Utilizing the same Build engine behind the original Duke Nukem 3D, Ion Fury offers the beloved feel of ‘90s shooters. Seamlessly integrated modern features include headshots, environmental interaction, improved physics, auto-saves, and widescreen functionality. Ion Fury’s marriage of both styles provides both a genuine introduction to classic FPS games and a worthy addition to the genre as a whole, as evidenced by winning IndieDB’s game of the year award.",
    "score": "75"
  },
  {
    "id": "50dd5d3d-b1f7-4c6a-8c3d-be0436f85890",
    "title": "Moving Out",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/4/04aa64ad5d938f77f371fc4e3ec56dd2-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 28, 2020",
    "description": "Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!\n\nAre you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there's no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!",
    "score": "74"
  },
  {
    "id": "304afa19-b1cb-4d00-b1b1-560cdb88d292",
    "title": "TT Isle of Man: Ride On The Edge 2",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/5/f9ec7828de19ab5e3275854b109dea2d-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 19, 2020",
    "description": "Racing across an over 60 km long ultra-technical track at breakneck speed requiring realistic riding skills… that is the challenge that awaits in TT2! Lots of new features lie ahead: open world, reworked physics, classic motorbikes, and more. Fine-tune your motorbike, upgrade its performance and monitor its data in real time to stay competitive.",
    "score": "74"
  },
  {
    "id": "47dbcbd1-d3b3-4a94-b994-ff5a96951242",
    "title": "Saints Row: The Third Remastered",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/1/5036e7dc82ff7b9319033c1a273ef820-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 22, 2020",
    "description": "Experience The Full Package, Remastered. Steelport, the original city of sin, has never looked so good as it drowns in sex, drugs and guns. The Third Street Saints are at the height of power and yours to control. This is your city. These are your rules.",
    "score": "74"
  },
  {
    "id": "97f708ca-6076-4b39-a4ca-16f4670a3202",
    "title": "Journey to the Savage Planet",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/2/2c5d9cc53bb255a818d318ee3b232590-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 28, 2020",
    "description": "In this colorful, co-op adventure game you play as the newest recruit to Kindred Aerospace. Dropped onto an uncharted planet with little equipment, you must determine if this planet is fit for human habitation but perhaps you are not the first to set foot here…",
    "score": "74"
  },
  {
    "id": "bed5576e-470e-4718-b4aa-cf424a7cc6cf",
    "title": "Control: AWE",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/3/ab75e6cb0967dba9bd6a09e9f1b58237-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 27, 2020",
    "description": "The Bureau studied its most dangerous Altered World Events in this lost sector. The records were sealed, the objects contained, and their powers abandoned. Now, the sector is breached and the objects are loose…\nAWE brings new story content and side missions as well as new weapons and mods to the world of Control.",
    "score": "74"
  },
  {
    "id": "624699d5-886c-439b-a633-83761ebcb853",
    "title": "Darius Cozmic Collection: Arcade",
    "rankNumber": "82.",
    "img": "https://static.metacritic.com/images/products/games/2/d96c42435d456e1677cfc44f51a5c361-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 16, 2020",
    "description": "The Darius Cozmic Collection Arcade contains 4 legendary console titles in a total of 7 versions:\n\n    DARIUS (old version)\n    DARIUS (new version)\n    DARIUS (extra version)\n    DARIUS II (dual screen version)\n    SAGAIA (Ver. 1)\n    SAGAIA (Ver. 2)\n    DARIUS GAIDEN",
    "score": "74"
  },
  {
    "id": "7b5ba8e3-03e3-41a3-a65f-fda85e036d2c",
    "title": "Project Warlock",
    "rankNumber": "83.",
    "img": "https://static.metacritic.com/images/products/games/2/6e18ef07dfcfa07f9a1e1e395a5ecf96-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 9, 2020",
    "description": "One man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hours of super fun carnage. Let’s rock and roll! Explore 60 vast levels in five settings, from frozen Antarctic base to the sands of Egypt to the medieval castles’ courts and graveyards. Find keys to unlock passages, reveal secret caches with ammo and gold, use lifts and hidden buttons to access new areas. Finally descend to hell to face the ultimate challenge and emerge victorious. Combat tons of enemies from flying demons to five-storeys robots, splashing walls and floors with their blood and chunks. Dodge bullets and projectiles, figure out strategies and weapons that work best against each of the nasty villains. Learn their moves and stay one step ahead to survive through the levels. Face megabosses in vast final arenas to complete each world. Expand your arsenal with new weapons found along your way. From powerful blades to massive guns, collect and develop your favourite gear and master the craft of carnage. Reach into vast arsenal of 38 types of weapons and learn their secret tricks to deliver maximum damage, fast! Grab ammo and spit out series of bullets, walls of flames, and bursts of magic shots to bring down enemies foolish enough to stand in your way. Develop your hero the way you like, by assigning upgrade points and perks to the favourite skills between each level. Develop and upgrade spells and weapons to create your unique character through the game, and use their powers to master the game in higher difficulty modes.",
    "score": "74"
  },
  {
    "id": "8fab028f-1b41-41aa-b544-9eb0f7638f8c",
    "title": "Tom Clancy's The Division 2: Warlords of New York",
    "rankNumber": "84.",
    "img": "https://static.metacritic.com/images/products/games/6/76ec671fbbfd8e9038abdf1b3fbabb79-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 3, 2020",
    "description": "While The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and used them to conquer Lower Manhattan. With other rogue Agents and a lethal new viral strain at his command, Keener is poised to eradicate what little has been rebuilt since the catastrophic Black Friday pandemic. The battle to restore order continues, but now The Division has a new mission: Stop Keener at any cost.",
    "score": "74"
  },
  {
    "id": "922f5ea3-d782-4f55-be81-bd0b3e50ff0d",
    "title": "Dragon Ball Z: Kakarot",
    "rankNumber": "85.",
    "img": "https://static.metacritic.com/images/products/games/5/f88092cd50f054727235b7f071f54556-98.jpg",
    "platform": "PlayStation 4",
    "date": "January 17, 2020",
    "description": "Relive the story of Goku in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from the DRAGON BALL Z universe. \n\nExperience the Story\nExperience the story of DRAGON BALL Z from epic events to light-hearted side quests, including never-before-seen story moments that answer some burning questions of Dragon Ball lore for the first time!\n\nIconic DRAGON BALL Z\nPlay through iconic DRAGON BALL Z battles on a scale unlike any other. Fight across vast battlefields with destructible environments and experience epic boss battles that will test the limits of your combat abilities. Increase your power level and rise to the challenge! \n\nDon't Just Fight As Goku\nLive as Goku. Fish, fly, eat, train, and battle your way through the DRAGON BALL Z sagas, making friends and building relationships with a massive cast of DRAGON BALL characters.",
    "score": "73"
  },
  {
    "id": "08b59d95-9fa8-4bae-b57b-73b8db4c8861",
    "title": "Marvel's Iron Man VR",
    "rankNumber": "86.",
    "img": "https://static.metacritic.com/images/products/games/1/0b2fe91cb7451e24a146e939a3f0b3ad-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 3, 2020",
    "description": "In Marvel’s Iron Man VR the player, who plays as the genius inventor Tony Stark, confronts ghosts from his past—powerful forces who seek to ruin him and everything he stands for. By fully embracing the magic of PlayStation VR, players will come face-to-face with iconic allies and Super Villains as they jet around the globe on a heroic mission to save not only Stark Industries, but the world itself. [PlayStation.com]",
    "score": "73"
  },
  {
    "id": "36c1c8c1-c900-4531-8d11-6fbce99acfb4",
    "title": "Arcade Spirits",
    "rankNumber": "87.",
    "img": "https://static.metacritic.com/images/products/games/3/4b2e3a38b28ec73b6f686e4ed366376f-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 1, 2020",
    "description": "In the year 20XX, arcades still reign supreme. Take part in a romantic comedy visual novel and get to know the eccentric residents of the local Funplex. The future is filled with love and friendship.",
    "score": "73"
  },
  {
    "id": "af343aac-dc98-458c-8e61-fc58f6dc7434",
    "title": "Sakura Wars",
    "rankNumber": "88.",
    "img": "https://static.metacritic.com/images/products/games/5/03664ab94965d3c38a497ccc13ced59e-98.jpg",
    "platform": "PlayStation 4",
    "date": "April 28, 2020",
    "description": "Improve the Revue Flower Division team's fortune to avoid being shut down in Sakura Wars for PlayStation 4. Set in a 1940s steampunk Tokyo, this single-player game features a dynamic LIPS dialogue system so you can build relationships through what you say and the way you say it. Lead your motivated team members to victory on the battlefield for a thrilling Sakura Wars experience.",
    "score": "72"
  },
  {
    "id": "009f2596-b4e5-4366-80f0-ec0e94ce5fe6",
    "title": "Zombie Army 4: Dead War",
    "rankNumber": "89.",
    "img": "https://static.metacritic.com/images/products/games/5/f0342bef5ad514485c23ee3ae765438c-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 4, 2020",
    "description": "Hitler’s hordes are back for more in this spine-chilling shooter from the makers of Sniper Elite 4! Abominable occult enemies, epic weapons and a harrowing new campaign for 1-4 players await in 1940s Europe, as you fight to save humankind from undead Armageddon!",
    "score": "72"
  },
  {
    "id": "23657fba-6959-421d-ba5d-63cedb0c434f",
    "title": "Fairy Tail",
    "rankNumber": "90.",
    "img": "https://static.metacritic.com/images/products/games/6/62c7da79f258bb68e4a639035e6eb7f7-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 31, 2020",
    "description": "Fight for Your Guild with Powerful Magical Abilities in FAIRY TAIL. FAIRY TAIL, based on Hiro Mashima's best-selling manga and anime series of the same name, follows the spell-binding plot from \"The Grand Magic Games\" story arc -- enabling gamers to re-live, or experience for the first time, the exciting episodes of this fan-favorite storyline. Not only will they be able to experience stories previously told in the manga and anime, but they will even be able to enjoy never before seen story and quest elements.\n\nThroughout their journey, players will be able to form a party from a selection of over ten iconic characters, including: the fire dragon slayer, Natsu Dragneel; the celestial mage, Lucy Heartfilia; the ice-make mage, Gray Fullbuster; the fairy queen 'Titania', Erza Scarlet; and the young sky dragon slayer, Wendy Marvell. With a wealth of guild members to recruit to their party, players can form their own dream team even including an unlikely group of allies for their own unique adventure.\n\nThe fiery and intense magical battles from the series are breathtakingly brought to life in FAIRY TAIL's environment; with a diverse range of magic available for the extraordinary characters to wield. Renowned moves from the series light up the screen, with some characters such as Natsu being able to take advantage of mode changes like utilizing the eye-popping Lightning Fire Dragon Mode. In addition, some guild members will be available to support in battle; including the Fairy Tail Guild Master, Makarov Dreyar, who can be called in to provide powerful aid on the battlefield.\n\nIn FAIRY TAIL, completing battles and quests will not only level up party members, it will lead to character bonding scenarios, provide options to upgrade the guild, and eventually raise the 'Guild Rank' enabling players to take on more challenging missions in their quest to become the greatest guild in Fiore.",
    "score": "72"
  },
  {
    "id": "685c1cbf-d49a-4a2f-95a3-5a7f858eba67",
    "title": "Yu-Gi-Oh! Legacy of the Duelist: Link Evolution",
    "rankNumber": "91.",
    "img": "https://static.metacritic.com/images/products/games/2/a82e7c901b6603cb4b0a73fcfd7fc881-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 24, 2020",
    "description": "Experience 20 years of Yu-Gi-Oh! history with Yu-Gi-Oh! Legacy of the Duelist: Link Evolution! Build your Deck from over 10,000 cards and take on the most iconic Duelists from the Yu-Gi-Oh! universe. Relive the stories from the original animated series through Yu-Gi-Oh! VRAINS!",
    "score": "71"
  },
  {
    "id": "93d6351b-4799-4935-809c-2fc78798a7f4",
    "title": "Assetto Corsa Competizione",
    "rankNumber": "92.",
    "img": "https://static.metacritic.com/images/products/games/3/70af6c2d1b0037e54c0793013657ac6c-98.jpg",
    "platform": "PlayStation 4",
    "date": "June 23, 2020",
    "description": "Assetto Corsa Competizione is an extraordinary racing simulation game allowing players to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint, Endurance and Spa 24 Hours races come to life with an incredible level of realism, in both single and multiplayer modes. Born from KUNOS Simulazioni's long-term experience, this racing simulator takes full advantage of Unreal Engine 4 to ensure photorealistic weather conditions and graphics, night races, motion capture animations, reaching a new standard in terms of driving realism and immersion, thanks to its further improved tyre and aerodynamic models.",
    "score": "71"
  },
  {
    "id": "15083652-f3fe-4dc9-9ccb-2495cb0af027",
    "title": "Relicta",
    "rankNumber": "93.",
    "img": "https://static.metacritic.com/images/products/games/3/e5d4ddf1f8101513ad3cf83601b60712-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 3, 2020",
    "description": "Relicta is a first-person puzzle game whose main mechanics combine magnetism and gravity. The player is equipped with a pair of special gloves that allow them to change the magnetic and gravitational properties of experimental cubes scattered around each level. These cubes can be moved by the player, either carrying them bodily or using magnetism or gravity. They can also be placed on teleporting machines to warp them to another teleporter and help solve puzzles. Mechanics really come alive when combined in ingenious ways. For instance, magnetism can be used to repel or attract cubes, but repelling a cube that has previously “anti-gravitated” gives you a frictionless device that will retain inertia until it collides against something solid, like a wall (or your skull). It can even be used as a means of transport for the player to reach new places. Cubes can also be used to power up some devices, in order to operate doors and force fields. As the player progresses towards more complex puzzles, they will encounter other devices - magnetic plates, elevators, buttons or even drones capable of nullifying magnetic and gravitational fields as well as stealing cubes.",
    "score": "71"
  },
  {
    "id": "e6a9b1bf-3ba7-47e7-95f9-97a92f9dd0cc",
    "title": "Call of Duty: Modern Warfare 2 Campaign Remastered",
    "rankNumber": "94.",
    "img": "https://static.metacritic.com/images/products/games/0/3e625f05e669d55b3e2180e6c712f7e9-98.jpg",
    "platform": "PlayStation 4",
    "date": "March 31, 2020",
    "description": "Relive the epic single-player Campaign from the 2009 blockbuster Call of Duty: Modern Warfare 2, remastered in true high-definition. Experience classic missions including Cliffhanger, The Gulag, and Whiskey Hotel as you join Soap, Price, Ghost and the rest of Task Force 141 in the globe-spanning fight to restore order to the world.",
    "score": "71"
  },
  {
    "id": "7d83e6e2-9f2a-49fd-b7b8-3ffc839875e9",
    "title": "Captain Tsubasa: Rise of New Champions",
    "rankNumber": "95.",
    "img": "https://static.metacritic.com/images/products/games/3/8116e3964c27da4f04ccaea34d913c37-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 28, 2020",
    "description": "Captain Tsubasa: Rise of New Champions is an arcade football game bringing a refreshing look to the football genre with the exhilarating action and over the top shots that made the license famous.",
    "score": "71"
  },
  {
    "id": "fc8b2a8e-defd-4790-b6e7-200c484fef23",
    "title": "Shantae and the Seven Sirens",
    "rankNumber": "96.",
    "img": "https://static.metacritic.com/images/products/games/6/6dfd819a4e17de3990f30d822e98501a-98.jpg",
    "platform": "PlayStation 4",
    "date": "May 28, 2020",
    "description": "New locations, abilities, and friends await in Shantae's biggest adventure yet!\n\nShantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble in paradise. As Shantae gets caught up in the island's sinister secrets, she'll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she'll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae's powers to suit their own style of play. \n\nKey Features:\n\n* Explore an interconnected world using new Fusion Magic creature transformations, including a newt and other aquatic forms!\n* 4K-resolution hand-painted visuals (on 4K devices only)!\n* All-new characters and returning favorites like Rottytops, Sky, Bolo, and the nefarious Risky Boots!\n* Collect and power up with monster cards!\n* Enjoy minigames, acquire magic and items, and uncover secrets!\n* Gorgeously animated TV-style cutscenes!",
    "score": "71"
  },
  {
    "id": "aa4bbbb2-bcd6-4616-8fe7-e40cdc642625",
    "title": "Radical Rabbit Stew",
    "rankNumber": "97.",
    "img": "https://static.metacritic.com/images/products/games/6/ea22002db9524287ba5afb079eab4f07-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 16, 2020",
    "description": "Radical Rabbit Stew is an action-packed title that combines puzzle-solving with fast-paced whack-a-rabbit gameplay, delivering bite-sized pick-up-and-play action, juicy pixel graphics and a sizzling soundtrack in one mouth-watering package.",
    "score": "70"
  },
  {
    "id": "2e459d82-233c-4633-94a3-51505086daac",
    "title": "Destroy All Humans!",
    "rankNumber": "98.",
    "img": "https://static.metacritic.com/images/products/games/6/be9798f55aec94c4557cd157b1c31b1c-98.jpg",
    "platform": "PlayStation 4",
    "date": "July 28, 2020",
    "description": "This is your chance to experience the other side of an alien invasion. Take on the role of alien Cryptosporidium 137 and terrorize the people of Earth to harvest their DNA in the most brazen action-adventure you've ever played. Take over all of humanity using a variety of alien weaponry on land or in the air.",
    "score": "70"
  },
  {
    "id": "61c1703c-0af7-427e-8e3f-91fc25b27efe",
    "title": "No Straight Roads",
    "rankNumber": "99.",
    "img": "https://static.metacritic.com/images/products/games/3/53e0a00fc00062dc6f5d421a254e616b-98.jpg",
    "platform": "PlayStation 4",
    "date": "August 25, 2020",
    "description": "Embark on a music-based action-adventure as indie rock band members Mayday & Zuke and lead a musical revolution against EDM empire No Straight Roads. After being unfairly rejected in their audition to join No Straight Roads, Mayday & Zuke uncover the evil intentions behind the NSR empire. It's now down to them to save their city from corruption. Enjoy fast & frenetic combat with a musical twist as these two aspiring rock artists fight back with the power of music!",
    "score": "70"
  },
  {
    "id": "50e67b81-349b-4302-8538-049d094a4845",
    "title": "Warriors Orochi 4 Ultimate",
    "rankNumber": "100.",
    "img": "https://static.metacritic.com/images/products/games/5/b06dc15c1ea0532f158b7788c7817c21-98.jpg",
    "platform": "PlayStation 4",
    "date": "February 14, 2020",
    "description": "Transcend the Power of the Gods, Take on Thousands in Battle!\n\nNew Characters\nStarting with Gaia, new heroes gather from multiple universes to join the fight.\n\nNew Storyline and Sub-scenarios\nThe battle has not ended... A new story and ending pursuing the truth of the world has been added. In addition, unique sub-scenarios will be available to reinforce the main story.\n\nNew Mode and Gameplay Experience\nNew features such as Infinity Mode and the Promotion system have been added. The enhanced gameplay allows players to grow their heroes to their ultimate potential!\n\nThe Ultimate in Musou Exhilaration!\nSacred Treasures can now be used by other characters allowing players to create unique and powerful teams, and with the new Musou Switch Combo feature the game will reach ultimate heights in exhilaration.\n\nImproved Playability\nPart of the UI and control settings have been improved along with additional features to make gameplay easier.",
    "score": "70"
  }
]