[
  {
    "id": "1d70e4d7-2228-4e96-bf71-52a270072b52",
    "title": "Half-Life: Alyx",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/4/559d5752e81e5bd977817d9de26bfe4b-98.jpg",
    "platform": "PC",
    "date": "March 23, 2020",
    "description": "Half-Life: Alyx is Valve's VR return to the Half-Life series. It's the story of an impossible fight against a vicious alien race known as the Combine, set between the events of Half-Life and Half-Life 2. Playing as Alyx Vance, you are humanity's only chance for survival. The Combine's control of the planet since the Black Mesa incident has only strengthened as they corral the remaining population in cities. Among them are some of Earth's greatest scientists: you and your father, Dr. Eli Vance. As founders of a fledgling resistance, you've continued your clandestine scientific activityperforming critical research, and building invaluable tools for the few humans brave enough to defy the Combine. Every day, you learn more about your enemy, and every day you work toward finding a weakness.\n\nABOUT GAMEPLAY IN VR:\n\nValve's return to the Half-Life universe that started it all was built from the ground up for virtual reality. VR was built to enable the gameplay that sits at the heart of Half-Life.\n\nImmerse yourself in deep environmental interactions, puzzle solving, world exploration, and visceral combat.\n\nLean to aim around a broken wall and under a Barnacle to make an impossible shot. Rummage through shelves to find a healing syringe and some shotgun shells. Manipulate tools to hack alien interfaces. Toss a bottle through a window to distract an enemy. Rip a Headcrab off your face and throw it at a Combine soldier.\n\nExtra content for Index owners\nCustomers who have purchased Valve Index hardware by the end of 2019 will have access to unique bonuses starting early next year:\n\n* Explore environments from Half-Life: Alyx in your SteamVR Home space\n* Alternate gun skins to embellish Alyx's arsenal\n* Special Half-Life: Alyx-themed content for Counter-Strike: Global Offensive and Dota 2\n\nCommunity-built environments\n\n* A set of Source 2 tools for building new environments will ship with the game, enabling any player to build and contribute new environments for the community to enjoy. Hammer, Valve's level authoring tool, has been updated with all of the game's virtual reality gameplay tools and components.",
    "score": "93"
  },
  {
    "id": "0eba9b8a-26cd-4550-aa91-f66891206108",
    "title": "Microsoft Flight Simulator",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/8/f41c89f11e6eadc4b934fcd6504a0800-98.jpg",
    "platform": "PC",
    "date": "August 18, 2020",
    "description": "From light planes to wide-body jets, fly highly detailed and accurate aircraft in the next generation of Microsoft Flight Simulator. Test your piloting skills against the challenges of night flying, real-time atmospheric simulation and live weather in a dynamic and living world.",
    "score": "92"
  },
  {
    "id": "4dc7797f-551f-4859-8df6-dee15ea08a1e",
    "title": "Crusader Kings III",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/0/bf1475c161c6857e0c52670b80486e4c-98.jpg",
    "platform": "PC",
    "date": "September 1, 2020",
    "description": "Paradox Development Studio brings you the sequel to one of the most popular strategy games ever made. Crusader Kings III is the heir to a long legacy of historical grand strategy experiences and arrives with a host of new ways to ensure the success of your royal house.",
    "score": "91"
  },
  {
    "id": "a2471c9b-b8e0-41b8-b6f5-575d40928d2d",
    "title": "Ori and the Will of the Wisps",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/2/fb071eb430c986bc8f42f07da0a7339e-98.jpg",
    "platform": "PC",
    "date": "March 11, 2020",
    "description": "The little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and the Blind Forest comes the highly anticipated sequel. Embark on an all-new adventure in a vast world filled with new friends and foes that come to life in stunning, hand-painted artwork. Set to a fully orchestrated original score, Ori and the Will of the Wisps continues the Moon Studios tradition of tightly crafted platforming action and deeply emotional storytelling.",
    "score": "88"
  },
  {
    "id": "c6e4f89e-f3e8-4cad-94d1-006b6b44c300",
    "title": "F1 2020",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/6/59d09549297ae575f9672f5b3f478f00-98.jpg",
    "platform": "PC",
    "date": "July 9, 2020",
    "description": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.",
    "score": "88"
  },
  {
    "id": "8f896fa5-837f-48c7-85be-8e9e8b691366",
    "title": "Halo: The Master Chief Collection - Halo 3",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/3/ff3651444ad8e1758d365dad8ed306d3-98.jpg",
    "platform": "PC",
    "date": "July 14, 2020",
    "description": "Halo 3 is the third game in the Halo Trilogy and provides the thrilling conclusion to the events begun in \"Halo: Combat Evolved.\" Halo 3 will pick up where \"Halo 2\" left off. The Master Chief is returning to Earth to finish the fight. The Covenant occupation of Earth has uncovered a massive and ancient object beneath the African sands - an object who's secrets have yet to be revealed. Earth's forces are battered and beaten. The Master Chief's AI companion Cortana is still trapped in the clutches of the Gravemind - a horrifying Flood intelligence, and a civil war is raging in the heart of the Covenant. This is how the world ends...",
    "score": "88"
  },
  {
    "id": "d60e6171-89be-4ceb-b68c-17ba497c67b5",
    "title": "DOOM Eternal",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/7/69971550f3485629bc00981fd50465ca-98.jpg",
    "platform": "PC",
    "date": "March 20, 2020",
    "description": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]",
    "score": "88"
  },
  {
    "id": "ced44bdb-8907-47b0-8ecb-0668626be7a5",
    "title": "Monster Hunter: World - Iceborne",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/2/ea4380a9dcf9d5d6b2c185c575bf0adc-98.jpg",
    "platform": "PC",
    "date": "January 9, 2020",
    "description": "Monster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivals the gameplay volume from the original release and features a new icy setting, storyline, monsters, gameplay options, and more.\n\nThe game's all-new story picks up after Monster Hunter: World and whisks hunters away to the newly discovered chilly locale that, once fully explored, becomes the largest region in World so far. The new locale is home to several new and returning monsters ready to challenge hunters throughout their expeditions and raises the stakes with the added higher difficulty Master Rank. Iceborne continues the skill-based progression and robust crafting system found in World and expands that with several new gameplay features that broaden the player's combat repertoire. All this leads to the ultimate hunter test against the mysterious new flagship monster, Velkhana.",
    "score": "87"
  },
  {
    "id": "18d37a5b-582c-40c5-a6df-bf4c71022c52",
    "title": "Death Stranding",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/5/f7c26bdfac0a09e02863c0d3a9e34df7-98.jpg",
    "platform": "PC",
    "date": "July 14, 2020",
    "description": "Besieged by death's tide at every turn. Sam Bridges must brave a world utterly transformed by the Death Stranding. Carrying the stranded remnants of the future in his hands, Sam embarks on a journey to reunite the shattered world one step at a time. What is the mystery of the Death Stranding? What will Sam discover on the road ahead? A genre defining gameplay experience holds these answers and more.",
    "score": "87"
  },
  {
    "id": "5ce4aafa-c91f-4659-875d-f2206123d474",
    "title": "Legends of Runeterra",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/4/835a0ce6263f44bd8f12f23c661c64b0-98.jpg",
    "platform": "PC",
    "date": "April 29, 2020",
    "description": "Face off in dynamic, alternating combat full of opportunities to adapt and outplay. Make your move, but be ready to react, because your opponent has a plan of their own. It all comes down to this—can you outwit them and win?",
    "score": "87"
  },
  {
    "id": "c869d680-8277-4750-8869-91a0970d7bc9",
    "title": "Persona 4 Golden",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/4/5ceddf3a476d417f4e2aac5e7aa1b4da-98.jpg",
    "platform": "PC",
    "date": "June 13, 2020",
    "description": "Inaba—a quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden. A coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one’s self. Persona 4 Golden promises meaningful bonds and experiences shared together with friends. With an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.",
    "score": "87"
  },
  {
    "id": "fd69b567-cddc-4f0b-8d34-08c3270e1401",
    "title": "Tony Hawk's Pro Skater 1 + 2",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/2/95320ec34e27307699d952ddcb2f0ea1-98.jpg",
    "platform": "PC",
    "date": "September 4, 2020",
    "description": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.",
    "score": "87"
  },
  {
    "id": "d2915a12-3497-4769-a0c4-803c1192dd4b",
    "title": "Panzer Corps 2",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/0/1988ef6fcd10c3f0d1b806625f3a288e-98.jpg",
    "platform": "PC",
    "date": "March 19, 2020",
    "description": "Panzer Corps 2 is the ultimate Second World War strategy game! Enjoy the time-proven gameplay formula which has been appreciated by millions of players over the years, brought to a whole new level of refinement up to the latest technical standards.",
    "score": "86"
  },
  {
    "id": "550eaa0d-92b5-4a44-9175-3020073d8538",
    "title": "Spiritfarer",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/5/4bbba54d5255a3a87d7bdfc7f269c56a-98.jpg",
    "platform": "PC",
    "date": "August 18, 2020",
    "description": "A cozy management game about dying.  What will you leave behind?\nPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \n\nA unique, endlessly varied adventure!\nFarm, mine, fish, harvest, cook, and craft your way across mystical seas. Unwind for hours into cozy and relaxing gameplay. Join the adventure as Daffodil the cat, in two-player cooperative play.\n\nLearn how to say goodbye.\nExperience moving, emotional stories filled with unforgettable moments. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?",
    "score": "86"
  },
  {
    "id": "6363d8a5-6be7-4aa9-8d5d-e322495c6fc1",
    "title": "Desperados III",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/2/0bae8084d91279c1af753ce3b914717c-98.jpg",
    "platform": "PC",
    "date": "June 16, 2020",
    "description": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.\n\nYou take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.\n\nCombine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.",
    "score": "86"
  },
  {
    "id": "45f80095-d235-4085-83b4-8a205b55a87f",
    "title": "Wasteland 3",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/4/9c0a717da60a61d575adca6eed1803b0-98.jpg",
    "platform": "PC",
    "date": "August 28, 2020",
    "description": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies.",
    "score": "86"
  },
  {
    "id": "9df9192c-2058-4c6c-9064-f5a2755495ae",
    "title": "Huntdown",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/0/34a90a6774e6587849e61f1b6ea6a3b9-98.jpg",
    "platform": "PC",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "86"
  },
  {
    "id": "cf024c26-9a93-44de-8945-d58bfbd194cf",
    "title": "Risk of Rain 2",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/8/21881a02c21e07ae01ed0db045e2c0d8-98.jpg",
    "platform": "PC",
    "date": "August 11, 2020",
    "description": "The classic multiplayer roguelike, Risk of Rain, returns with an extra dimension and more challenging action. Play solo, or team up with up to three friends to fight your way through hordes of monsters, unlock new loot, and find a way to escape the planet.",
    "score": "85"
  },
  {
    "id": "84197b2c-5089-4747-8f13-717944a2e528",
    "title": "Monster Train",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/3/33a531bc057f7d6073bdf7bd4b39c908-98.jpg",
    "platform": "PC",
    "date": "May 21, 2020",
    "description": "Monster Train is a strategic roguelike deck building game with a twist. Set on a train to hell, you’ll use tactical decision making to defend multiple vertical battlegrounds. With real time competitive multiplayer and endless replayability, Monster Train is always on time.",
    "score": "85"
  },
  {
    "id": "b7bb0311-e176-4f81-9d67-a98e9a1b49fb",
    "title": "Deep Rock Galactic",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/9/2ab67a04814817434fc8d88f979c2719-98.jpg",
    "platform": "PC",
    "date": "May 13, 2020",
    "description": "Deep Rock Galactic is a 1-4 player co-op FPS featuring badass space Dwarves, 100% destructible environments, procedurally-generated caves, and endless hordes of alien monsters.",
    "score": "85"
  },
  {
    "id": "7139892a-30f7-4591-9121-7989a750edf4",
    "title": "If Found...",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/1/6f2336c176a97ff57fbf4b65d4dae295-98.jpg",
    "platform": "PC",
    "date": "May 19, 2020",
    "description": "If Found... is an interactive visual novel about going home, coming out and erasing everything.",
    "score": "84"
  },
  {
    "id": "9dbea6b0-d321-402d-bead-5e8ad7bf901c",
    "title": "Horizon Zero Dawn: Complete Edition",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/8/5410c3d455b9c0341ef7a3023f0e29e4-98.jpg",
    "platform": "PC",
    "date": "August 7, 2020",
    "description": "Experience Aloy’s legendary quest to unravel the mysteries of a future Earth ruled by Machines. An outcast from her tribe, the young hunter fights to uncover her past, discover her destiny… and stop a catastrophic threat to the future. Use devastating tactical attacks against your prey and explore a majestic open world in this action RPG.",
    "score": "84"
  },
  {
    "id": "9badcf1e-ef69-4828-832b-90674b627b77",
    "title": "Streets of Rage 4",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/0/a37807579dbc6e3f4d3b759a57ca4577-98.jpg",
    "platform": "PC",
    "date": "April 30, 2020",
    "description": "Publisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves and bandanas. \n\nStreets of Rage, known as Bare Knuckle (Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\n\nFamously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\n\nFeaturing hand-drawn visuals from the team behind 2017's gorgeous Wonder Boy: The Dragon's Trap remake, Streets of Rage 4 builds upon the classic trilogy's gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\n\nWhether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping. \n\nFeatures:\n\n* The comeback of the legendary Streets of Rage series.\n* Beautiful graphics fully hand-drawn animated by the studio behind Wonder Boy: The Dragon's Trap.\n* Classic gameplay enhanced with brand new mechanics.\n* Soundtrack by a wide line-up of world-class musicians.\n* Braised chicken served on a pristine plate.",
    "score": "84"
  },
  {
    "id": "efcd30a5-90c3-4005-85b5-2887c1a517dc",
    "title": "Lair of the Clockwork God",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/5/17ab89cfb05dcf9589380be3eac3a52e-98.jpg",
    "platform": "PC",
    "date": "February 21, 2020",
    "description": "A fast-paced Point-and-Click adventure AND an indie platfomer in one! Join adventurer Ben and wannabe indie darling Dan in a race against time to stop all the Apocalypses happening at the same time.",
    "score": "84"
  },
  {
    "id": "93b351a0-39ef-48ed-a1c6-5368aa1c1924",
    "title": "Command & Conquer Remastered Collection",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/3/a228feb6fdfb5971088a8f11bd8eb4bb-98.jpg",
    "platform": "PC",
    "date": "June 5, 2020",
    "description": "Command & Conquer and Red Alert are both remastered in 4K by the former Westwood Studios team members. Includes all 3 expansions, rebuilt multiplayer, a modernized UI, Map Editor, bonus footage gallery, and over 7 hours of remastered music.",
    "score": "83"
  },
  {
    "id": "49a46360-e3dc-4a20-8aaa-ebf6be597ee1",
    "title": "One Step From Eden",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/2/dcb8bfaabf3ca67664135447f89c6e28-98.jpg",
    "platform": "PC",
    "date": "March 26, 2020",
    "description": "Build a powerful deck, cast spells on the fly, battle evolving enemies, find game-changing artifacts, make friends or make enemies, just make it to Eden.",
    "score": "83"
  },
  {
    "id": "0ef8211a-96c5-4200-b213-9d43676f7f8c",
    "title": "Necrobarista",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/3/8e81e82d9aa1909018469897e086795f-98.jpg",
    "platform": "PC",
    "date": "July 22, 2020",
    "description": "In a back-alley cafe, the dead are granted one last night to mingle with the living. Necrobarista follows a dynamic and diverse cast of characters as they navigate Melbourne's hipstery coffee culture, the questionable ethics of necromancy, and the process of letting go.",
    "score": "82"
  },
  {
    "id": "6b46800c-a6e6-49a9-be7f-61c5cb5054ea",
    "title": "The Sims 4: Eco Lifestyle",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/3/18b139925a740f950965b1fb7981ce8d-98.jpg",
    "platform": "PC",
    "date": "June 5, 2020",
    "description": "Ready for your Sims to impact their world? Move into a community of fellow collaborative makers in The Sims 4 Eco Lifestyle Expansion Pack!* Play to change and make a difference in the new world of Evergreen Harbor. Help your new neighbors decide on a Community Space Project, reduce your eco footprint, and watch your neighborhood transform. You’ll be surprised by what happens when your Sims start making the rules. [EA]",
    "score": "82"
  },
  {
    "id": "9bab0e97-bb8c-41dd-b459-4ab96f4d2ac8",
    "title": "SnowRunner",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/5/2d3ea2d18f02be8efb3149bcc281caa6-98.jpg",
    "platform": "PC",
    "date": "April 28, 2020",
    "description": "SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.\nOvercome mud, torrential waters, snow, and frozen lakes while taking on perilous contracts and missions. Expand and customize your fleet with many upgrades and accessories including an exhaust snorkel for heavy waters or chain tires to battle the snow.",
    "score": "81"
  },
  {
    "id": "95592345-f692-4ed3-819e-aa79bb9cfa25",
    "title": "Remnant: From the Ashes - Swamps of Corsus",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/6/cffd60220eaa0fd0aebe401f9efdc57b-98.jpg",
    "platform": "PC",
    "date": "April 28, 2020",
    "description": "Remnant: From the Ashes – Swamps of Corsus requires ownership of Remnant: From the Ashes to play. Begin your journey across the dangerous and corrupted worlds of Remnant: From the Ashes with a new mode and expanded map content in the Swamps of Corsus DLC. New Mode - Survival. Fight for your life in this new rogue-like game mode! Start off your adventure with nothing but a pistol, some scrap and the skin on your back. Travel randomly through corrupted World Stones to different biomes, scrap-up gear, fight insanely-difficult bosses and test your endurance on how long you can resist The Root’s influence. The Iskal Rise. The swamps of Corsus swarm with new content! Discover a new zone in Adventure Mode, fight new bosses, experience new stories, participate in new events, find new quests, and more. Lock & Load. Pick up new items, new armor and skins, new weapons, new mods and new traits. Armor Skins. By defeating bosses in Survival Mode, or the Hard and Nightmare difficulties in Campaign and Adventure Mode, earn Glowing Shards which you can use to purchase alternate armor skins for every piece of armor available in the game.",
    "score": "81"
  },
  {
    "id": "f4136b1c-4543-4fc0-9cdd-3eb275103e48",
    "title": "The Pedestrian",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/1/df5d375d16f8f4e6fc0526dc904aa7eb-98.jpg",
    "platform": "PC",
    "date": "January 29, 2020",
    "description": "I can see the signs in my sleep now, always guiding me closer. Will this really work? Have we almost achieved the impossible?",
    "score": "81"
  },
  {
    "id": "d69c595b-7bca-4614-874c-badf503a627f",
    "title": "Filament",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/2/73942bcb2902b4d4455480113069930d-98.jpg",
    "platform": "PC",
    "date": "April 23, 2020",
    "description": "An abandoned spaceship, missing crew and a lone mysterious voice. Solve challenging puzzles and uncover what really happened to the crew of The Alabaster.",
    "score": "81"
  },
  {
    "id": "fb776caf-aa4c-4fc3-9d1e-58a999686b05",
    "title": "The Walking Dead: Saints & Sinners",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/3/71ce02c95f178078928944646c2aa7f9-98.jpg",
    "platform": "PC",
    "date": "January 23, 2020",
    "description": "Saints & Sinners is a game unlike any other in The Walking Dead universe. Every challenge you face and decision you make is driven by YOU. Fight the undead, scavenge through the flooded ruins of New Orleans, and face gut-wrenching choices for you and the other survivors. Live The Walking Dead.",
    "score": "81"
  },
  {
    "id": "8728b842-3066-44c9-b2ca-8fed62a413e6",
    "title": "Creaks",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/9/14b622f282f8d5d8373c5b75e5cb1538-98.jpg",
    "platform": "PC",
    "date": "July 22, 2020",
    "description": "Just a few minutes into Creaks, you will bump into some strange barking creatures in the mansion’s dark corridors. But are they as dangerous as they seem? Try to get them trapped under a beam of light and take a closer look. You may find out that what felt dangerous is a simple night table. Turning these creatures into ordinary objects is the key gameplay mechanic, along with pulling levers, stepping on pressure plates, and manipulating the environment to outsmart your enemies. [Radim Jurda]",
    "score": "81"
  },
  {
    "id": "6adf12b9-6321-4dd1-a4ad-c10d11adb5d0",
    "title": "Gears Tactics",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/7/b792fbce5a2ebb159ed69f442cd96102-98.jpg",
    "platform": "PC",
    "date": "April 28, 2020",
    "description": "Gears Tactics is the fast-paced, turn-based strategy game from one of the most-acclaimed video game franchises – Gears of War. Outnumbered and fighting for survival, recruit and command your squad to hunt down an evil mastermind who makes monsters.",
    "score": "80"
  },
  {
    "id": "b743b7e3-ea12-466f-aa75-8ab3069d4c0b",
    "title": "Bloodstained: Curse of the Moon 2",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/8/26c5879ab904a7a37a5034dfbfa71b4e-98.jpg",
    "platform": "PC",
    "date": "July 10, 2020",
    "description": "Koji Igarashi and Inti Creates are back with more retro sword-and-whip action!\n\nCurse of the Moon 2 brings classic 2D action and a dark, 8-Bit aesthetic together with modern playability. The multi-scenario structure of the previous title returns with an epic new story supervised by IGA (Koji Igarashi) himself. \n\nPlayers take control of Zangetsu, a swordsman from the far east who bears a deep grudge against demonkind and the alchemists who summoned them. Zangetsu must battle his way to the demonic stronghold, but he doesn't have to do it alone! Zangetsu can ally himself with a brand new cast of characters he meets along the way and add them to the playable roster. Each new character adds a variety of gameplay options, abilities, and ways to complete the game's many stages. \n\nGame Flow\nBattle through stages filled with fearsome enemies and dangerous traps, each with a massive boss waiting at the end. A chance encounter with a potential ally awaits you after defeating a boss. Will they serve as a trustworthy partner on your perilous journey?\n\nIncrease Combat Abilities\nYou can instantaneously switch between allies you have recruited at any time! Allies have their own life bars, so with each ally you recruit, you're survivability is greatly increased! \n\nShortcuts that Only Allies Can Access\nAllies have special, unique abilities which allow them to use shortcuts to skip parts of stages or access new areas! There are no special items obtainable by taking the long way around, so take every shortcut you can find! If your allies are out of commission, you'll have to take longer routes, where stronger enemies await! When your life gets low, be sure to switch then out so they'll be available when you need them.\n\nMultiple Episodes\nThe story is told over the course of multiple episodes. Only the first episode is accessible at the beginning, but more episodes will unlock as you progress through the game. The events that unfold in each episode continue into the next one, so be sure to unlock all the episodes to see the true ending. \n\nCurse of the Moon 2 had two play styles, \"Veteran\" and \"Casual\". \n\nVeteran Style\nChoose \"Veteran\" style to experiment a difficulty reminiscent of older games. An enemy's sttack knocks the player to their death...something very familiar to retro game fans. \n\nCasual Style\nEven if you're a fan of challenging games, sometimes you just want to take it easy! Casual mode is perfect for times like that. On Casual Style, things are more forgiving. Attacks don't knock the player back and lives are unlimited, alongside other changes. \n\nChanging Style\nStyle can be changed when starting a game, loading a save file, or on the Game Over screen.",
    "score": "80"
  },
  {
    "id": "fc09bbb2-ea3d-487f-854e-f9e21272362c",
    "title": "Valorant",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/6/d63ed3eecb12789c02659ff0b5473a08-98.jpg",
    "platform": "PC",
    "date": "June 2, 2020",
    "description": "A 5v5 character-based tactical shooter. Imagine this: tactical shooter meets hypernatural powers. Everyone’s got guns and a unique set of abilities, so how do you beat someone with the speed of wind? Use your own moves to outplay them and beat them to the shot. VALORANT is a game for bold strategists who dare to make the unexpected play, because if it wins, it works.",
    "score": "80"
  },
  {
    "id": "9baf8f89-faa8-4853-b545-52fbac59c289",
    "title": "Shantae and the Seven Sirens",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/7/97b264fd728df7409cd03366bf048813-98.jpg",
    "platform": "PC",
    "date": "May 28, 2020",
    "description": "New locations, abilities, and friends await in Shantae's biggest adventure yet!\n\nShantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble in paradise. As Shantae gets caught up in the island's sinister secrets, she'll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she'll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae's powers to suit their own style of play. \n\nKey Features:\n\n* Explore an interconnected world using new Fusion Magic creature transformations, including a newt and other aquatic forms!\n* 4K-resolution hand-painted visuals (on 4K devices only)!\n* All-new characters and returning favorites like Rottytops, Sky, Bolo, and the nefarious Risky Boots!\n* Collect and power up with monster cards!\n* Enjoy minigames, acquire magic and items, and uncover secrets!\n* Gorgeously animated TV-style cutscenes!",
    "score": "80"
  },
  {
    "id": "093bd7e7-7569-4b27-a3a3-50af5c09503d",
    "title": "Fall Guys: Ultimate Knockout",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/0/e31571831b5c48a1db068e17e654889a-98.jpg",
    "platform": "PC",
    "date": "August 4, 2020",
    "description": "Fall Guys is a massively multiplayer party game with up to 60 players online in a free-for-all struggle through round after round of escalating chaos until one victor remains.",
    "score": "80"
  },
  {
    "id": "4f2f5927-cb87-48cb-9efc-70d038defa25",
    "title": "Call of Duty: Warzone",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/2/fd1e5f3e7b8339c50d39ec8c62823dd0-98.jpg",
    "platform": "PC",
    "date": "March 10, 2020",
    "description": "Welcome to Warzone – a new combat experience where up to 150 players take the role of a veteran Tier 1 Operator and drop in to the dense and sprawling world of Verdansk. Warzone is  packed with non-stop action that’s free-to-play and free-for-everyone. You do not need to own the full version of Call of Duty: Modern Warfare to download, play and enjoy Warzone. In Battle Royale, fight to be the last squad standing while escaping the deadly gas in the swiftly closing circle with up to 150 players. In Plunder, the race is on to collect the most in-match Cash by looting across the map, taking down enemies to steal their Cash, and completing in-match Contracts. Warzone takes place in Verdansk, an expansive city with multiple named zones and well over 300 points of interest. Each zone features distinct landmarks like the Gorengard Lumber Yard or the Gora Dam; the zones take place across different environment types like cities and rural areas for unique engagements. Change up your drop location in each match to get a better lay of the land and take advantage of what Verdansk has to offer. If you need to get somewhere fast in Warzone, the best method is a vehicle. There are five vehicles all with varying levels of protection, speed, seating, and off-roading capability. Each vehicle has a health meter and when it reaches zero, the vehicle explodes and flames out. Needlessly to say, if the health of your vehicle is depleting, bail out before the impending explosion. [Activision]",
    "score": "80"
  },
  {
    "id": "c7ef9ddc-d8c0-4db3-be20-c932c18ca38c",
    "title": "Total War: Three Kingdoms - Mandate of Heaven",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "platform": "PC",
    "date": "January 16, 2020",
    "description": "The Total War: THREE KINGDOMS – Mandate of Heaven Chapter Pack depicts the events of the Yellow Turban Rebellion, enabling players to engage in the conflict from either rebel or loyalist perspectives. Introducing a number of new characters and playable faction leaders, the campaign begins in 182CE, but players can choose to continue well into the Three Kingdoms period, with familiar characters entering the campaign as the timeline progresses.",
    "score": "80"
  },
  {
    "id": "278deb8b-041d-45ec-a688-2afa5682ee8d",
    "title": "Total War: Three Kingdoms - A World Betrayed",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/6/1974339d45cc10424114a4637b11b993-98.jpg",
    "platform": "PC",
    "date": "March 19, 2020",
    "description": "A World Betrayed portrays a seminal moment in the history of the Three Kingdoms. Many of the iconic warlords of Total War: THREE KINGDOMS have now passed on, a catalyst that has spurred a new generation of warlords into making a play for their own dynasties.",
    "score": "80"
  },
  {
    "id": "d04eaedb-172c-4cef-ae77-dd91e3c88cdd",
    "title": "Pirates Outlaws",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/6/511c9cef19a06cac7a853e802eee6a23-98.jpg",
    "platform": "PC",
    "date": "April 13, 2020",
    "description": "Pirates Outlaws is an easy-to-play roguelike card game. Build your deck and combos to become a reputed pirate.",
    "score": "79"
  },
  {
    "id": "2c53407c-4341-4ce9-b207-33687bd7320e",
    "title": "Fury Unleashed",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/4/22af646dbecc389b821769461f7d0293-98.jpg",
    "platform": "PC",
    "date": "May 8, 2020",
    "description": "Fury Unleashed is a combo-driven roguelite action platformer - each kill you score increases your combo. Hit certain thresholds and your damage resistance and healing powers will kick in! It's a game you can even beat in one, ultimate combo. Are you up for the task?",
    "score": "79"
  },
  {
    "id": "fe9886e5-a0c2-43ed-80a2-0d13067076fd",
    "title": "Frostpunk: The Last Autumn",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/9/ddd394ab9eb312ee745a862259734959-98.jpg",
    "platform": "PC",
    "date": "January 21, 2020",
    "description": "Learn about the tragic turn of events that lead to the grim world of Frostpunk in the prequel expansion, The Last Autumn. Vastly expanding upon the Frostpunk universe by introducing a brand new scenario, the expansion content also introduces game-changing new mechanics, unique architecture, and broaden's the game's deep lore and narrative.",
    "score": "79"
  },
  {
    "id": "59ad3dce-b713-4edb-af5f-415888905545",
    "title": "Tom Clancy's The Division 2: Warlords of New York",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/7/b6b27ddd0b2161072c22ce37c446af81-98.jpg",
    "platform": "PC",
    "date": "March 3, 2020",
    "description": "While The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and used them to conquer Lower Manhattan. With other rogue Agents and a lethal new viral strain at his command, Keener is poised to eradicate what little has been rebuilt since the catastrophic Black Friday pandemic. The battle to restore order continues, but now The Division has a new mission: Stop Keener at any cost.",
    "score": "79"
  },
  {
    "id": "e43a35b6-22af-472d-a5b0-d5cdf48b8bf0",
    "title": "Moving Out",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/3/523ac2c0562ee56b03ee6437e16a4679-98.jpg",
    "platform": "PC",
    "date": "April 28, 2020",
    "description": "Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!\n\nAre you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there's no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!",
    "score": "79"
  },
  {
    "id": "598012c3-6703-4db8-bc39-b8c4afa8a9d3",
    "title": "Tell Me Why",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/2/5a2ef49454458e89270f141acf085155-98.jpg",
    "platform": "PC",
    "date": "August 27, 2020",
    "description": "Tell Me Why is the latest narrative adventure game from DONTNOD Entertainment, the studio behind the beloved franchise, Life Is Strange. In this intimate thriller, twins Tyler and Alyson Ronan use their special bond to unravel mysteries of their loving but troubled childhood. Set in beautiful small-town Alaska, Tell Me Why features true-to-life characters, mature themes and gripping choices.",
    "score": "78"
  },
  {
    "id": "786762cc-e74d-482a-83e7-b1f3a350095a",
    "title": "SUPERHOT: MIND CONTROL DELETE",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/5/23e51676085555ae600eecf99806b79d-98.jpg",
    "platform": "PC",
    "date": "July 16, 2020",
    "description": "ONE OF US. ONE OF US. Still outnumbered, still outgunned. Enemies swirl around you in a storm of slow motion violence. Battle after battle, each fallen foe pushes you closer to the secrets hiding in the game and each secret gives you more powers to fight the System’s unending opposition.",
    "score": "78"
  },
  {
    "id": "a8a8f8b2-8b96-4cd3-a3f2-df28d0909c74",
    "title": "Murder by Numbers",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/8/91014ee1837797f7d41ed6b8d012d4e3-98.jpg",
    "platform": "PC",
    "date": "March 6, 2020",
    "description": "Solve Pixel Puzzles to find clues. Use those clues to interrogate witnesses. Work your way to the truth... ...and uncover the mystery of Murder by Numbers.",
    "score": "78"
  },
  {
    "id": "c7cf95f0-b3d3-4002-ae26-64595458cf14",
    "title": "The Room VR: A Dark Matter",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/9/00ec53022878fcc8383b38fa7569e1fd-98.jpg",
    "platform": "PC",
    "date": "March 26, 2020",
    "description": "The British Institute of Archaeology, London, 1908: The disappearance of an esteemed Egyptologist prompts a Police investigation into the unknown. Explore cryptic locations, examine fantastic gadgets and uncover an otherworldly discovery which blurs the line between reality and illusion. Designed from the ground up for the unique capabilities of virtual reality, players can inhabit the spine-tingling world of The Room and interact with its strange contraptions in this compelling new chapter.",
    "score": "78"
  },
  {
    "id": "68f183db-010d-44b7-9cc9-7e909a0ff8c8",
    "title": "The Procession to Calvary",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/6/b27f1d7e5caefda6f42edc8f0df3b0ab-98.jpg",
    "platform": "PC",
    "date": "April 9, 2020",
    "description": "Pilfer from pirates, conspire with cardinals and perform miracles with an incompetent magician. The Procession to Calvary is a Pythonesque adventure game made from Renaissance paintings, and a spiritual successor to the critically acclaimed Four Last Things.",
    "score": "78"
  },
  {
    "id": "84add859-a051-47a4-882e-fcd10f0fa77b",
    "title": "Othercide",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/3/d6a7647c97467748604f0994f03f08da-98.jpg",
    "platform": "PC",
    "date": "July 27, 2020",
    "description": "Othercide is a horror-themed turn-based strategy game where the lore and game mechanics are tightly intertwined to deliver a twisted, dark and challenging experience. Enter a brutal world under assault from terrifying creatures from another dimension, hold back the tide with limited resources and endure brutal conditions in visually stunning world.\n\nExperience dynamic turn-based combat and a new way to anticipate enemy movements to perform a flawless tactical plan. Using the Initiative Sequence System and unique set of skills, you will be able to interrupt an enemy attack, plan a delayed action that will be triggered later on in the timeline and use reaction skill to respond to any threat.\n\nPrepare to suffer and face close calls in our terrifying and ruthless universe. With roguelite features, deadly missions, limited resources and permanent death, there is no room for errors.\n\nLevel up, unlock new skills and collect memories from the death of your enemies. A limited number of these bonuses can be implemented to your skills to boost their stats. But choose wisely as once implemented, you can't take them back, unless... you decide to sacrifice your Daughter!\n\nMake dramatic choices and endure with your Daughters traumatic experiences which will make them stronger or weaker.\n\nOthercide invites you in a ethereal monochromatic dimension with only dashes of crimson red where your worst nightmares come to life.",
    "score": "78"
  },
  {
    "id": "50a906a4-1d0f-4daa-8389-0abafaccb197",
    "title": "KUNAI",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/1/b09c71c5eb5a05a9196b715bcca6735c-98.jpg",
    "platform": "PC",
    "date": "February 6, 2020",
    "description": "A traumatic event has shaken the balance of the world. Human life has been almost wiped out by the evil A.I. Lemonkus. Robots roam free across the earth. You take control of Tabby, a killer robot infused with the soul of an ancient warrior. A NINJA METROIDVANIA. Start out with nothing, progress and increase in strength by killing enemy robots to unlock abilities, weapons and ninja tricks. Explore a world filled with secrets, hidden passages and mysterious characters. KUNAI is all about movement and agility. Use your ninja mobility to reach places where no normal robot could ever go.",
    "score": "78"
  },
  {
    "id": "bb981459-c2e1-4445-beb6-2a16be535b9b",
    "title": "Wildfire",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/8/3087492e89ea8801a7299abd6edb7765-98.jpg",
    "platform": "PC",
    "date": "May 25, 2020",
    "description": "Master the elements in this stealth game where everything burns. Start fires, freeze water, and move earth itself to outsmart superstitious enemies who fear your power. Rescue captive villagers and reclaim your home by turning the environment against the army sent to hunt you down.",
    "score": "78"
  },
  {
    "id": "e9c4de0e-a2a1-4392-90b6-1cac319ff46c",
    "title": "Remnant: From the Ashes - Subject 2923",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/2/2eb12d2a29bbb6ec40614595f818652b-98.jpg",
    "platform": "PC",
    "date": "August 20, 2020",
    "description": "Remnant: From the Ashes – Subject 2923 requires ownership of Remnant: From the Ashes to play. Subject 2923 does not require ownership of the Swamps of Corsus DLC to play. In a brand-new continuation of the Remnant: From the Ashes story, meet unexpected allies, traverse unfamiliar zones and dimensions, and overcome new threats to save your world. Complete new quests and conquer unique bosses to acquire additional gear, increasing your chances of surviving the rugged wilderness of Earth and beyond, as you aim to put an end to the Root and restore humanity.",
    "score": "78"
  },
  {
    "id": "261ca367-b491-4bdc-8f09-d494badc4dcb",
    "title": "Trials of Mana",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/9/9397cf8920d5a3c42ca4a7b1106f3c33-98.jpg",
    "platform": "PC",
    "date": "April 24, 2020",
    "description": "When the world was shrouded in darkness, the Goddess of Mana drew forth the Sword of Mana to smite the eight Benevodons, monsters of destruction. She sealed the horrors inside the eight Mana Stones, bringing the realm back from the brink. Weakened from rebuilding the world, the Goddess changed herself into a tree and fell into a deep sleep for many years. However, the forces of evil soon sought to free the Benevodons to gain control of the world. They started a terrible war to further their plot and destabilize the kingdoms. Peace was at an end. Mana itself began to disappear from the world and the Mana Tree started to wither...",
    "score": "78"
  },
  {
    "id": "b98c4d9a-289a-43c9-a0a6-31d96e5d8c7b",
    "title": "Iratus: Lord of the Dead",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/3/c8072a82fd6e90d96f5d1901ef993697-98.jpg",
    "platform": "PC",
    "date": "April 23, 2020",
    "description": "Iratus: Lord of the Dead is a dark, challenging turn-based roguelike RPG through which you play as an evil necromancer escaping from your dungeon prison to once again embark on the domination of the world.",
    "score": "78"
  },
  {
    "id": "5bd8c054-4d43-4da1-878d-472e09830bdb",
    "title": "Star Renegades",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/7/206facabc2c198a7130b6de34fdfa157-98.jpg",
    "platform": "PC",
    "date": "September 8, 2020",
    "description": "Star Renegades is a strategy RPG about outsmarting AI-driven adversaries, forging friendships, and toppling galactic empires spanning over multiple generations.",
    "score": "78"
  },
  {
    "id": "43a89758-3b32-425f-9259-ef387b804827",
    "title": "Atomicrops",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/0/f1671d77ba5fc839022e2dd489aaee62-98.jpg",
    "platform": "PC",
    "date": "May 28, 2020",
    "description": "Modern city life got you down? Well you’ve just inherited your late uncle’s farm, time to pack your bags and start fresh in the peaceful countryside. What could possibly go wrong? A nuclear apocalypse, that’s what. Now you’re in a hellscape wasteland defending the last surviving source of sustenance – your crops. And every mutant wants a piece.",
    "score": "78"
  },
  {
    "id": "970a6660-2b5e-4ded-b980-1d07b9d04bc5",
    "title": "Fae Tactics",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/3/8d4aae375996037204c82baa35b73b1f-98.jpg",
    "platform": "PC",
    "date": "July 31, 2020",
    "description": "In Fae Tactics, follow a young magic user named Peony on her journey across a vibrant world full of mystery and danger. Summon allies, cast spells, and befriend a motley crew of characters as you dive into the growing conflicts between man and magical beings known as fae.",
    "score": "77"
  },
  {
    "id": "6f156831-a544-4e40-9abb-cc9ccab6ba75",
    "title": "Signs of the Sojourner",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/6/b6046fdd36e3e80c99ad561aa1beddb6-98.jpg",
    "platform": "PC",
    "date": "May 14, 2020",
    "description": "In this narrative card game about relationships and communication, navigate conversations in a colorful world reminiscent of our own. Learn and grow through the cards you choose to play. Who will you become? What will you leave behind?",
    "score": "77"
  },
  {
    "id": "b80e78a9-4725-45b0-b349-5f2d147b66c4",
    "title": "Bloodroots",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/5/ba55798d14e3bdc194a480317fbde9c7-98.jpg",
    "platform": "PC",
    "date": "February 28, 2020",
    "description": "In Bloodroots, the world is your weapon - improvise and adapt to an ever-changing ballet of ultraviolence, in a bloody revenge quest across the Weird West.",
    "score": "77"
  },
  {
    "id": "361d7c15-19d5-4910-893b-5a892d31891d",
    "title": "XCOM: Chimera Squad",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/7/1fc578fd9d55be8cae4cd524aabe3795-98.jpg",
    "platform": "PC",
    "date": "April 23, 2020",
    "description": "XCOM: Chimera Squad delivers an all-new story and turn-based tactical combat experience in the XCOM universe. After years of alien rule, humanity won the war for Earth. But when the Overlords fled the planet, they left their former soldiers behind. Now, five years after the events of XCOM 2, humans and aliens are working together to forge a civilization of cooperation and coexistence. Welcome to City 31, a model of peace in a post-invasion world. However, not all of Earth's inhabitants support interspecies alliance. Chimera Squad, an elite force of human and alien agents, must work together to destroy the underground threats driving the city toward chaos. Your agents are unique: each of them equipped with special tactical abilities and driven by a different motivation for joining Chimera Squad. Deploy targeted team members to investigate and combat the dangers that pervade the districts of City 31. Lead Chimera Squad through a new experience that innovates on XCOM's turn-based legacy, utilizing strategy, teamwork, and new breach-and-clear gameplay to complete your mission objectives. The future of City 31 depends on you.",
    "score": "77"
  },
  {
    "id": "861ff94c-bf80-4d82-9636-02b0d134870b",
    "title": "A Fold Apart",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/5/18ea8e45698d124ff4a758a8f8d2a120-98.jpg",
    "platform": "PC",
    "date": "April 16, 2020",
    "description": "Lightning Rod Games presents A Fold Apart: an award-winning puzzle game that explores the emotional rollercoaster of a long-distance relationship — in a world of folding paper.\n\nFeaturing:\n- A relatable, true-to-life story of a long-distance relationship.\n- Over fifty handcrafted paper folding puzzles.\n- Beautiful 3D graphics with a tactile, “homemade” paper aesthetic.\n- The ability to choose the couple that best represents you!\n\nAfter career choices force them along separate paths, a Teacher and Architect vow to make their long-distance relationship work at any cost. Experience both sides of their story as the couple navigates the complexities of (mis)communication and the emotional ups and downs that separation brings. By flipping, folding, and unfolding the paper puzzles in their handcrafted worlds, you can help the couple overcome the emotional barriers of their relationship — but will love endure...?",
    "score": "77"
  },
  {
    "id": "e0ee5560-eee5-450c-b4fa-dc256963bf6e",
    "title": "Timelie",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/0/b066c405bfc782100878621accf238e6-98.jpg",
    "platform": "PC",
    "date": "May 20, 2020",
    "description": "Control time like a media player and work with a mysterious cat as you solve puzzles and uncover the secrets of a strange, surreal world. Sneak, solve, and escape…together.",
    "score": "77"
  },
  {
    "id": "7317e4d1-d10f-4614-82bb-5c5a3432f426",
    "title": "Resident Evil 3",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/1/ffbf013dd8ddf6c1b6643cb78c4f8a5a-98.jpg",
    "platform": "PC",
    "date": "April 3, 2020",
    "description": "Fight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that the pharmaceutical company Umbrella and their biological weapon, the T-Virus, are behind the incidentsthough they've lost several members in the process. Jill Valentine and the other surviving S.T.A.R.S. members try to make this truth known, but find that the police department itself is under Umbrella's sway and their reports are rejected out of hand.\n\nHowever, soon reports of a grisly \"cannibal virus\" begin to surface, and vicious dogs begin roaming the streets. With the viral plague spreading through the town and to her very doorstep, Jill is determined to survive.\nHowever, unbeknownst to Jill, an extremely powerful pursuer has already been dispatched to eliminate her.",
    "score": "77"
  },
  {
    "id": "4c4f67a6-5d25-46ac-9e58-d3194fdc8c1b",
    "title": "Mortal Shell",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/3/82cc418c385b4c99ebe7dd77d95192e9-98.jpg",
    "platform": "PC",
    "date": "August 18, 2020",
    "description": "Mortal Shell is a deep action-RPG that tests your sanity and resilience in a shattered world. Your adversaries spare no mercy, with survival demanding superior awareness and precision. Possess lost warriors, discover hidden sanctums, and face formidable foes.",
    "score": "77"
  },
  {
    "id": "0456ac01-d3ac-4a73-a5e9-c4ffa1e73868",
    "title": "Control: The Foundation",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/6/4825290ad0ee27eb7c9b715be7fa5652-98.jpg",
    "platform": "PC",
    "date": "March 26, 2020",
    "description": "The Foundation Expansion includes new story content and side missions as well as new weapons and mods inspired by the Oldest House's mysterious origins. The Astral Plane is colliding with our reality. Jesse Faden, the Director of the Federal Bureau of Control, must travel through the caverns of the Foundation to prevent the Astral Plane from consuming the Oldest House. The missing Head of Operations, Helen Marshall, may hold some answers to the mysteries surrounding this threat...",
    "score": "77"
  },
  {
    "id": "3c83e738-fb17-40b9-acf2-46ac2fdec5df",
    "title": "Borderlands 3: Bounty of Blood",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/5/3151d517364d922676331e61883d42ef-98.jpg",
    "platform": "PC",
    "date": "June 25, 2020",
    "description": "Mount your new weaponized Jetbeast vehicle and keep an eye out for local flora and other environmental features that can give you an edge in combat and expand your explorational pursuits. Traitorweeds that charm enemies and Breezeblooms that boost you into the air are just a couple of examples. Once a long-gone company's testing ground for weaponry and biological experiments, the dusty wastes of Gehenna are now lorded over by genetically modified beasts and their keepers, the vicious Devil Riders gang.  If you're eager to travel to Gehenna and hunt the Devil Riders but not far enough into the Borderlands 3 story to use Sanctuary III, level-boost straight to campaign add-on content when creating a new Vault Hunter so you can head there right away. Enemies and loot on the all-new frontier planet will scale to your Vault Hunter's level, so you'll be suitably challenged and rewarded as you explore the dusty wastes and cut canyons in search of your quarry. As you complete new story and side missions on Gehenna, your actions will have a tangible and lasting impact on the locals' livelihoods and on the town of Vestige itself. Help out the Vestige townsfolks and the Sheriff's bounty won't the only reward you collect. Expect new Legendary items, Vault Hunter Heads, Vehicle Skins, Interactive Room Decorations, and more.",
    "score": "77"
  },
  {
    "id": "22fe94f3-8397-4736-8097-940cbeb26ad6",
    "title": "The Sims 4: Star Wars - Journey to Batuu",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/8/ee64c2dd2d40cfc30c449072f9501262-98.jpg",
    "platform": "PC",
    "date": "September 8, 2020",
    "description": "Your Sims are definitely not at home anymore. From the Millennium Falcon to the bustling cantina and unique attire of Batuu, Sims will be surrounded by the iconic sights and sounds of Star Wars. Socialize with the alien locals to truly understand why Batuu is unlike any other planet. When your Sim returns home, bring back new decor and recipes inspired by your travels, play a game of sabacc, or host a playful lightsaber training session.",
    "score": "76"
  },
  {
    "id": "b4e7a816-6ed4-4bcf-aba0-e3560d266b1a",
    "title": "Panzer Paladin",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/7/c0f6ffcd1b3eaebe15e215e74f7933a2-98.jpg",
    "platform": "PC",
    "date": "July 21, 2020",
    "description": "Hop in the Paladin power armor, seize melee weapons from the demonic invaders and give them a taste of their own medicine.",
    "score": "76"
  },
  {
    "id": "c4fa0f3e-706b-4819-84ee-28fd9474ea61",
    "title": "BEAUTIFUL DESOLATION",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/4/59f9d5aff274c83faf32a8cd6fbcd0dc-98.jpg",
    "platform": "PC",
    "date": "February 26, 2020",
    "description": "BEAUTIFUL DESOLATION is a 2D isometric adventure game set in the distant future. Explore a post-apocalyptic landscape, solve puzzles, meet new friends and make powerful enemies, mediate conflicts and fight for your life as you unravel the secrets of the world around you.",
    "score": "76"
  },
  {
    "id": "681b0814-8d8e-403e-a6a1-8c18e6605838",
    "title": "Samurai Shodown",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/98w-game.jpg",
    "platform": "PC",
    "date": "June 11, 2020",
    "description": "SAMURAI SHODOWN has enjoyed worldwide success as a blade-wielding fighting game series since its first release in 1993. 11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay! Faithfully reproducing the game mechanics and atmosphere that contributed to the success of the series, SAMURAI SHODOWN includes a revolutionary feature that learns from players game actions and patterns in order to create CPU-controlled \"ghost\" characters. With a story set one year before the very first installment, a diverse cast of returning and new characters cross paths in order to fulfill their destinies!\n\n* SAMURAI SHODOWN is faithful to the series' roots by delivering the same tense and exhilarating battles that it has always been known for. \n\n* Using the power of UNREAL® ENGINE 4 the series is able to achieve a level of detail and graphical quality like never before. \n\n* Using revolutionary Deep Learning AI, the game will learn from player tactics and create Ghost characters which players around the globe can share and fight against.",
    "score": "76"
  },
  {
    "id": "fda1a44e-a8b9-4c25-be81-e42c21c6cd4a",
    "title": "Broken Lines",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/3/82626de472b35a817c33f6858fa39e12-98.jpg",
    "platform": "PC",
    "date": "February 25, 2020",
    "description": "Broken Lines is a story-driven tactical RPG set in an alternate-history version of World War II. It’s a game about a group of eight soldiers who crash-land behind enemy lines. It’s up to you to lead them home while fending off the enemy and helping them deal with the horrors of war.",
    "score": "76"
  },
  {
    "id": "48a56500-023a-437a-afd4-eab19ec72169",
    "title": "Journey to the Savage Planet",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/1/f2cdce744420dc3aa79b558da909c22d-98.jpg",
    "platform": "PC",
    "date": "January 28, 2020",
    "description": "In this colorful, co-op adventure game you play as the newest recruit to Kindred Aerospace. Dropped onto an uncharted planet with little equipment, you must determine if this planet is fit for human habitation but perhaps you are not the first to set foot here…",
    "score": "76"
  },
  {
    "id": "33a32e50-686d-4fe0-9d49-fd7fd089b831",
    "title": "A Total War Saga: TROY",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/4/0111ae33f204359d86274662a30d8516-98.jpg",
    "platform": "PC",
    "date": "August 13, 2020",
    "description": "A Total War Saga: TROY is the first in the award-winning strategy series to focus on the Bronze-Age Mediterranean and the legendary twenty-year conflict between the kingdoms of Troy and Mycenaean Greece, known as the Trojan War.",
    "score": "75"
  },
  {
    "id": "114afbe0-2276-4a3d-9ee8-3e7910bcf74a",
    "title": "Roki",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/4/7ea83d0f272c9c6ce81c8e082a350ce7-98.jpg",
    "platform": "PC",
    "date": "July 23, 2020",
    "description": "Röki is an adventure game inspired by Scandinavian folklore - a dark, contemporary fairy tale underpinned by a touching narrative, an alluring art style, ancient puzzles and atmospheric exploration.",
    "score": "75"
  },
  {
    "id": "6104504f-c575-4750-9994-0ce13dcd470d",
    "title": "VirtuaVerse",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/7/ba0a58fdc24f657addd3a17642e1f979-98.jpg",
    "platform": "PC",
    "date": "May 12, 2020",
    "description": "",
    "score": "75"
  },
  {
    "id": "376f886c-0ced-484f-85bc-ae427b3cd980",
    "title": "LUNA The Shadow Dust",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/7/34285fa824e43f3fbdf49043c00a0d15-98.jpg",
    "platform": "PC",
    "date": "February 13, 2020",
    "description": "LUNA The Shadow Dust is a fully hand-animated Point&Click puzzle adventure, brought to life through wordless storytelling, beautiful cinematics and a breathtaking original soundtrack.",
    "score": "75"
  },
  {
    "id": "1ffa0f04-78a8-4903-bd03-c3e09d8ef60f",
    "title": "Yes, Your Grace",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/5/6fb564240f2897500d85e48535f604ef-98.jpg",
    "platform": "PC",
    "date": "March 6, 2020",
    "description": "These are troubling times, Your Grace. The petitioners’ petty matters exceed our limited resources, to say nothing of the war. A careful balance must be struck. Your throne awaits.",
    "score": "75"
  },
  {
    "id": "2ee0ccaf-7ea1-4724-abe9-63650dd088d2",
    "title": "Carrion",
    "rankNumber": "82.",
    "img": "https://static.metacritic.com/images/products/games/0/44081863ec417faf083f9928ac9adc40-98.jpg",
    "platform": "PC",
    "date": "July 23, 2020",
    "description": "In Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities on the path to retribution that include a web-like ranged attack, the ability to bend light to become temporarily invisible, and even possess humans for maximum terror.",
    "score": "75"
  },
  {
    "id": "6cb0ca9a-b70d-421a-a883-ec25ee043330",
    "title": "Trackmania",
    "rankNumber": "83.",
    "img": "https://static.metacritic.com/images/products/games/0/cf4b84f9515e50df89b3aa00487acf21-98.jpg",
    "platform": "PC",
    "date": "July 1, 2020",
    "description": "Free for players to race solo or multiplayer on quarterly renewed official campaigns, including 25 tracks, allowing players to earn medals and record scores in the regional rankings. Players will be able to enjoy other player’s creations on the Arcade Channel, try various editors (tracks, replays and skins) and map review servers. The weekly Nations League is also available for casual competitions. \n\n    Standard Access: In addition to the free content, Standard Access expands the content available with player creations, including the “Track of the Day” selection, and full access to replay, track editors and map review servers. Additionally, players can participate in daily competitions and keep every “Track of the Day” and “Official” campaign track. One year of standard access is available for $9.99.\n\n    Club Access: Including the above, Club Access allows players to join their favorite clubs to access exclusive content and activities such as skin customization, special campaigns, online rooms, training tracks and competitions. They can also create their own club to share their creations and organize events. Players can participate in the Open Grand League, organized by Ubisoft Nadeo, and try to qualify for the Trackmania Grand League. One year of the Club Access is available for $29.99 or three years for $59.99.",
    "score": "75"
  },
  {
    "id": "56f12277-a6c2-4344-9fdc-8ff9f133f311",
    "title": "Neversong",
    "rankNumber": "84.",
    "img": "https://static.metacritic.com/images/products/games/5/626b7525167c39b737edd142b471f834-98.jpg",
    "platform": "PC",
    "date": "May 20, 2020",
    "description": "Once upon a time there was a little boy named Peet who slept peacefully in a coma. When he opened his eyes, he found himself in a nightmare.",
    "score": "75"
  },
  {
    "id": "db91705b-a20a-41bf-ad5c-e0769b70d974",
    "title": "Biped",
    "rankNumber": "85.",
    "img": "https://static.metacritic.com/images/products/games/0/8f56c6238b7b41ff33f092fda15b1b7e-98.jpg",
    "platform": "PC",
    "date": "March 26, 2020",
    "description": "Biped is a coop action adventure game with a strong focus on moment-to-moment collaboration between 2 players.",
    "score": "75"
  },
  {
    "id": "8c245b1f-11b2-4ea6-b4ea-3f997f2e67be",
    "title": "Coffee Talk",
    "rankNumber": "86.",
    "img": "https://static.metacritic.com/images/products/games/3/cd0c1a1761b6f912578484df575d9f9a-98.jpg",
    "platform": "PC",
    "date": "January 29, 2020",
    "description": "Coffee Talk is a coffee brewing and heart-to-heart talking simulator about listening to fantasy-inspired modern peoples’ problems, and helping them by serving up a warm drink or two. Immerse yourself in the stories of alternative-Seattle inhabitants that modern readers will find strongly echo the world around them.",
    "score": "75"
  },
  {
    "id": "454bff31-07a1-45ab-8498-aa4ea8e132bd",
    "title": "Post Void",
    "rankNumber": "87.",
    "img": "https://static.metacritic.com/images/products/games/6/800ca995197d2c5b3155431c1bd801b7-98.jpg",
    "platform": "PC",
    "date": "August 6, 2020",
    "description": "Post Void is a hypnotic scramble of early first-person shooter design that values speed above all else. Keep your head full and reach the end; Kill what you can to see it mend; Get the high score or try again.",
    "score": "74"
  },
  {
    "id": "2d2d468c-d4c2-4a91-9d2a-34ae2617a2bc",
    "title": "Zombie Army 4: Dead War",
    "rankNumber": "88.",
    "img": "https://static.metacritic.com/images/products/games/4/6ec932a61ee40858d08f650ded029729-98.jpg",
    "platform": "PC",
    "date": "February 4, 2020",
    "description": "Hitler’s hordes are back for more in this spine-chilling shooter from the makers of Sniper Elite 4! Abominable occult enemies, epic weapons and a harrowing new campaign for 1-4 players await in 1940s Europe, as you fight to save humankind from undead Armageddon!",
    "score": "74"
  },
  {
    "id": "ec80eb4d-788f-417a-80f0-e82d37a44c73",
    "title": "Phantom: Covert Ops",
    "rankNumber": "89.",
    "img": "https://static.metacritic.com/images/products/games/3/8b6c188fc4d76ca80123f6c96f7870b4-98.jpg",
    "platform": "PC",
    "date": "June 23, 2020",
    "description": "[Requires Oculus Quest] WARFARE HAS EVOLVED. You are a Phantom: an elite covert operative with one night to prevent all-out war. Dispatched into hostile wetlands in your military kayak, utilise weapons and equipment to neutralise the enemy threat. Engage targets lethally or infiltrate unnoticed from the shadows. This is stealth action redefined. DEADLIER ON WATER. Discover innovative VR traversal using your military kayak to freely and stealthily move across the water. BECOME A PHANTOM. Experience the tension and thrill of becoming a lethal military asset – everything is 1:1, delivering a new level of VR immersion.",
    "score": "74"
  },
  {
    "id": "4de41011-f113-4562-b0a1-2014bbb8ce00",
    "title": "Fort Triumph",
    "rankNumber": "90.",
    "img": "https://static.metacritic.com/images/products/games/1/3551103eb7f7abc80830846360d3898c-98.jpg",
    "platform": "PC",
    "date": "April 16, 2020",
    "description": "Fort Triumph is a tactical RPG emphasizing the use of Environmental Interactions to create rich, challenging and rewarding tactical gameplay. In the game, you command a party of chosen heroes who set out to change the world, one quest at a time.",
    "score": "74"
  },
  {
    "id": "47d40e15-e7af-49dd-8aae-bc3b9daaad6b",
    "title": "Darwin Project",
    "rankNumber": "91.",
    "img": "https://static.metacritic.com/images/products/games/5/7e15eb5d086ec4d0282cc22e2de7b38c-98.jpg",
    "platform": "PC",
    "date": "January 13, 2020",
    "description": "In Darwin Project, ten inmates must survive the elements, track each other, fight, craft tools, and use their social skills to be the last one standing. It's a unique take on battle royale with a Show Director to influence the match and Spectator Interactions to create a one-of-a-kind game show.",
    "score": "74"
  },
  {
    "id": "d712b444-c496-4057-b06b-ab3c81717729",
    "title": "In Other Waters",
    "rankNumber": "92.",
    "img": "https://static.metacritic.com/images/products/games/0/24c9982899a886a507e88cd0334dc5ec-98.jpg",
    "platform": "PC",
    "date": "April 3, 2020",
    "description": "Play as an Artificial Intelligence guiding a stranded xenobiologist through a beautiful and mysterious alien ocean. A non-violent sci-fi story, enter a world of wonder, fear and vulnerability, unraveling the history and ecology of an impossible planet. What will you discover together?",
    "score": "74"
  },
  {
    "id": "0996e425-f91a-4a2f-aa2f-832fbb9bcb02",
    "title": "Dungeon Defenders: Awakened",
    "rankNumber": "93.",
    "img": "https://static.metacritic.com/images/products/games/9/02e5e872aac3ce88de2efaa93c2ecfe0-98.jpg",
    "platform": "PC",
    "date": "May 28, 2020",
    "description": "Dungeon Defenders: Awakened is co-op Tower Defense combined with epic Action RPG combat. You’re able to join forces with up to four players to take on a never-ending army of orcs, demons, and dragons! Are your defenses strong enough to save the world of Etheria?",
    "score": "74"
  },
  {
    "id": "370c3f22-6681-49ca-a44f-b7f54dc54e1f",
    "title": "Iron Harvest",
    "rankNumber": "94.",
    "img": "https://static.metacritic.com/images/products/games/8/0d34a589605a38a73b359b3057634f30-98.jpg",
    "platform": "PC",
    "date": "September 1, 2020",
    "description": "Iron Harvest is a real-time strategy game (RTS) set in the alternate reality of 1920+, just after the end of the Great War. The Game lets you control giant dieselpunk mechs, combining epic singleplayer and coop campaigns as well as skirmishes with intense action on the battlefield for multiplayer fans, Iron Harvest is the classic real-time strategy games fans have been waiting for.\n\nTradition clashes with scientific and technological progress, while Europe is still recovering from the brutal battles of the World War. Cities are being rebuilt and in the countryside, the era of the Iron Harvest has begun. Farmers are uncovering the remains of the majestic walking machines that had fought on the battlefields of the Great War.\n\nIn the midst of this chaos, a new threat appears that will put Europe's very existence at risk. Secret forces are putting everything they can towards destabilization of entire countries, determined to set the world on fire once again and finally seize control.",
    "score": "74"
  },
  {
    "id": "cdbf256e-6c27-4f35-a7f6-da3acd4f7eea",
    "title": "Cloudpunk",
    "rankNumber": "95.",
    "img": "https://static.metacritic.com/images/products/games/2/5212f8277acc15be04dab603c3b66045-98.jpg",
    "platform": "PC",
    "date": "April 23, 2020",
    "description": "Your name is Rania. This is your first night working for Cloudpunk, the semi-legal delivery company based in the sprawling city of Nivalis. You go everywhere, from the Marrow below to the spires that pierce the grey clouds high above before scraping the edge of the troposphere. No delivery job is too dangerous, and no one is faster than a Cloudpunk driver. In this story-based exploration game, you will meet a diverse range of characters including androids, AI and unscrupulous humans at every level of society. Everyone has a story, and in the course of one night in Nivalis, everything will change.",
    "score": "73"
  },
  {
    "id": "d8a98c17-1fd5-4428-ac65-f2992ee7c962",
    "title": "Control: AWE",
    "rankNumber": "96.",
    "img": "https://static.metacritic.com/images/products/games/4/a9ed032cb358f0200a14180e22683469-98.jpg",
    "platform": "PC",
    "date": "August 27, 2020",
    "description": "Explore the sealed Investigations Sector, uncover the mystery of Bright Falls, and face a new terror with a new Service Weapon form. \n\nAWE is short for Altered World Event, which occur when paranatural forces breach our world. Sometimes, AWEs are minor and go unnoticed. However, sometimes AWEs cause catastrophic events. Historically, the Investigations Sector was where the Federal Bureau of Control's dangerous work of searching for AWE cases was coordinated from, and where evidence was stored until things went horribly, horribly wrong, and the sector was sealed off years ago.\n\nDirector Jesse Faden has to enter the sector to chase down a mysterious being that's been stalking this long-abandoned area for years. In order to reclaim the Investigations Sector from the clutches of this creature of darkness, Jesse will need to explore the numerous Altered World Events investigated here, including one from the town of Bright Falls.",
    "score": "73"
  },
  {
    "id": "196aa19d-855d-426e-9258-544fe300dc38",
    "title": "Neon Abyss",
    "rankNumber": "97.",
    "img": "https://static.metacritic.com/images/products/games/0/04cc9388cd7a0069cbdeeb456081dd93-98.jpg",
    "platform": "PC",
    "date": "July 14, 2020",
    "description": "Neon Abyss is a frantic, roguelite action-platformer where you run ‘n’ gun your way into the Abyss. Featuring unlimited item synergies and a unique dungeon evolution system, each run diversifies the experience and every choice alters the ruleset.",
    "score": "73"
  },
  {
    "id": "86931ba8-9240-451f-bcaf-4457d702cb45",
    "title": "Relicta",
    "rankNumber": "98.",
    "img": "https://static.metacritic.com/images/products/games/8/7dc682556522c2fa9070df7ff07c4398-98.jpg",
    "platform": "PC",
    "date": "August 3, 2020",
    "description": "Relicta is a first-person puzzle game whose main mechanics combine magnetism and gravity. The player is equipped with a pair of special gloves that allow them to change the magnetic and gravitational properties of experimental cubes scattered around each level. These cubes can be moved by the player, either carrying them bodily or using magnetism or gravity. They can also be placed on teleporting machines to warp them to another teleporter and help solve puzzles. Mechanics really come alive when combined in ingenious ways. For instance, magnetism can be used to repel or attract cubes, but repelling a cube that has previously “anti-gravitated” gives you a frictionless device that will retain inertia until it collides against something solid, like a wall (or your skull). It can even be used as a means of transport for the player to reach new places. Cubes can also be used to power up some devices, in order to operate doors and force fields. As the player progresses towards more complex puzzles, they will encounter other devices - magnetic plates, elevators, buttons or even drones capable of nullifying magnetic and gravitational fields as well as stealing cubes.",
    "score": "73"
  },
  {
    "id": "c4a1fa58-ae7b-4b82-83ee-29d0ce763e1a",
    "title": "Lightmatter",
    "rankNumber": "99.",
    "img": "https://static.metacritic.com/images/products/games/9/cd59fb0d1f9fb05c19b8a025b46cc208-98.jpg",
    "platform": "PC",
    "date": "January 15, 2020",
    "description": "Lightmatter is the atmospheric, first-person puzzle game inside a mysterious experimental facility where the shadows will kill you. Watch your movements closely through the sprawling tunnels and rooms or be swallowed into the vast darkness. The game tells a sci-fi story about a maniac inventor who has created the ultimate power source called Lightmatter. Players must explore the facility in an attempt to discover the hidden plot, while facing challenging puzzles that require mastering different light sources to survive.",
    "score": "73"
  },
  {
    "id": "306667a7-ef44-4dec-a18e-3628712ffbb9",
    "title": "The Elder Scrolls Online: Greymoor",
    "rankNumber": "100.",
    "img": "https://static.metacritic.com/images/products/games/4/8d10c3a99f5ec7c2d308eb446a195a7b-98.jpg",
    "platform": "PC",
    "date": "May 26, 2020",
    "description": "A YEAR-LONG GOTHIC ADVENTURE\nStop a powerful Vampire Lord from enslaving Tamriel in the Dark Heart of Skyrim, a gothic tale of sinister secrets and deadly betrayals. The Elder Scrolls Online: Greymoor is the next stage in the epic story that begins with the Harrowstorm DLC and continues throughout the entire year. \n\nEXPLORE WESTERN SKYRIM\nVenture through an iconic land, almost 1000 years before the events of The Elder Scrolls V: Skyrim. Traverse the frozen tundra and snowy mountains of the Nord homeland and delve into the perilous depths of long-forgotten Blackreach.\n\nAN ANCIENT EVIL\nTerrible monsters, led by a Vampire Lord, rise from the depths of Blackreach, intent on devouring souls to fuel their fiendish plans. As darkness consumes the land, Skyrim needs heroes to restore the light.\n\nDISCOVER TAMRIEL'S HISTORY\nTravel across Tamriel to recover lost artifacts with the new Antiquities System. Scry the location of ancient relics and excavate them to uncover Tamriel's hidden history and become a world-renown Archaeologist! \n\nALL-NEW ADVENTURES\nExplore the land of the Nords and encounter a people as unique and stalwart as Skyrim itself! This all-new zone features a macabre main story, exciting side quests, terrifying world bosses, dangerous delves, and more. \n\nA NEW TRIAL: KYNE'S AEGIS \nDefend the island bastion of Kyne's Aegis in a massive 12-player trial and protect the besieged villagers from invading Sea Giants. Battle hordes of monstrous raiders and three challenging bosses in this new PvE group challenge. \n\nNEW WORLD EVENTS: HARROWSTORMS \nSupernatural Harrowstorms plague Western Skyrim, draining the life energy of anyone caught within and transforming them into ravenous monsters or mindless zombies. Band together and shut down these world events before the very soul of Skyrim is lost. \n\nNEW REWARDS: SKYRIM'S BOUNTY \nEarn, unlock, and loot a massive selection of new and unique rewards found within the snow-swept region of Western Skyrim, including six armor sets, tons of collectables, Achievements, items, and more!",
    "score": "73"
  }
]