[
  {
    "id": "e4d69b8a-8722-49ed-abe7-bdf475453de6",
    "title": "F1 2020",
    "rankNumber": "1.",
    "img": "https://static.metacritic.com/images/products/games/1/c623b8eafe8fe931793e7f004b663b86-98.jpg",
    "platform": "Xbox One",
    "date": "July 10, 2020",
    "description": "For the first time, players can create their own F1® team by creating a driver, then choosing a sponsor, an engine supplier, hiring a teammate and competing as the 11th team on the grid. Build facilities, develop the team over time and drive to the top. Customise your 10-year career mode, with a choice of F2™ Championship introduction options and season lengths to allow for a more exciting, multiple season, career. The addition of split-screen racing, a new steering assist and a more accessible race experience means that you can enjoy the game with friends, no matter what your skill level. F1® 2020 features all the official teams, drivers and 22 circuits, including two new races: Hanoi Circuit and Circuit Zandvoort. Online connection required to download the final teams’ 2020 cars (as applicable) and F2™ 2020 season content.",
    "score": "91"
  },
  {
    "id": "f8f57622-72fe-42ca-b2bd-116da4e72853",
    "title": "Ori and the Will of the Wisps",
    "rankNumber": "2.",
    "img": "https://static.metacritic.com/images/products/games/9/219ace008faa25de2f1fa5c37a0d6486-98.jpg",
    "platform": "Xbox One",
    "date": "March 11, 2020",
    "description": "The little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and the Blind Forest comes the highly anticipated sequel. Embark on an all-new adventure in a vast world filled with new friends and foes that come to life in stunning, hand-painted artwork. Set to a fully orchestrated original score, Ori and the Will of the Wisps continues the Moon Studios tradition of tightly crafted platforming action and deeply emotional storytelling.",
    "score": "90"
  },
  {
    "id": "db54c673-39e2-47cd-aaf5-99ecb64d85ff",
    "title": "Yakuza 0",
    "rankNumber": "3.",
    "img": "https://static.metacritic.com/images/products/games/6/1b26b8df9dcfdf60c6f51c4f8216404d-98.jpg",
    "platform": "Xbox One",
    "date": "February 26, 2020",
    "description": "Tokyo 1988. Getting rich is easy, the women are beautiful, and everyone wants in on the action. It's time to become Yakuza.\n\nThe glitz, glamour, and unbridled decadence of the 80s are back in Yakuza 0!\n \nFight like hell through Tokyo and Osaka with protagonist Kazuma Kiryu and series regular Goro Majima. Play as Kazuma Kiryu and discover how he finds himself in a world of trouble when a simple debt collection goes wrong and his mark winds up murdered. Then, step into the silver-toed shoes of Goro Majima and explore his \"normal\" life as the proprietor of a cabaret club.\n\nSwitch between three different fighting styles instantaneously and beat up all manner of goons, thugs, hoodlums, and lowlifes. Take combat up a notch by using environmental objects such as bicycles, sign posts, and car doors for bone-crunching combos and savage take-downs.\n\nFighting is not the only way to kill time in 1988's Japan: from discos and hostess clubs to classic SEGA arcades, there are tons of distractions to pursue in the richly detailed, neon-lit world.\n\nInteract with the colourful denizens the red light district: help a budding S&M dominatrix learn her profession, or ensure a street performer can make it to the bathroom in time there are 100 incredible stories to discover.",
    "score": "90"
  },
  {
    "id": "79b52949-1230-4f1d-a924-3cd4a00c7f65",
    "title": "DOOM Eternal",
    "rankNumber": "4.",
    "img": "https://static.metacritic.com/images/products/games/5/e2edd6022f418bf951ba01b19458eb65-98.jpg",
    "platform": "Xbox One",
    "date": "March 19, 2020",
    "description": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]",
    "score": "88"
  },
  {
    "id": "0e7ba73b-0844-42b4-b593-1a4a24f07737",
    "title": "Kentucky Route Zero: TV Edition",
    "rankNumber": "5.",
    "img": "https://static.metacritic.com/images/products/games/8/6af7ce78618dba784269787232b74e1c-98.jpg",
    "platform": "Xbox One",
    "date": "January 28, 2020",
    "description": "KENTUCKY ROUTE ZERO is a magical realist adventure game about a secret highway running through the caves beneath Kentucky, and the mysterious folks who travel it. At twilight in Kentucky, as bird songs give way to the choir of frogs and insects, familiar roads become strange, and it's easy to get lost. Those who are already lost may find their way to a secret highway winding through underground caves. The people who live and work along this highway are themselves a little strange at first, but soon seem familiar: the aging driver making the last delivery for a doomed antique shop; the young woman who fixes obsolete TVs surrounded by ghosts; the child and his giant eagle companion; the robot musicians; the invisible power company lurking everywhere, and the threadbare communities who struggle against its grip.",
    "score": "87"
  },
  {
    "id": "06d6725c-fafd-4e2e-9be4-f0dd17bc4ba3",
    "title": "Huntdown",
    "rankNumber": "6.",
    "img": "https://static.metacritic.com/images/products/games/8/83ffaa5681c54e95e7bdd9fcb2bad430-98.jpg",
    "platform": "Xbox One",
    "date": "May 12, 2020",
    "description": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy.",
    "score": "87"
  },
  {
    "id": "b17a1bd9-1846-4564-9903-a478507d8b0a",
    "title": "Tony Hawk's Pro Skater 1 + 2",
    "rankNumber": "7.",
    "img": "https://static.metacritic.com/images/products/games/1/eaaf3c57ebb0d6806ffa77379578738d-98.jpg",
    "platform": "Xbox One",
    "date": "September 4, 2020",
    "description": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.",
    "score": "87"
  },
  {
    "id": "c5b6d3df-1213-4a52-9684-9ebabe2dfb7d",
    "title": "Wasteland 3",
    "rankNumber": "8.",
    "img": "https://static.metacritic.com/images/products/games/6/6004f2faa52881dbc4a97820e271d6a2-98.jpg",
    "platform": "Xbox One",
    "date": "August 28, 2020",
    "description": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies.",
    "score": "85"
  },
  {
    "id": "68b76c41-a350-4b21-b9e7-6230c0181da3",
    "title": "Desperados III",
    "rankNumber": "9.",
    "img": "https://static.metacritic.com/images/products/games/1/4922a8be01dfa37bc4e6a59b43c3ca6d-98.jpg",
    "platform": "Xbox One",
    "date": "June 16, 2020",
    "description": "On his epic journey through 1870s USA and Mexico, John Cooper will have to take responsibility for mistakes that have been made in the past. On his quest for redemption, Cooper joins forces with the runaway bride Kate O'Hara, shady Arthur \"Doc\" McCoy, the giant trapper Hector and a mysterious lady from New Orleans. They make their way from the mountains of Colorado to the heart of Louisiana, then finally to New Mexico, right back into Cooper's past.\n\nYou take control of this ragtag band becoming a highly functional group of unlikely heroes and heroines. The leader of his team is Cooper, drifter and gunslinger, who can kill quietly with a knife or take out multiple foes with his revolvers. Strongman Hector carries a giant beartrap and can slay the toughest opponents with his trusty axe. Cold-blooded bounty hunter McCoy likes to be methodical, using lures, knockout gas, poison syringes and a custom long-range pistol. Kate can fool almost any man with the right outfit and kill discretely with her hidden gun.\n\nCombine your specialists to overcome tough challenges in many different ways. Plan your moves wisely and execute them perfectly in real-time to sneak past your enemies while remaining undetected.",
    "score": "85"
  },
  {
    "id": "1f693da2-2172-4590-9672-5dbd5f42ca9c",
    "title": "Two Point Hospital",
    "rankNumber": "10.",
    "img": "https://static.metacritic.com/images/products/games/0/3427287f82fef1ed3a1dc49666010675-98.jpg",
    "platform": "Xbox One",
    "date": "February 25, 2020",
    "description": "BUILD, CURE and IMPROVE! Design stunning hospitals, decorate them as you like, cure very unusual illnesses and manage troublesome staff as you spread your budding healthcare organization across Two Point County. Design and build your own hospital.",
    "score": "84"
  },
  {
    "id": "ac233aa6-6a22-4a5a-9758-53eb2d890f2a",
    "title": "Resident Evil 3",
    "rankNumber": "11.",
    "img": "https://static.metacritic.com/images/products/games/3/56defb66b1f5ec951c52970c8b44ac2a-98.jpg",
    "platform": "Xbox One",
    "date": "April 3, 2020",
    "description": "Fight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that the pharmaceutical company Umbrella and their biological weapon, the T-Virus, are behind the incidents though they've lost several members in the process. Jill Valentine and the other surviving S.T.A.R.S. members try to make this truth known, but find that the police department itself is under Umbrella's sway and their reports are rejected out of hand.\n\nHowever, soon reports of a grisly \"cannibal virus\" begin to surface, and vicious dogs begin roaming the streets. With the viral plague spreading through the town and to her very doorstep, Jill is determined to survive.\nHowever, unbeknownst to Jill, an extremely powerful pursuer has already been dispatched to eliminate her.",
    "score": "84"
  },
  {
    "id": "bfb959e4-1a6a-4c5a-9d9f-b7814785a348",
    "title": "Bayonetta & Vanquish",
    "rankNumber": "12.",
    "img": "https://static.metacritic.com/images/products/games/2/0ff9aea4ff698bbc0560aaa1172f4922-98.jpg",
    "platform": "Xbox One",
    "date": "February 18, 2020",
    "description": "Celebrate the 10th Anniversary of two PlatinumGames cult classics with the Bayonetta & Vanquish 10th Anniversary Bundle. Bayonetta: Experience the genesis of the Bayonetta series with the cult classic, original action-adventure game. Vanquish: The hit sci-fi shooter returns. An overpopulated Earth suffocating under limited resources looks to Providence, the solar-powered space colony for support.",
    "score": "83"
  },
  {
    "id": "ea62550a-6f01-4d62-aa85-712e4d943017",
    "title": "EA SPORTS UFC 4",
    "rankNumber": "13.",
    "img": "https://static.metacritic.com/images/products/games/2/4f3ca63ee258d03f216eae48000e6068-98.jpg",
    "platform": "Xbox One",
    "date": "August 14, 2020",
    "description": "In EA SPORTS UFC 4 the fighter you become is shaped by your fight style, your achievements, and your personality. Develop and customize your character through a unified progression system across all modes. Go from unknown amateur to UFC superstar in the new Career Mode, experience the origins of combat sports in two all-new environments; The Kumite and The Backyard, or challenge the world in new Blitz Battles or Online World Championships to become the undisputed champ. In gameplay, fluid clinch-to-strike combinations offer more responsive and authentic stand-up gameplay, while overhauled takedown and ground mechanics deliver more control in those key phases of the fight. No matter how, or where, you play EA SPORTS UFC 4 puts 'you' at the center of every fight.",
    "score": "83"
  },
  {
    "id": "3d4ff1d4-5a33-480f-a6a0-3b6a96142d19",
    "title": "Super Mega Baseball 3",
    "rankNumber": "14.",
    "img": "https://static.metacritic.com/images/products/games/3/028cdfdd035ff24e83dade952a5ec4f8-98.jpg",
    "platform": "Xbox One",
    "date": "May 13, 2020",
    "description": "Run up the score in a relaxed slugfest or push the limits of your reflexes in this refined baseball simulator. The third entry in the series features an all-new Franchise mode, major graphical enhancements, and on-field additions including pickoffs and situational player traits.",
    "score": "83"
  },
  {
    "id": "976898f8-d3a1-40f0-8579-144347f11cfe",
    "title": "Streets of Rage 4",
    "rankNumber": "15.",
    "img": "https://static.metacritic.com/images/products/games/4/96a7458cdb603f57aaecdbbaa7eecb44-98.jpg",
    "platform": "Xbox One",
    "date": "April 30, 2020",
    "description": "Publisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves and bandanas. \n\nStreets of Rage, known as Bare Knuckle (Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\n\nFamously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\n\nFeaturing hand-drawn visuals from the team behind 2017's gorgeous Wonder Boy: The Dragon's Trap remake, Streets of Rage 4 builds upon the classic trilogy's gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\n\nWhether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping. \n\nFeatures:\n\n* The comeback of the legendary Streets of Rage series.\n* Beautiful graphics fully hand-drawn animated by the studio behind Wonder Boy: The Dragon's Trap.\n* Classic gameplay enhanced with brand new mechanics.\n* Soundtrack by a wide line-up of world-class musicians.\n* Braised chicken served on a pristine plate.",
    "score": "82"
  },
  {
    "id": "fe439026-8c45-42ef-b5ec-459c56e38e8f",
    "title": "SUPERHOT: MIND CONTROL DELETE",
    "rankNumber": "16.",
    "img": "https://static.metacritic.com/images/products/games/6/37d856f080b73a9d69e8dffdc1982b54-98.jpg",
    "platform": "Xbox One",
    "date": "July 16, 2020",
    "description": "ONE OF US. ONE OF US. Still outnumbered, still outgunned. Enemies swirl around you in a storm of slow motion violence. Battle after battle, each fallen foe pushes you closer to the secrets hiding in the game and each secret gives you more powers to fight the System’s unending opposition.",
    "score": "82"
  },
  {
    "id": "8b1daf3e-54f4-4ef3-95d9-b35641a7b2b5",
    "title": "MotoGP 20",
    "rankNumber": "17.",
    "img": "https://static.metacritic.com/images/products/games/6/56bb315d12195fc9ed352e5171165429-98.jpg",
    "platform": "Xbox One",
    "date": "April 23, 2020",
    "description": "Take control of your own career, switch from real teams to new teams created with sponsors from the world of MotoGP™, decide the development of the bike and manage your technical unit to win. Improved physics, with even more realistic and complex braking management. The tire has been divided into independent sectors for wear and temperature, and the fuel consumption can be managed with driving style and power maps. If you were looking for a challenge, this is definitely the one for you. Being a successful driver is much more than just keeping the throttle wide open. You also need to win with style! Unleash your creativity with 6 different graphic editors, including the new Suit and Livery editor for your bike. [Milestone]",
    "score": "82"
  },
  {
    "id": "ab9986c7-b0bc-4c54-8a1c-4494d83246c7",
    "title": "Tom Clancy's The Division 2: Warlords of New York",
    "rankNumber": "18.",
    "img": "https://static.metacritic.com/images/products/games/8/7dbe518a41ad6f6cd1677148cbff905c-98.jpg",
    "platform": "Xbox One",
    "date": "March 3, 2020",
    "description": "While The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and used them to conquer Lower Manhattan. With other rogue Agents and a lethal new viral strain at his command, Keener is poised to eradicate what little has been rebuilt since the catastrophic Black Friday pandemic. The battle to restore order continues, but now The Division has a new mission: Stop Keener at any cost.",
    "score": "82"
  },
  {
    "id": "5afac196-a6e9-4117-97fb-12d659f6e061",
    "title": "SnowRunner",
    "rankNumber": "19.",
    "img": "https://static.metacritic.com/images/products/games/4/d4ac26357db6cfd1d6fa04f34828b141-98.jpg",
    "platform": "Xbox One",
    "date": "April 28, 2020",
    "description": "SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.\nOvercome mud, torrential waters, snow, and frozen lakes while taking on perilous contracts and missions. Expand and customize your fleet with many upgrades and accessories including an exhaust snorkel for heavy waters or chain tires to battle the snow.",
    "score": "81"
  },
  {
    "id": "fdbdc95a-afd9-4628-92c1-50227b415a1a",
    "title": "Mega Man Zero / ZX Legacy Collection",
    "rankNumber": "20.",
    "img": "https://static.metacritic.com/images/products/games/9/f7cafd292717dd27007709b183e1eca3-98.jpg",
    "platform": "Xbox One",
    "date": "February 25, 2020",
    "description": "Mega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent.\n\nIn addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual Scenario Mode and a Save-Assist feature are available for those who would like to enjoy the story at their own pace. Players can also try their hand at the new leaderboard-based Z Chaser Mode, an exclusive new mode created just for this set of games.",
    "score": "80"
  },
  {
    "id": "040cd7c1-61b0-4a78-a59f-db18eef4aacf",
    "title": "Superliminal",
    "rankNumber": "21.",
    "img": "https://static.metacritic.com/images/products/games/9/78a511d24ef7419527898bba988583ef-98.jpg",
    "platform": "Xbox One",
    "date": "July 7, 2020",
    "description": "Perception is reality. In this mind-bending first-person puzzler, you explore a surreal dream world and solve impossible puzzles using the ambiguity of depth and perspective.",
    "score": "80"
  },
  {
    "id": "965833f6-d36c-43bd-83d7-be4885b04328",
    "title": "Project Warlock",
    "rankNumber": "22.",
    "img": "https://static.metacritic.com/images/products/games/3/7f1d38b79ec6af5ca9180105b1413511-98.jpg",
    "platform": "Xbox One",
    "date": "June 12, 2020",
    "description": "One man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hours of super fun carnage. Let’s rock and roll! Explore 60 vast levels in five settings, from frozen Antarctic base to the sands of Egypt to the medieval castles’ courts and graveyards. Find keys to unlock passages, reveal secret caches with ammo and gold, use lifts and hidden buttons to access new areas. Finally descend to hell to face the ultimate challenge and emerge victorious. Combat tons of enemies from flying demons to five-storeys robots, splashing walls and floors with their blood and chunks. Dodge bullets and projectiles, figure out strategies and weapons that work best against each of the nasty villains. Learn their moves and stay one step ahead to survive through the levels. Face megabosses in vast final arenas to complete each world. Expand your arsenal with new weapons found along your way. From powerful blades to massive guns, collect and develop your favourite gear and master the craft of carnage. Reach into vast arsenal of 38 types of weapons and learn their secret tricks to deliver maximum damage, fast! Grab ammo and spit out series of bullets, walls of flames, and bursts of magic shots to bring down enemies foolish enough to stand in your way. Develop your hero the way you like, by assigning upgrade points and perks to the favourite skills between each level. Develop and upgrade spells and weapons to create your unique character through the game, and use their powers to master the game in higher difficulty modes.",
    "score": "79"
  },
  {
    "id": "08ba6002-2502-4f3b-8139-ba8ead96e2bd",
    "title": "Mortal Kombat 11: Aftermath",
    "rankNumber": "23.",
    "img": "https://static.metacritic.com/images/products/games/5/8aa41db7a33bc0fee3f0c1252dd88c68-98.jpg",
    "platform": "Xbox One",
    "date": "May 26, 2020",
    "description": "Aftermath features a brand-new cinematic story centered around trust and deceit. Fire God Liu Kang, the new keeper of time and protector of Earthrealm, looks to secure the future he envisions. In order to do so, he is forced to enlist the help of some unlikely allies and familiar foes. Players will have to decide who they can trust and who they must defeat with fate on the line. Forge a new history. \n\nNew Playable Fighters\nSheeva and Fujin triumphantly return, with special guest RoboCop making his debut in Mortal Kombat. Dead or Alive, they're coming with you!\n\nStage Fatalities\nThe Klassic finishing move is back! Use the world as your weapon, and watch as the environment engulfs, eviscerates and destroys your opponents. \n\nFriendships\nYou can dance if you want to. Friendly finishers are back for the entire roster. Kill them with Kindness as the ultimate troll move. \n\nNew Stages\nKronika's Keep and Soul Chamber will be brand-new additions. Aftermath will also bring the klassic Dead Pool stage and RetroKade featuring favorites from MKI-III.",
    "score": "79"
  },
  {
    "id": "150e2a28-595f-4ee7-afc3-2c46bcb9abf5",
    "title": "Tell Me Why",
    "rankNumber": "24.",
    "img": "https://static.metacritic.com/images/products/games/5/f872167d240ad6d912978a09ee0cd0c3-98.jpg",
    "platform": "Xbox One",
    "date": "August 27, 2020",
    "description": "Tell Me Why is the latest narrative adventure game from DONTNOD Entertainment, the studio behind the beloved franchise, Life Is Strange. In this intimate thriller, twins Tyler and Alyson Ronan use their special bond to unravel mysteries of their loving but troubled childhood. Set in beautiful small-town Alaska, Tell Me Why features true-to-life characters, mature themes and gripping choices.",
    "score": "79"
  },
  {
    "id": "eb78625f-0d78-480c-8fae-a126044190c6",
    "title": "Freedom Finger",
    "rankNumber": "25.",
    "img": "https://static.metacritic.com/images/products/games/1/19c8621a8f23f1ff46d9c506541882df-98.jpg",
    "platform": "Xbox One",
    "date": "March 24, 2020",
    "description": "Freedom Finger is a music driven, side-scrolling shooter that sends you blasting across 40 levels of crazy cartoon action. Starring Nolan North, John DiMaggio, and Sam Riegel. Featuring music by Aesop Rock, Red Fang, METZ, Power Trip, Com Truise, and many more!",
    "score": "78"
  },
  {
    "id": "4b26a6e0-bb04-4f8c-925c-3183af29e8c4",
    "title": "PGA Tour 2K21",
    "rankNumber": "26.",
    "img": "https://static.metacritic.com/images/products/games/6/1607c55fb719e3097ce688dabe9ed895-98.jpg",
    "platform": "Xbox One",
    "date": "August 21, 2020",
    "description": "ALL-NEW PGA TOUR CAREER MODE:Prove you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\n    PGA TOUR PROS AND NEW COURSES: Play against Justin Thomas and 11 top pros on stunning, real-life courses including TPC Sawgrass, East Lake Golf Club, and more.\n    BUILD YOUR MYPLAYER & DREAM COURSE: Create and personalize your MyPLAYER with equipment and apparel from brands you love. Design your ultimate course with 1,000s of custom options.\n    DOMINATE THE GREEN AT ANY SKILL LEVEL: Rookies can take advantage of real-time tutorials, tips and shot suggestions. Already a pro? Master your game with Pro Vision, Distance Control, Putt Preview, and other innovations.\n    GET THE PARTY STARTED: Hit the links with friends by playing local and online matches, including Alt-Shot, Stroke Play, Skins and 4-Player Scramble.\n    MAKE YOUR OWN RULES: Command your Clubhouse with Online Societies. Run full seasons and tournaments and earn bragging rights on the course. Create entry rules and requirements as well as handicap and event settings.\n    THE MOST REALISTIC COURSES EVER: Real-world scanning brings the fairway, green, bunkers, trees, lakes and ponds to life! True-to-form PGA TOUR broadcast presentation features slick graphics, dynamic cut-scenes and a seamless replay system, all anchored by the play-by-play commentary of Luke Elvy and Rich Beem.",
    "score": "78"
  },
  {
    "id": "84415cb7-54a8-4f91-861b-ae5a2a4aac63",
    "title": "Moving Out",
    "rankNumber": "27.",
    "img": "https://static.metacritic.com/images/products/games/7/1ed9bf06abf4d7e64eed808304a380dd-98.jpg",
    "platform": "Xbox One",
    "date": "April 28, 2020",
    "description": "Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!\n\nAre you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there's no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!",
    "score": "78"
  },
  {
    "id": "bf47edeb-412c-4848-9e95-974f54c99465",
    "title": "Zombie Army 4: Dead War",
    "rankNumber": "28.",
    "img": "https://static.metacritic.com/images/products/games/6/c5fc229a05b102cdd559e3abf5271e8a-98.jpg",
    "platform": "Xbox One",
    "date": "February 4, 2020",
    "description": "Hitler’s hordes are back for more in this spine-chilling shooter from the makers of Sniper Elite 4! Abominable occult enemies, epic weapons and a harrowing new campaign for 1-4 players await in 1940s Europe, as you fight to save humankind from undead Armageddon!",
    "score": "77"
  },
  {
    "id": "c093d8bd-2cf8-41d9-a509-6379df051fb5",
    "title": "Darksiders Genesis",
    "rankNumber": "29.",
    "img": "https://static.metacritic.com/images/products/games/4/34a4b8fa1e7f70f1945a7e595f187de0-98.jpg",
    "platform": "Xbox One",
    "date": "February 14, 2020",
    "description": "From the dawn of creation, the council has maintained the Balance across existence. Carrying out their orders are the Horsemen, Nephilim (powerful beings spawned from the unnatural union of angels and demons) who have pledged themselves to the Council and been granted immense power.\n\nHowever, this power came at a tragic cost: the Horsemen were ordered to use their newfound strength to wipe out the rest of their kind. What followed was a bloody battle on Eden where the Horsemen, obeying the will of the Council, annihilated the Nephilim.\n\nDarksiders: Genesis is an action/adventure that tears its way through hordes of demons, angels, and everything in-between on its way to Hell and back with guns blazing and swords swinging. Genesis gives players their first look at the world of Darksiders before the events of the original game, as well as introduces the horseman Strife.",
    "score": "77"
  },
  {
    "id": "03f4ce45-d085-463d-9022-a807f65ee2db",
    "title": "One Piece: Pirate Warriors 4",
    "rankNumber": "30.",
    "img": "https://static.metacritic.com/images/products/games/8/242de860b3355a9fcdae1a4ab9306007-98.jpg",
    "platform": "Xbox One",
    "date": "March 27, 2020",
    "description": "The Pirate Warriors are back and bring with them a more explosive story, more environments and even crazier attacks in ONE PIECE: PIRATE WARRIORS 4. Follow Luffy and the Straw Hats from the beginning as they make their journey through different islands and onwards in the hopes of finding the illustrious treasure - the One Piece. Play through some of the most extraordinary areas in the ONE PIECE story and take on memorable foes.\n\nChoose from some of your favorite characters and take on a vast number of enemies through iconic moments from the OnePiece anime. Developed by the masters of the action musou genre, KOEI TECMO GAMES, ONE PIECE Pirate Warriors 4 brings together the excitement from slashing hordes of enemies with the fun and energetic personalities from the One Piece series. Setsail on a new pirate warriors adventure.",
    "score": "76"
  },
  {
    "id": "d0fcc335-cfcf-45c6-8873-45af3790bf13",
    "title": "Deliver Us The Moon",
    "rankNumber": "31.",
    "img": "https://static.metacritic.com/images/products/games/0/d980f3f6894fde1384beda1b2e2cbf98-98.jpg",
    "platform": "Xbox One",
    "date": "April 23, 2020",
    "description": "Deliver Us The Moon is a Sci-Fi thriller set in an apocalyptic near future, where Earth's natural resources are depleted. A lone astronaut is sent to the moon on a critical mission to save humanity from extinction.",
    "score": "76"
  },
  {
    "id": "17d1baaa-e620-41ee-95c2-d72f6ec6a4f7",
    "title": "Saints Row: The Third Remastered",
    "rankNumber": "32.",
    "img": "https://static.metacritic.com/images/products/games/0/5a493e31b993cfe3a85f150da23fe2b6-98.jpg",
    "platform": "Xbox One",
    "date": "May 22, 2020",
    "description": "Experience The Full Package, Remastered. Steelport, the original city of sin, has never looked so good as it drowns in sex, drugs and guns. The Third Street Saints are at the height of power and yours to control. This is your city. These are your rules.",
    "score": "76"
  },
  {
    "id": "2efc6d78-ac3a-40cf-9ecd-49731e97c1ac",
    "title": "Journey to the Savage Planet",
    "rankNumber": "33.",
    "img": "https://static.metacritic.com/images/products/games/3/f30e80c767c25644d7008260c57bb9d6-98.jpg",
    "platform": "Xbox One",
    "date": "January 28, 2020",
    "description": "In this colorful, co-op adventure game you play as the newest recruit to Kindred Aerospace. Dropped onto an uncharted planet with little equipment, you must determine if this planet is fit for human habitation but perhaps you are not the first to set foot here…",
    "score": "76"
  },
  {
    "id": "fcc74ca0-7608-479d-ab1c-7786bd12edb9",
    "title": "Hunt: Showdown",
    "rankNumber": "34.",
    "img": "https://static.metacritic.com/images/products/games/6/5f2980efb845bc3b04922ca8af8787a5-98.jpg",
    "platform": "Xbox One",
    "date": "February 18, 2020",
    "description": "Hunt: Showdown is a competitive first-person bounty hunting game that packs the thrill of survival games into a match-based format. Set in Louisiana in 1895, the game boasts a mixture of PvP and PvE elements that creates a uniquely tense experience. It’s not just the creatures who are a threat—it’s every Hunter on the map. In the classic game mode, a match of Hunt pits ten players—playing solo or in teams of two—against each other as they race to take out gruesome beasts for a bounty they must collect and get off of the map, while Hunt’s quickplay mode offers a shorter match for solo players to scavenge for weapons as they compete for a diminishing pool of bounty. The higher the risk, the higher the reward–but a single mistake could cost everything.",
    "score": "76"
  },
  {
    "id": "a05498a5-1299-4b31-87a8-81a6576f18c3",
    "title": "The Persistence",
    "rankNumber": "35.",
    "img": "https://static.metacritic.com/images/products/games/3/63d0c49e54caf6cb6804115467320fc2-98.jpg",
    "platform": "Xbox One",
    "date": "May 21, 2020",
    "description": "The Persistence challenges you to survive aboard a doomed starship, overrun with horrific and murderous abberations.  Explore, evade and fight your way through the depths to bring the craft home.",
    "score": "76"
  },
  {
    "id": "8a5dd0c8-3327-4b78-9fc8-a405f00a27e6",
    "title": "Carrion",
    "rankNumber": "36.",
    "img": "https://static.metacritic.com/images/products/games/1/808457c5b69fe347f7e109144e89b089-98.jpg",
    "platform": "Xbox One",
    "date": "July 23, 2020",
    "description": "In Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities on the path to retribution that include a web-like ranged attack, the ability to bend light to become temporarily invisible, and even possess humans for maximum terror.",
    "score": "76"
  },
  {
    "id": "efcf607f-4f2d-4d4a-8224-3bbf5c9af149",
    "title": "Mortal Shell",
    "rankNumber": "37.",
    "img": "https://static.metacritic.com/images/products/games/2/3d7d10f861a416307d9d77d675fb3251-98.jpg",
    "platform": "Xbox One",
    "date": "August 18, 2020",
    "description": "Mortal Shell is a deep action-RPG that tests your sanity and resilience in a shattered world. Your adversaries spare no mercy, with survival demanding superior awareness, precision, and instincts. Possess lost warriors, track down hidden sanctums of the devout, and face formidable foes.",
    "score": "76"
  },
  {
    "id": "c0a354cd-99a3-492a-b372-be70d1844f8e",
    "title": "TT Isle of Man: Ride On The Edge 2",
    "rankNumber": "38.",
    "img": "https://static.metacritic.com/images/products/games/8/bacf4162e7be64261cbd3365851522a2-98.jpg",
    "platform": "Xbox One",
    "date": "March 19, 2020",
    "description": "Without a shadow of a doubt it is one of the most dangerous motorbike races in the world. In TT Isle of Man – Ride On the Edge 2, you prove your worth in different championships before setting out to conquer the Snaefell Mountain Course, a 60 km-long track with both winding and straight sections that will push your riding skills to the limit. TT 2 features 17 additional tracks, 18 different motorbikes including classic models, and the official riders. And now it’s more realistic than ever, thanks to entirely revamped physics and faithfully reproduced rider movements. Fine-tune your motorbike, upgrade its performance and monitor its data in real time so you can stay competitive. TT2 also offers a brand-new open world, a biker's paradise where you can test your bike settings and gain the experience you'll need to win the TT Isle of Man title!",
    "score": "75"
  },
  {
    "id": "45378f8e-9691-4ab2-ac87-aebc41752000",
    "title": "Shantae and the Seven Sirens",
    "rankNumber": "39.",
    "img": "https://static.metacritic.com/images/products/games/8/e16f6f881672628e3ed7b123135f227c-98.jpg",
    "platform": "Xbox One",
    "date": "May 28, 2020",
    "description": "New locations, abilities, and friends await in Shantae's biggest adventure yet!\n\nShantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble in paradise. As Shantae gets caught up in the island's sinister secrets, she'll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she'll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae's powers to suit their own style of play. \n\nKey Features:\n\n* Explore an interconnected world using new Fusion Magic creature transformations, including a newt and other aquatic forms!\n* 4K-resolution hand-painted visuals (on 4K devices only)!\n* All-new characters and returning favorites like Rottytops, Sky, Bolo, and the nefarious Risky Boots!\n* Collect and power up with monster cards!\n* Enjoy minigames, acquire magic and items, and uncover secrets!\n* Gorgeously animated TV-style cutscenes!",
    "score": "75"
  },
  {
    "id": "71d2c81b-87e7-4e2a-a9a7-7279af0108d4",
    "title": "Assetto Corsa Competizione",
    "rankNumber": "40.",
    "img": "https://static.metacritic.com/images/products/games/2/23b3d11753c342b324c0b8fcd359870a-98.jpg",
    "platform": "Xbox One",
    "date": "June 23, 2020",
    "description": "Assetto Corsa Competizione is an extraordinary racing simulation game allowing players to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint, Endurance and Spa 24 Hours races come to life with an incredible level of realism, in both single and multiplayer modes. Born from KUNOS Simulazioni's long-term experience, this racing simulator takes full advantage of Unreal Engine 4 to ensure photorealistic weather conditions and graphics, night races, motion capture animations, reaching a new standard in terms of driving realism and immersion, thanks to its further improved tyre and aerodynamic models.",
    "score": "75"
  },
  {
    "id": "10eb684e-b180-42c5-8493-e5beb03c6803",
    "title": "Rock of Ages 3: Make & Break",
    "rankNumber": "41.",
    "img": "https://static.metacritic.com/images/products/games/7/9efcd721572c3b01ddd1f93958743270-98.jpg",
    "platform": "Xbox One",
    "date": "July 21, 2020",
    "description": "Competitive tower defense meets arcade action and gets rolled up with ACE Team's quirky, Monty Python-esque humor into one giant, creative game for the ages. This time around, you can even make your own levels!",
    "score": "74"
  },
  {
    "id": "f41d556a-bd2c-450f-a5b3-59dc39007a45",
    "title": "Monster Energy Supercross - The Official Videogame 3",
    "rankNumber": "42.",
    "img": "https://static.metacritic.com/images/products/games/3/c8b3e8f8ca4c2b615370fc046097a0a8-98.jpg",
    "platform": "Xbox One",
    "date": "February 4, 2020",
    "description": "Monster Energy Supercross 3 is more Multiplayer than ever. Enjoy a new multiplayer experience with the dedicated servers and discover the Race Director mode.",
    "score": "74"
  },
  {
    "id": "5d8622c9-015e-403e-a0bf-0f244f8a8e91",
    "title": "HyperParasite",
    "rankNumber": "43.",
    "img": "https://static.metacritic.com/images/products/games/3/e6ad51477af88ba6a6305b5fdc0710e9-98.jpg",
    "platform": "Xbox One",
    "date": "April 3, 2020",
    "description": "A rogue-lite twin-stick shooter/brawler that never plays the same twice. Collect and control 60 different characters as the body-snatching alien Parasite with a grudge against humanity. Fight to the top of the food chain: possess the President, push the Big Red Button and one-up the human race.",
    "score": "74"
  },
  {
    "id": "3fd37816-f68b-46cb-acde-2bb4456ad4b9",
    "title": "Minecraft Dungeons",
    "rankNumber": "44.",
    "img": "https://static.metacritic.com/images/products/games/8/25ce149355e886f43ea61f08265aa949-98.jpg",
    "platform": "Xbox One",
    "date": "May 26, 2020",
    "description": "What exactly is Minecraft: Dungeons? It's an all-new action-adventure game inspired by classic dungeon crawlers, where you'll constantly discover new weapons and items that will help you defeat a ruthless swarm of new-and-nasty mobs. You'll fight or flee through canyons, swamps and of course mines. You can brave the dungeons alone, or team up with friends. Up to four players can battle together through action-packed, treasure-stuffed, wildly varied levels, all in an epic quest to save the villagers and take down the evil Arch-Illager.",
    "score": "74"
  },
  {
    "id": "f15e9124-c36c-46d7-82a1-880d9435c487",
    "title": "Battletoads",
    "rankNumber": "45.",
    "img": "https://static.metacritic.com/images/products/games/4/ecb3c37c24c0b26b8aabfbfc1c0c0995-98.jpg",
    "platform": "Xbox One",
    "date": "August 20, 2020",
    "description": "The Battletoads are Back. Rash, Zitz and Pimple are returning at last to Morph Attack their way through an all-new action-packed adventure of choreographed chaos, and couch co-op may never be the same again. 1-3 players take control of the Battletoads and team up to storm through wild and unpredictable stages with only one rule expect the unexpected. Teamwork makes the dream work in a drop-in, drop-out gameplay blast, filled with over-the-top combat that anyone can enjoy, but only a True 'Toad can master. With a unique hand-animated cartoon style and packed with memorable characters and locations, the Battletoads are back for a larger-than-life brawl across the universe that promises to be fun alone, and unforgettable together.",
    "score": "73"
  },
  {
    "id": "172b69de-ee1a-4fc2-aaa8-a0aa8ef6e037",
    "title": "Samurai Jack: Battle Through Time",
    "rankNumber": "46.",
    "img": "https://static.metacritic.com/images/products/games/6/13975b7215099526f4f5df81197b74d8-98.jpg",
    "platform": "Xbox One",
    "date": "August 21, 2020",
    "description": "Become Samurai Jack, the greatest warrior of the past, present and future. Journey through time to finally stop Aku’s evil reign in this new adventure told by the creators of Samurai Jack. Encounter your favorite characters from the show including The Scotsman, Scaramouche, Sir Rothchild and more.",
    "score": "73"
  },
  {
    "id": "3121d4b7-ba27-4ee4-82ad-50a0e7ea6a2e",
    "title": "Dragon Ball Z: Kakarot",
    "rankNumber": "47.",
    "img": "https://static.metacritic.com/images/products/games/6/699fb8fbae8cc4091f237814b5253197-98.jpg",
    "platform": "Xbox One",
    "date": "January 17, 2020",
    "description": "Relive the story of Goku in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from the DRAGON BALL Z universe. \n\nExperience the Story\nExperience the story of DRAGON BALL Z from epic events to light-hearted side quests, including never-before-seen story moments that answer some burning questions of Dragon Ball lore for the first time!\n\nIconic DRAGON BALL Z\nPlay through iconic DRAGON BALL Z battles on a scale unlike any other. Fight across vast battlefields with destructible environments and experience epic boss battles that will test the limits of your combat abilities. Increase your power level and rise to the challenge! \n\nDon't Just Fight As Goku\nLive as Goku. Fish, fly, eat, train, and battle your way through the DRAGON BALL Z sagas, making friends and building relationships with a massive cast of DRAGON BALL characters.",
    "score": "73"
  },
  {
    "id": "974f31a6-8633-403f-82f9-cf67332fb5e0",
    "title": "West of Dead",
    "rankNumber": "48.",
    "img": "https://static.metacritic.com/images/products/games/9/12128c942456d54f111b1ae8f96026da-98.jpg",
    "platform": "Xbox One",
    "date": "June 18, 2020",
    "description": "Descend into the grim and gritty world of Purgatory in this fast-paced cover shooter which combines the fluidity of twin-stick controls and tactical cover usage. Dodge behind cover as you try to outgun your enemies in the unknown procedurally generated hunting grounds.",
    "score": "73"
  },
  {
    "id": "ded7fe5b-9064-4728-8366-6827e6e8b7ba",
    "title": "Infliction: Extended Cut",
    "rankNumber": "49.",
    "img": "https://static.metacritic.com/images/products/games/3/b387e5abe7d1eb07180ad487405f797e-98.jpg",
    "platform": "Xbox One",
    "date": "February 25, 2020",
    "description": "Wander through an interactive nightmare set within a once-happy home. Uncover the heartbreaking mystery hidden within messages, artwork, and other vestiges of domestic life all while struggling to survive encounters with a relentless entity that stands in the way of finding absolution.",
    "score": "72"
  },
  {
    "id": "5652b933-e5a0-4bbd-bb40-27ec08982f86",
    "title": "Tannenberg",
    "rankNumber": "50.",
    "img": "https://static.metacritic.com/images/products/games/1/bf5f443888ddb1ac0a7e0a906ddd31a0-98.jpg",
    "platform": "Xbox One",
    "date": "July 24, 2020",
    "description": "Experience authentic First World War action with 64 player battles of maneuver on the Eastern Front. Warfare between the Russian Empire and the Central Powers is a tense battle for dominance – stay close to your squad to survive!",
    "score": "72"
  },
  {
    "id": "d1c31cc3-bf6c-4c76-84a8-038370eb40be",
    "title": "SpongeBob SquarePants: Battle for Bikini Bottom - Rehydrated",
    "rankNumber": "51.",
    "img": "https://static.metacritic.com/images/products/games/9/e44d5214de77da299ae6f74eda63f1c1-98.jpg",
    "platform": "Xbox One",
    "date": "June 23, 2020",
    "description": "Are you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course you do! Want to underpants bungee jump? Why wouldn't you! Want to join forces in a brand new multiplayer mode? The battle is on!\n\nGAME FEATURES\n- Play as SpongeBob, Patrick and Sandy and use their unique sets of skills\n- Thwart Plankton's evil plan to rule Bikini Bottom with his army of wacky robots\n- Meet countless characters from the beloved series\n\nREMAKE FEATURES\n- Faithful remake of one of the best SpongeBob games ever created\n- High-end visuals, modern resolutions and carefully polished gameplay\n- Brand new horde mode multiplayer for up to two players, online and offline\n- Restored content that was cut from the original game like the Robo Squidward boss fight and more",
    "score": "71"
  },
  {
    "id": "8766452e-70b4-4c2e-8260-ed48a86606f2",
    "title": "Maneater",
    "rankNumber": "52.",
    "img": "https://static.metacritic.com/images/products/games/4/7ea8f195dbd77fd3c1da1712bbc45220-98.jpg",
    "platform": "Xbox One",
    "date": "May 22, 2020",
    "description": "Maneater breaks new ground in the popular action RPG genre and finds players taking on the role of a deadly shark with the uncanny ability to evolve as it feeds. Eat, Explore and Evolve in an Open World Action RPG. Play through a full narrative, story-based campaign narrated by Chris Parnell. (Saturday Night Live, 30 Rock, Rick, and Morty)\n    Feed on humans, consume nutrients and find rare shark loot to evolve past what nature intended.\n    Explore 7 large regions including bayous of the gulf coast, resort beaches, industrial docks, the open ocean and more. Experience a living world with a full Day/Night cycle.\n    Unlock and equip various Evolutions that improve and enhance your shark as you progress through the campaign.\n    Hunter Parties and Bounty System - the humans fight back! The Battle against various types of hunters ranging from small skiffs all the way up to the coast guard.",
    "score": "71"
  },
  {
    "id": "eb20572c-67ce-43e5-9355-bd83817cc1dc",
    "title": "Beyond Blue",
    "rankNumber": "53.",
    "img": "https://static.metacritic.com/images/products/games/3/8be2e8a8a64b742f2e6344ffafeec4e4-98.jpg",
    "platform": "Xbox One",
    "date": "June 11, 2020",
    "description": "Beyond Blue takes players into the near future, where they will have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. She and her newly-formed research team will use groundbreaking technologies to see, hear, and interact with the ocean in a more meaningful way than has ever been attempted. The game features an evocative narrative and exploration of an untouched world. Embracing the same inclusive development process that was used to create Never Alone (Kisima Ingitchuna), E-Line’s BAFTA award-winning game about Alaska Native culture, the company partnered with BBC Studios (developers of the acclaimed Blue Planet II), OceanX Media, world-class game makers, and some of science’s leading ocean experts to craft an experience that reflects the awesome wonder and unbounded mystery that infuses our planet’s beating blue heart.",
    "score": "71"
  },
  {
    "id": "37c7b70f-50ed-4cf5-a9b4-3ca9cfc95d7d",
    "title": "Project CARS 3",
    "rankNumber": "54.",
    "img": "https://static.metacritic.com/images/products/games/3/1f782840377623af2c490976314f8053-98.jpg",
    "platform": "Xbox One",
    "date": "August 3, 2020",
    "description": "Project CARS 3 is the third instalment in the best-seller racing franchise that brings all the intense thrills, emotions and fun from the vibrant world of motor racing to vivid life as players undertake a whole new exciting career journey that sees them rise from weekend warrior to racing legend.\n\nAlso new to the franchise is a deeply engaging metagame that challenges players to race hard and earn in-game Credits with which to buy and own hundreds of cars from the world's most elite brands and race them all on dynamic and spectacular circuits around the globe featuring stunning all-weather, all-seasons conditions.\n\nRace-won Credits and XP will also entice players to buy authentic performance upgrades and customisation options for their stable of exclusive cars, including wheels, tyres, body kits, rims, as well as personalisation options to create their own racing hero personas.\n\nWith a completely redesigned and unrivalled controller experience, an even more accurate and fun handling model, adjustable skill settings for every level of driver and every element of weather-affected races, Project CARS 3 is the biggest, most exciting and authentic evolution to the definitive racing franchise.",
    "score": "71"
  },
  {
    "id": "971de81f-be3a-43ef-9144-e259a784930d",
    "title": "Rocket Arena",
    "rankNumber": "55.",
    "img": "https://static.metacritic.com/images/products/games/9/4e2529865154b1006e1f6897512701ad-98.jpg",
    "platform": "Xbox One",
    "date": "July 14, 2020",
    "description": "Welcome to a world where the rules are written in rocket fuel. Rockets control everything in Rocket Arena, an explosive 3v3 shooter where you’re never out of the action. Master your hero’s unique rockets and abilities to rule the arena and become a champion.",
    "score": "71"
  },
  {
    "id": "bbf5d802-b83b-4675-aa6e-114b4721b4c4",
    "title": "The Inner Friend",
    "rankNumber": "56.",
    "img": "https://static.metacritic.com/images/products/games/9/a004e38520673b0aba2c7817317e93ad-98.jpg",
    "platform": "Xbox One",
    "date": "April 28, 2020",
    "description": "Descend into an eerie world made of scattered memories and unresolved traumas and explore a nightmarish landscape where you will come face to face with childhood fears and nightmares.",
    "score": "71"
  },
  {
    "id": "4fcad069-5f61-4c6e-94d5-cacfdcb881e2",
    "title": "Madden NFL 21",
    "rankNumber": "57.",
    "img": "https://static.metacritic.com/images/products/games/4/9e184d9ff7d2df2026daa06ef7a3f3c1-98.jpg",
    "platform": "Xbox One",
    "date": "August 25, 2020",
    "description": "Innovative new gameplay mechanics in Madden NFL 21 deliver advanced levels of control and inspire creativity. Get crafty with the all-new Skill Stick that allows for enhanced precision on both sides of the ball. Push the limits of your legacy in Face of the Franchise: Rise To Fame. The new playable documentary career mode offers all-out levels of agency and depth throughout your journey to the Hall of Fame. Pull up for a brand-new season of Ultimate Team content as you earn rewards to finesse your depth chart and flex your fantasy roster on the competition. Your favorite NFL teams’ playbooks are updated in Play Now and Franchise based on new schemes and new plays utilized during the real-life NFL season. [Electronic Arts]",
    "score": "70"
  },
  {
    "id": "3130bba1-f7d4-4cc9-ba9f-42d4947304d8",
    "title": "AO Tennis 2",
    "rankNumber": "58.",
    "img": "https://static.metacritic.com/images/products/games/2/fbd28364f3c873fc378506697f222f73-98.jpg",
    "platform": "Xbox One",
    "date": "February 11, 2020",
    "description": "AO Tennis 2 is the only tennis experience designed for and by its community. Create your own players, stadiums and legendary matches. Enter the competition to reach the top of world tennis in Career Mode.",
    "score": "69"
  },
  {
    "id": "2d4f8ba6-c789-4113-95a4-fcd26ecf9919",
    "title": "NASCAR Heat 5",
    "rankNumber": "59.",
    "img": "https://static.metacritic.com/images/products/games/1/3c46d397b8eb53a47469ab7375e0d742-98.jpg",
    "platform": "Xbox One",
    "date": "July 7, 2020",
    "description": "NASCAR heat 5, the official video game of the world's most popular stockcar racing Series, puts you behind the wheel of these incredible racing machines and challenges you to become the 2020 NASCAR Cup Series champion. Features all the official teams, drivers and cars from the three NASCAR national series as well as the Xtreme dirt Tour, racing on 38 Authentic tracks. All official 2020 NASCAR tracks, teams, cars, drivers and schedule from four racing Series - the 2020 NASCAR Cup Series, NASCAR XFINITY series, NASCAR gander rv & outdoors Truck series and fan-favorite, the extreme dirt Tour. Split screen multiplayer allows you to race against your friends on the same screen.",
    "score": "69"
  },
  {
    "id": "0975e0a6-292d-4c3c-961c-d21103a68fdd",
    "title": "Destroy All Humans!",
    "rankNumber": "60.",
    "img": "https://static.metacritic.com/images/products/games/7/bed4c9db65b5d19d9aaa0daf7f973d34-98.jpg",
    "platform": "Xbox One",
    "date": "July 28, 2020",
    "description": "The cult-classic returns! Terrorize the people of 1950s Earth in the role of the evil alien Crypto-137. Harvest DNA and bring down the US government in the remake of the legendary alien invasion action adventure. Annihilate puny humans using an assortment of alien weaponry and psychic abilities. Reduce their cities to rubble with your flying Saucer! One giant step on mankind!",
    "score": "69"
  },
  {
    "id": "8fb9f3a5-88ee-4f24-8622-b912a862105e",
    "title": "Golf With Your Friends",
    "rankNumber": "61.",
    "img": "https://static.metacritic.com/images/products/games/6/6c136f510cff8f1c8ef68ddb389809c5-98.jpg",
    "platform": "Xbox One",
    "date": "May 19, 2020",
    "description": "Golf With Your Friends is an entertaining, challenging, multiplayer mini golf game for up to 12 players. The game currently has 3 levels containing 18 holes each. The controls are simple and the game is designed for the user to be able to host or join a game within a few seconds.",
    "score": "68"
  },
  {
    "id": "c092b952-be76-4544-851f-777845d33b50",
    "title": "Daymare: 1998",
    "rankNumber": "62.",
    "img": "https://static.metacritic.com/images/products/games/3/4c63469e0ef54e042a00494d6147b8d4-98.jpg",
    "platform": "Xbox One",
    "date": "April 28, 2020",
    "description": "Daymare: 1998 is a third person survival horror game with over the shoulder camera, developed in Unreal Engine 4 for Windows PC. The game features high-end graphics, original soundtrack, immersive atmosphere, hardcore survival mechanics and many connections with the beloved old school survival horror games and '90s landmark brands.",
    "score": "68"
  },
  {
    "id": "bd3fdd89-68ae-4f77-9594-3a2de5150050",
    "title": "The Complex",
    "rankNumber": "63.",
    "img": "https://static.metacritic.com/images/products/games/3/58807e799114abe4d82b720df2041634-98.jpg",
    "platform": "Xbox One",
    "date": "March 31, 2020",
    "description": "The Complex is an interactive sci-fi thriller movie from the publishers of Late Shift and The Bunker. After a major bio-weapon attack on London, two scientists find themselves in a locked-down laboratory with time, and air, running out. Your actions and your relationship with other characters will lead you to one of eight suspenseful endings.",
    "score": "68"
  },
  {
    "id": "8b7eb337-ae5b-46a6-aefb-b469e1224f8f",
    "title": "Disintegration",
    "rankNumber": "64.",
    "img": "https://static.metacritic.com/images/products/games/8/f1a9ca92566492774961dde369995cf0-98.jpg",
    "platform": "Xbox One",
    "date": "June 16, 2020",
    "description": "Dive into an action-drived first-person shooter, set in near-future sci-fi universe created by V1 Interactive, a newly-assembled studio of industry veterans. Journey into a vision of tomorrow where humankind is on the brink of extinction and has turned to technology in the hope of survival. Using a process known as Integration, human minds are surgically implanted into robotic armatures creating a new form of sentient life. As a domineering enemy superpower known as the Rayonne emerges, take on the role of Romer Shoal, an expert Gravcycle pilot. Astride your heavily-modified craft (fitted with an armoured chassis and a powerful array of weapons), lead a small resistance force in the fight to save what remains of humanity.",
    "score": "67"
  },
  {
    "id": "f0da419a-f84d-42cc-a91d-b7cba1f1183f",
    "title": "Mafia II: Definitive Edition",
    "rankNumber": "65.",
    "img": "https://static.metacritic.com/images/products/games/3/11997dd9522e193e55a12dc76415c767-98.jpg",
    "platform": "Xbox One",
    "date": "May 19, 2020",
    "description": "After taking a bullet during World War II and returning home to Empire Bay on leave, Sicilian immigrant Vito Scaletta discovers that his late father was indebted to a loan shark. He needs to make a lot of money fast, and thanks to his career criminal best friend Joe, soon becomes entangled with the mob. As Vito, you need to prove yourself by committing crimes of escalating reward, status, and consequence. But what happens when your motivations become less about necessity and more about greed? When having it all is not enough? For the first time ever, Mafia II: Definitive Edition packs the entire Mafia II crime drama into one HD package. HDR and 4K resolution are supported on PC as well as on PlayStation®4 Pro and Xbox One X consoles. Mafia II: Definitive Edition also benefits from improved facial animations to give cutscenes an even more cinematic feel. While technological and graphical improvements have given Empire Bay and its inhabitants a visual overhaul, Vito's timeless story is unchanged.",
    "score": "66"
  },
  {
    "id": "cff942ad-409d-4284-8813-ee6ddae78f43",
    "title": "Skully",
    "rankNumber": "66.",
    "img": "https://static.metacritic.com/images/products/games/5/42065b7d1fae76b567aa8f943971303a-98.jpg",
    "platform": "Xbox One",
    "date": "August 4, 2020",
    "description": "On a mysterious remote island, a skull washes up on shore and is reawakened by an enigmatic deity. Dubbed Skully, the newly reanimated being has been summoned to intervene in a war between the deity’s three siblings, whose quarrel jeopardizes the island they call home.",
    "score": "66"
  },
  {
    "id": "bb2d852b-ba78-430b-bb87-cadbdfe0871d",
    "title": "Bleeding Edge",
    "rankNumber": "67.",
    "img": "https://static.metacritic.com/images/products/games/7/8f3f9edd960953a91b31e5c7b350f1f6-98.jpg",
    "platform": "Xbox One",
    "date": "March 24, 2020",
    "description": "From the studio behind DmC: Devil May Cry and Hellblade: Senua’s Sacrifice comes Bleeding Edge, a fast and frenetic 4v4 team brawler where every fighter comes mechanically enhanced for mayhem!\nChoose your fighter from a diverse cast of colorful characters from the edges of society: burn rubber as bold and beautiful Buttercup with her detachable saw blade arms, wreak havoc as Black-Metal rocker Niđhöggr with his electrifying guitar solos or slash up the streets as Daemon, New York’s most wanted assassin.",
    "score": "66"
  },
  {
    "id": "10475274-ef53-4e25-ac30-272c9d9f1bab",
    "title": "My Hero One's Justice 2",
    "rankNumber": "68.",
    "img": "https://static.metacritic.com/images/products/games/9/3e0096b6f7481e7e1d24f8ae656e9daf-98.jpg",
    "platform": "Xbox One",
    "date": "March 13, 2020",
    "description": "The battle for justice continues, but this time the fight gets bigger, badder, and more quirkier in MY HERO ONE’S JUSTICE 2. Based on the hit anime series, all of your favorite characters return in this 3D arena fighter that pits heroes and villains in the ultimate test for righteousness.\n\nPlay through the anime and experience memorable fights as you relive iconic scenes. Pick up after the finish of MY HERO ONE’S JUSTICE and see what happens to Deku and the class at UA.\n\nThe cast from MY HERO ONE’S JUSTICE are back and they’re now joined by newly added characters from the series.With 40 playable characters, build your dream team with your favorite hero or villain. Fight to build up your PLUS ULTRAmeter and pull off quirks in special combos that goes beyond!",
    "score": "65"
  },
  {
    "id": "8605432b-b376-41c2-b19f-e27d07f161cd",
    "title": "Night Call",
    "rankNumber": "69.",
    "img": "https://static.metacritic.com/images/products/games/4/b589f8e59b1ada396332e02a9aa9087d-98.jpg",
    "platform": "Xbox One",
    "date": "June 24, 2020",
    "description": "A mysterious serial killer stalks the streets of modern-day Paris. The body count rises, and the police are no closer to catching the culprit. You are a taxi driver and survivor to the killer's most recent attacks, having barely escaped with your life. You have seven nights to help find the killer, or the police will pin it on you. These next few shifts will be far from ordinary or safe...\n\nNight Call is a non-linear, narrative-driven noire investigation game. You are no detective, but you do have a gift. Around you, people feel more at ease. They talk. They share their thoughts, their emotions, their stories... their secrets. To passengers, you are more than just a driver; you are also a friend, a confidant, a shrink. A voyeur catching a glimpse under the masked but very real lives throughout the City of Light. And you'll need to play these roles well if you want to catch the killer.\n\nUse the limited time you have available each night to gather clues while earning money to pay your bills. Drive passengers to their destinations, hear their stories and choose your responses carefully -- some are just regular people with a tale to tell, while others might reveal a clue that's key to your investigation. Follow the right leads to uncover new info about the suspects, and don't forget to make enough money to buy gas and pay your bills.\n\nCan you solve the mystery before it's too late? Better hurry -- both the clock and the meter are running...",
    "score": "65"
  },
  {
    "id": "d5fafe12-8f54-4a40-b86b-14d4524fe6cd",
    "title": "Windbound",
    "rankNumber": "70.",
    "img": "https://static.metacritic.com/images/products/games/5/61d2fe3dd0104e2f626529428e7fdf38-98.jpg",
    "platform": "Xbox One",
    "date": "August 28, 2020",
    "description": "Embark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island's untamed terrain for resources that you can use to craft a full range of tools and weapons to hunt wildlife and upgrade your boat. You must set sail when resources become scarce. Your boat is your key companion on this journey, carefully craft your own custom sailing vessel to take on the treacherous waters, traversing from one island to the next.",
    "score": "64"
  },
  {
    "id": "69f63397-aac6-4d93-9c62-48273c4f699e",
    "title": "Moons of Madness",
    "rankNumber": "71.",
    "img": "https://static.metacritic.com/images/products/games/1/360e70a963c6b440baf8f05debece063-98.jpg",
    "platform": "Xbox One",
    "date": "March 24, 2020",
    "description": "Moons of Madness is a first-person, story-driven cosmic horror game where the scientific exploration of Mars meets the supernatural dread of Lovecraft.",
    "score": "64"
  },
  {
    "id": "f790b2a1-82c6-4d2b-ba62-09838f499ca6",
    "title": "OVERPASS",
    "rankNumber": "72.",
    "img": "https://static.metacritic.com/images/products/games/0/b4eec99e7cd3ba36d3fd8a4ccf13d7f4-98.jpg",
    "platform": "Xbox One",
    "date": "March 17, 2020",
    "description": "In Overpass, the player takes control of powerful buggies and quads, scrabbling across extreme tracks and very hazardous terrain. This simulation, unique in its genre, pits the player against craggy slopes and puts their cool-headedness to the test throughout technical obstacle courses along wilderness tracks.\nOverpass's realistic physics engine requires you to keep precise and meticulous control of your speed and acceleration or you risk losing your grip and failing your crossing. You'll need to master the technical characteristics of official reproductions of buggies and quads from iconic brands such as Yamaha, Suzuki or Arctic Cat. Differential locking, 2 or 4 drive wheels, transmission type: the player has been given all the tools they need to discover the real vehicle options that will let them adapt their driving to the terrain.\nThe Career mode lets you manage your buggies and quads and choose the one best adapted to each track and terrain type in order to win the competition and attract sponsors. In multi-player mode, you'll need to know and master the slightest detail of each track in order to post the best times and show that you are truly the master of off-roading!",
    "score": "63"
  },
  {
    "id": "fc4fb96c-b3db-493a-b87f-71d4314ad596",
    "title": "Hunting Simulator 2",
    "rankNumber": "73.",
    "img": "https://static.metacritic.com/images/products/games/9/85aeaa6ca7fafe3ec1808979bf6759ed-98.jpg",
    "platform": "Xbox One",
    "date": "June 30, 2020",
    "description": "With your hunting dog by your side, explore the Texan desert and forests of Colorado and Europe as you track down 33 animal species. Choose your gear from over 160 official weapons, accessories and clothing items (including Browning, Winchester and Bushnell).",
    "score": "63"
  },
  {
    "id": "d7725ee0-a14e-4209-97f8-3ed75a53d947",
    "title": "Maid of Sker",
    "rankNumber": "74.",
    "img": "https://static.metacritic.com/images/products/games/0/480e620569421230231f78c370db640d-98.jpg",
    "platform": "Xbox One",
    "date": "July 28, 2020",
    "description": "Maid of Sker is a first-person survival horror, set in a remote hotel with a gory and macabre history from British folklore. Brave the nightmares of the Quiet Ones. Do not panic…don’t even breathe!",
    "score": "62"
  },
  {
    "id": "ffa526d2-dda4-4da4-b2cd-36dacd3b34b0",
    "title": "One Punch Man: A Hero Nobody Knows",
    "rankNumber": "75.",
    "img": "https://static.metacritic.com/images/products/games/7/861a245b1110b073ec52221710f341d6-98.jpg",
    "platform": "Xbox One",
    "date": "February 28, 2020",
    "description": "Experience the world of ONE-PUNCH MAN for yourself in “ONE PUNCH MAN: A HERO NOBODY KNOWS”. Form a team of your favorite heroes and villains.\nGrow your techniques and see who reigns supreme in this ONE-PUNCH MAN game.",
    "score": "59"
  },
  {
    "id": "593d63c1-7865-451a-a04c-502120c0ec92",
    "title": "Skater XL",
    "rankNumber": "76.",
    "img": "https://static.metacritic.com/images/products/games/6/f74140f756de1756a23b4e8f10dcd103-98.jpg",
    "platform": "Xbox One",
    "date": "July 28, 2020",
    "description": "Skater XL is a head first dive into the skateboarding world, where style, creativity and the perfect trick is yours to define. Create, combine, and style tricks with unparalleled board control as you hit iconic California locations where street legends have left their mark. Play as skating icons Tiago Lemos, Evan Smith, Tom Asta or Brandon Westgate on your way to becoming a skateboarding pro. Dive into the digital skate subculture, with featured community created mods, brands, 'zines, and maps. Hit more than 60 real skate spots connected by block after block of plazas, schools, pools, buildings, car parks and corridors.",
    "score": "59"
  },
  {
    "id": "bb4a9a9e-7c1e-4c1b-8e59-ba7600bddbc8",
    "title": "Those Who Remain",
    "rankNumber": "77.",
    "img": "https://static.metacritic.com/images/products/games/0/66f13011816102909bfc95a069152a24-98.jpg",
    "platform": "Xbox One",
    "date": "May 28, 2020",
    "description": "As the lights go out, the embers of darkness are stoked in the sleepy town of Dormont.\n\nWhispers of disappearances carry through the town as a burgeoning, uneasy and irrational fear begins to spread and darkness comes to be an unwelcome reflection to Those Who Remain.\n\nSome mistakes should never happen, not when your life is complete – and yet they do. Edward had the good life, a beautiful wife and the perfect little girl, yet finds himself several whiskeys down and driving through the night of Dormont to end his secret affair – in a bid to fix his mistakes.\n\nAs Edward pulls into the Golden Oak Motel, he is unaware just how much this night will change his life…\n\nThe horrors and darkness that thrive in the corner of every eye are torn loose…\n\nThose Who Remain places you in an up-close, psychological horror story set in the sleepy town of Dormont – a town in a spiralling split from the fabric of reality, warped by darkness and the deeds of the Citizens who reside.\n\nConfront the uncomfortable horrors reflected by the darkness and survive the night of Dormont as Edward is confronted with a test of his sanity, morality and the shadows of evil that lurks below.",
    "score": "59"
  },
  {
    "id": "2b4291dc-2a69-4576-930a-e6b3da1f7f3a",
    "title": "The Dark Crystal: Age of Resistance Tactics",
    "rankNumber": "78.",
    "img": "https://static.metacritic.com/images/products/games/1/8622d148693a1d5b3c1c62e275235786-98.jpg",
    "platform": "Xbox One",
    "date": "February 4, 2020",
    "description": "Netflix's The Dark Crystal: Age of Resistance comes to life as a tactical strategy game. In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughand going beyondthe events of the Netflix series. Encounter never-seen-before playable characters, stories, and environments.  Over the course of 80 unique turn-based campaign battles taking place across the lands of Thra, recruit new allies and customize their forces by assigning them jobs and outfitting them with new equipment. Continue the Story in an Expanded World of Thra - Delve deeper into the legend of The Dark Crystal to learn more about the Gelfling clans and their histories across more than 5 diverse, modular territories. Choose from over 15 character jobs, play through reimagined and brand-new battles against the malicious Skeksis and help lead the proud Gelfling to victory.\n\nGelfling Tactics - Devise unique ways for the outmatched Gelfling to fulfill their prophecy in multi-layered, turn-based tactical combat. Units can be customized for specific fights with gear, upgradable abilities and a job system. Use guile, planning and cunning to overcome superior foes!\n\nHighly Replayable - Replay finished battles to earn full marks or replay the entire game! Once completed, challenge New Game+ mode, keeping all progress from the first playthrough while facing more difficult versions of battles.\n\nRich, Dynamic Environments - The world of Thra is a living, unpredictable environment as dangerous as it is beautiful. Dynamic events on the battlefield may create opportunities or put the Gelflings at a disadvantage, necessitating rapid changes in strategy.",
    "score": "58"
  },
  {
    "id": "2849a540-ec1b-4957-bc2a-034b0be1e5ff",
    "title": "Sword Art Online: Alicization Lycoris",
    "rankNumber": "79.",
    "img": "https://static.metacritic.com/images/products/games/1/ae28e6755bff95f75813c9c1a0634175-98.jpg",
    "platform": "Xbox One",
    "date": "July 10, 2020",
    "description": "For the first time ever, players can experience SWORD ART ONLINE's anime storyline in game format with SWORD ART ONLINE Alicization Lycoris! Play as the protagonist Kirito and immerse yourself in \"Underworld,\" a mysterious virtual world set in the anime's Alicization arc. Featuring intense battle action, stunning JRPG visuals, and an expansive world to explore; your journey through the latest VRMMO SWORD ART ONLINE game is ready to begin!",
    "score": "58"
  },
  {
    "id": "9c02b4c7-ef65-4dad-841d-6b7ab8624a23",
    "title": "Rugby 20",
    "rankNumber": "80.",
    "img": "https://static.metacritic.com/images/products/games/9/781ba8aa3263313f21cb190af80d96fa-98.jpg",
    "platform": "Xbox One",
    "date": "January 23, 2020",
    "description": "Play with the best national teams and biggest leagues in intense single-player and multiplayer matches, local or online: Top 14, Pro D2, Gallagher Premiership and Pro 14. Experience tactical depth that recreates all the intricacies of the modern game. On the pitch, you can tweak your game plan, manage your line-out, initiate set moves, find spaces and give your side the winning edge.",
    "score": "57"
  },
  {
    "id": "e88d7286-366a-4c9a-8450-314a837cb7ef",
    "title": "Gigantosaurus: The Game",
    "rankNumber": "81.",
    "img": "https://static.metacritic.com/images/products/games/3/825364e610e43bb26bdaa922dfdc0caa-98.jpg",
    "platform": "Xbox One",
    "date": "March 27, 2020",
    "description": "The most exciting episode of Gigantosaurus yet is one you get to play in. But will you be the most roarsome explorer or the fastest racer? Play together with friends and family to help Rocky, Tiny, Mazu and Bill save the day – before dino-dashing to the next zone. Dinosaurs have never had such giant fun!",
    "score": "57"
  }
]